import 'package:lastfivesectionsofquran/models/surah_model.dart';

final List<Surah> surahs = [
  Surah(
    surahNumber: 46,
    surahName: 'الاحقاف',
    werd: [
      Werd(
        werdFromTo: '1-4',
        ayats: [
          "(1) حمٓ",
          "(2) تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ",
          " مَا خَلَقۡنَا ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَآ إِلَّا بِٱلۡحَقِّ وَأَجَلٖ مُّسَمّٗىۚ وَٱلَّذِينَ كَفَرُواْ عَمَّآ أُنذِرُواْ مُعۡرِضُونَ(3)",
          " قُلۡ أَرَءَيۡتُم مَّا تَدۡعُونَ مِن دُونِ ٱللَّهِ أَرُونِي مَاذَا خَلَقُواْ مِنَ ٱلۡأَرۡضِ أَمۡ لَهُمۡ شِرۡكٞ فِي ٱلسَّمَٰوَٰتِۖ ٱئۡتُونِي بِكِتَٰبٖ مِّن قَبۡلِ هَٰذَآ أَوۡ أَثَٰرَةٖ مِّنۡ عِلۡمٍ إِن كُنتُمۡ صَٰدِقِينَ(4)",
        ],
      ),
      Werd(
        werdFromTo: '5-8',
        ayats: [
          "وَمَنْ أَضَلُّ مِمَّن يَدْعُو مِنْ دُونِ اللَّهِ مَنْ لَا يَسْتَجِيبُ لَهُ إِلَىٰ يَوْمِ الْقِيَامَةِ وَهُمْ عَنْ دُعَائِهِمْ غَافِلُونَ (5)",
          "وَإِذَا حُشِرَ النَّاسُ كَانُوا لَهُمْ أَعْدَاءً وَكَانُوا بِعِبَادَتِهِمْ كَافِرِينَ (6)",
          "وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ قَالَ الَّذِينَ كَفَرُوا لِلْحَقِّ لَمَّا جَاءَهُمْ هَٰذَا سِحْرٌ مُبِينٌ (7)",
          "أَمْ يَقُولُونَ افْتَرَاهُ قُلْ إِنِ افْتَرَيْتُهُ فَلَا تَمْلِكُونَ لِي مِنَ اللَّهِ شَيْئًا هُوَ أَعْلَمُ بِمَا تُفِيضُونَ فِيهِ كَفَىٰ بِهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ وَهُوَ الْغَفُورُ الرَّحِيمُ (8)",
        ],
      ),
      Werd(werdFromTo: '9-10', ayats: []),
      Werd(werdFromTo: '11-12', ayats: []),
      Werd(werdFromTo: '13-16', ayats: []),
      Werd(werdFromTo: '17-20', ayats: []),
      Werd(werdFromTo: '21-25', ayats: []),
      Werd(werdFromTo: '26-28', ayats: []),
      Werd(werdFromTo: '29-32', ayats: []),
      Werd(werdFromTo: '33-35', ayats: []),
    ],
  ),
  Surah(
    surahNumber: 47,
    surahName: 'محمد',
    werd: [Werd(werdFromTo: '5-8', ayats: [])],
  ),
];
