import 'package:lastfivesectionsofquran/models/surah_model.dart';
import 'package:lastfivesectionsofquran/models/werd_model.dart';

//add Strings according werdFromTo
final String kBoxName = 'wwwwfdjhwgffhhnjkerdsToStore';
final List<Surah> surahs = [
  Surah(
    surahNumber: 46,
    surahName: 'الاحقاف',
    werd: [
      Werd(
        mp3File: [
          'audio/1/046000.mp3',
          'audio/1/046001.mp3',
          'audio/1/046002.mp3',
          'audio/1/046003.mp3',
          'audio/1/046004.mp3',
        ],
        werdFromTo: '1-4',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "حم (1) تَنْزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ (2) مَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ وَأَجَلٍ مُسَمًّى وَالَّذِينَ كَفَرُوا عَمَّا أُنْذِرُوا مُعْرِضُونَ (3) قُلْ أَرَأَيْتُمْ مَا تَدْعُونَ مِنْ دُونِ اللَّهِ أَرُونِي مَاذَا خَلَقُوا مِنَ الْأَرْضِ أَمْ لَهُمْ شِرْكٌ فِي السَّمَاوَاتِ ائْتُونِي بِكِتَابٍ مِنْ قَبْلِ هَذَا أَوْ أَثَارَةٍ مِنْ عِلْمٍ إِنْ كُنْتُمْ صَادِقِينَ (4)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/1/046005.mp3',
          'audio/1/046006.mp3',
          'audio/1/046007.mp3',
          'audio/1/046008.mp3',
        ],
        werdFromTo: '5-8',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَمَنْ أَضَلُّ مِمَّن يَدْعُو مِنْ دُونِ اللَّهِ مَنْ لَا يَسْتَجِيبُ لَهُ إِلَىٰ يَوْمِ الْقِيَامَةِ وَهُمْ عَنْ دُعَائِهِمْ غَافِلُونَ (5)"
              "وَإِذَا حُشِرَ النَّاسُ كَانُوا لَهُمْ أَعْدَاءً وَكَانُوا بِعِبَادَتِهِمْ كَافِرِينَ (6)"
              "وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ قَالَ الَّذِينَ كَفَرُوا لِلْحَقِّ لَمَّا جَاءَهُمْ هَٰذَا سِحْرٌ مُبِينٌ (7)"
              "أَمْ يَقُولُونَ افْتَرَاهُ قُلْ إِنِ افْتَرَيْتُهُ فَلَا تَمْلِكُونَ لِي مِنَ اللَّهِ شَيْئًا هُوَ أَعْلَمُ بِمَا تُفِيضُونَ فِيهِ كَفَىٰ بِهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ وَهُوَ الْغَفُورُ الرَّحِيمُ (8)",
        ],
      ),
      Werd(
        mp3File: ['audio/1/046009.mp3', 'audio/1/046010.mp3'],
        werdFromTo: '9-10',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "قُلْ مَا كُنتُ بِدْعًا مِّنَ الرُّسُلِ وَمَا أَدْرِي مَا يُفْعَلُ بِي وَلَا بِكُمْ إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰ إِلَيَّ وَمَا أَنَا إِلَّا نَذِيرٌ مُّبِينٌ (9)"
              "قُلْ أَرَءَيْتُمْ إِنْ كَانَ مِنْ عِندِ اللَّهِ وَكَفَرْتُمْ بِهِ وَشَهِدَ شَاهِدٌ مِّنْ بَنِي إِسْرَٰئِيلَ عَلَىٰ مِثْلِهِ فَءَامَنَ وَاسْتَكْبَرْتُمْ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّٰلِمِينَ (10)",
        ],
      ),
      Werd(
        mp3File: ['audio/1/046011.mp3', 'audio/1/046012.mp3'],
        werdFromTo: '11-12',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَقَالَ ٱلَّذِينَ كَفَرُوا۟ لِلَّذِينَ ءَامَنُوا۟ لَوْ كَانَ خَيْرًۭا مَّا سَبَقُونَآ إِلَيْهِ وَإِذْ لَمْ يَهْتَدُوا۟ بِهِۦ فَسَيَقُولُونَ هَٰذَآ إِفْكٌۭ قَدِيمٌۭ (11)"
              "وَمِن قَبْلِهِۦ كِتَٰبُ مُوسَىٰٓ إِمَامًۭا وَرَحْمَةًۭ ۚ وَهَٰذَا كِتَٰبٌۭ مُّصَدِّقٌۭ لِّسَانًۭا عَرَبِيًّۭا لِّيُنذِرَ ٱلَّذِينَ ظَلَمُوا۟ وَبُشْرَىٰ لِلْمُحْسِنِينَ (12)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/1/046013.mp3',
          'audio/1/046014.mp3',
          'audio/1/046015.mp3',
          'audio/1/046016.mp3',
        ],
        werdFromTo: '13-16',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ ٱلَّذِينَ قَالُوا۟ رَبُّنَا ٱللَّهُ ثُمَّ ٱسْتَقَٰمُوا۟ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ (13)"
              "أُو۟لَٰئِكَ أَصْحَٰبُ ٱلْجَنَّةِ خَٰلِدِينَ فِيهَا جَزَآءًۢ بِمَا كَانُوا۟ يَعْمَلُونَ (14)"
              "وَوَصَّيْنَا ٱلْإِنسَٰنَ بِوَٰلِدَيْهِ إِحْسَٰنًا ۖ حَمَلَتْهُ أُمُّهُۥ كُرْهًۭا وَوَضَعَتْهُ كُرْهًۭا وَحَمْلُهُۥ وَفِصَٰلُهُۥ ثَلَٰثُونَ شَهْرًا ۚ حَتَّىٰٓ إِذَا بَلَغَ أَشُدَّهُۥ وَبَلَغَ أَرْبَعِينَ سَنَةًۭ قَالَ رَبِّ أَوْزِعْنِىٓ أَنْ أَشْكُرَ نِعْمَتَكَ ٱلَّتِىٓ أَنْعَمْتَ عَلَىَّ وَعَلَىٰ وَٰلِدَىَّ وَأَنْ أَعْمَلَ صَٰلِحًۭا تَرْضَىٰهُ وَأَصْلِحْ لِى فِى ذُرِّيَّتِىٓ ۖ إِنِّى تُبْتُ إِلَيْكَ وَإِنِّى مِنَ ٱلْمُسْلِمِينَ (15)"
              "أُو۟لَٰئِكَ ٱلَّذِينَ نَتَقَبَّلُ عَنْهُمْ أَحْسَنَ مَا عَمِلُوا۟ وَنَتَجَاوَزُ عَن سَيِّـَٔاتِهِمْ فِىٓ أَصْحَٰبِ ٱلْجَنَّةِ ۖ وَعْدَ ٱلصِّدْقِ ٱلَّذِى كَانُوا۟ يُوعَدُونَ (16)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/1/046017.mp3',
          'audio/1/046018.mp3',
          'audio/1/046019.mp3',
          'audio/1/046020.mp3',
        ],
        werdFromTo: '17-20',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَالَّذِي قَالَ لِوَالِدَيْهِ أُفٍّ لَكُمَا أَتَعِدَانِنِي أَنْ أُخْرَجَ وَقَدْ خَلَتِ ٱلْقُرُونُ مِنْ قَبْلِي وَهُمَا يَسْتَغِيثَانِ ٱللَّهَ وَيَقُولَانِ ۚ وَيْلَكَ ءَامِنْ إِنَّ وَعْدَ ٱللَّهِ حَقٌّ ۖ فَقَالَ مَا هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلْأَوَّلِينَ (17)"
              "أُو۟لَـٰٓئِكَ ٱلَّذِينَ حَقَّ عَلَيْهِمُ ٱلْقَوْلُ فِىٓ أُمَمٍۢ قَدْ خَلَتْ مِنْ قَبْلِهِمْ مِنَ ٱلْجِنِّ وَٱلْإِنسِ ۚ إِنَّهُمْ كَانُوا۟ خَٰسِرِينَ (18)"
              "وَلِكُلٍّۢ دَرَجَٰتٌۭ مِّمَّا عَمِلُوا۟ ۚ وَلِيُوَفِّيَهُمْ أَعْمَٰلَهُمْ ۚ وَهُمْ لَا يُظْلَمُونَ (19)"
              "وَيَوْمَ نُحْشَرُ مِنْ كُلِّ أُمَّةٍۢ فَوْجًۭا مِّمَّنْ يُكَذِّبُ بِآيَٰتِنَا فَهُمْ يُوزَعُونَ (20)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/1/046021.mp3',
          'audio/1/046022.mp3',
          'audio/1/046023.mp3',
          'audio/1/046024.mp3',
          'audio/1/046025.mp3',
        ],
        werdFromTo: '21-25',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَاذْكُرْ أَخَا عَادٍ إِذْ أَنْذَرَ قَوْمَهُ بِالْأَحْقَافِ وَقَدْ خَلَتِ النُّذُرُ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ أَلَّا تَعْبُدُوا إِلَّا اللَّهَ إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ (21)"
              "قَالُوا أَجِئْتَنَا لِتَأْفِكَنَا عَنْ آلِهَتِنَا فَأْتِنَا بِمَا تَعِدُنَا إِنْ كُنْتَ مِنَ الصَّادِقِينَ (22)"
              "قَالَ إِنَّمَا الْعِلْمُ عِنْدَ اللَّهِ وَأُبَلِّغُكُمْ مَا أُرْسِلْتُ بِهِ وَلَكِنِّي أَرَاكُمْ قَوْمًا تَجْهَلُونَ (23)"
              "فَلَمَّا رَأَوْهُ عَارِضًا مُسْتَقْبِلَ أَوْدِيَتِهِمْ قَالُوا هَذَا عَارِضٌ مُمْطِرُنَا بَلْ هُوَ مَا اسْتَعْجَلْتُمْ بِهِ رِيحٌ فِيهَا عَذَابٌ أَلِيمٌ (24)"
              "تُدَمِّرُ كُلَّ شَيْءٍ بِأَمْرِ رَبِّهَا فَأَصْبَحُوا لَا يُرَى إِلَّا مَسَاكِنُهُمْ كَذَلِكَ نَجْزِي الْقَوْمَ الْمُجْرِمِينَ (25)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/1/046026.mp3',
          'audio/1/046027.mp3',
          'audio/1/046028.mp3',
        ],
        werdFromTo: '26-28',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَلَقَدْ مَكَّنَّاهُمْ فِيمَا إِنْ مَكَّنَّاكُمْ فِيهِ وَجَعَلْنَا لَهُمْ سَمْعًا وَأَبْصَارًا وَأَفْئِدَةً فَمَا أَغْنَى عَنْهُمْ سَمْعُهُمْ وَلَا أَبْصَارُهُمْ وَلَا أَفْئِدَتُهُمْ مِنْ شَيْءٍ إِذْ كَانُوا يَجْحَدُونَ بِآيَاتِ اللَّهِ وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ (26)"
              "وَلَقَدْ أَهْلَكْنَا مَا حَوْلَكُمْ مِنَ الْقُرَى وَصَرَّفْنَا الْآيَاتِ لَعَلَّهُمْ يَرْجِعُونَ (27)"
              "فَلَوْلَا نَصَرَهُمُ الَّذِينَ اتَّخَذُوا مِنْ دُونِ اللَّهِ قُرْبَانًا آلِهَةً بَلْ ضَلُّوا عَنْهُمْ وَذَلِكَ إِفْكُهُمْ وَمَا كَانُوا يَفْتَرُونَ (28)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/1/046029.mp3',
          'audio/1/046030.mp3',
          'audio/1/046031.mp3',
          'audio/1/046032.mp3',
        ],
        werdFromTo: '29-32',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَإِذْ صَرَفْنَا إِلَيْكَ نَفَرًا مِنَ الْجِنِّ يَسْتَمِعُونَ الْقُرْآنَ فَلَمَّا حَضَرُوهُ قَالُوا أَنْصِتُوا فَلَمَّا قُضِيَ وَلَّوْا إِلَى قَوْمِهِمْ مُنْذِرِينَ (29)"
              "قَالُوا يَا قَوْمَنَا إِنَّا سَمِعْنَا كِتَابًا أُنْزِلَ مِنْ بَعْدِ مُوسَى مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ يَهْدِي إِلَى الْحَقِّ وَإِلَى طَرِيقٍ مُسْتَقِيمٍ (30)"
              "يَا قَوْمَنَا أَجِيبُوا دَاعِيَ اللَّهِ وَآمِنُوا بِهِ يَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُجِرْكُمْ مِنْ عَذَابٍ أَلِيمٍ (31)"
              "وَمَنْ لَا يُجِبْ دَاعِيَ اللَّهِ فَلَيْسَ بِمُعْجِزٍ فِي الْأَرْضِ وَلَيْسَ لَهُ مِنْ دُونِهِ أَوْلِيَاءُ أُولَئِكَ فِي ضَلَالٍ مُبِينٍ (32)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/1/046033.mp3',
          'audio/1/046034.mp3',
          'audio/1/046035.mp3',
        ],
        werdFromTo: '33-35',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَلَمْ يَعْيَ بِخَلْقِهِنَّ بِقَادِرٍ عَلَى أَنْ يُحْيِيَ الْمَوْتَى بَلَى إِنَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (33)"
              "وَيَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى النَّارِ أَلَيْسَ هَذَا بِالْحَقِّ قَالُوا بَلَى وَرَبِّنَا قَالَ فَذُوقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُونَ (34)"
              "فَاصْبِرْ كَمَا صَبَرَ أُولُو الْعَزْمِ مِنَ الرُّسُلِ وَلَا تَسْتَعْجِلْ لَهُمْ كَأَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوعَدُونَ لَمْ يَلْبَثُوا إِلَّا سَاعَةً مِنْ نَهَارٍ بَلَاغٌ فَهَلْ يُهْلَكُ إِلَّا الْقَوْمُ الْفَاسِقُونَ (35)",
        ],
      ),
    ],
  ),
  Surah(
    surahNumber: 47,
    surahName: 'محمد',
    werd: [
      Werd(
        mp3File: [
          'audio/2/047001.mp3',
          'audio/2/047002.mp3',
          'audio/2/047003.mp3',
        ],
        werdFromTo: '1-3',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ أَضَلَّ أَعْمَالَهُمْ (1)"
              "وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَآمَنُوا بِمَا نُزِّلَ عَلَى مُحَمَّدٍ وَهُوَ الْحَقُّ مِنْ رَبِّهِمْ كَفَّرَ عَنْهُمْ سَيِّئَاتِهِمْ وَأَصْلَحَ بَالَهُمْ (2)"
              "ذَلِكَ بِأَنَّ الَّذِينَ كَفَرُوا اتَّبَعُوا الْبَاطِلَ وَأَنَّ الَّذِينَ آمَنُوا اتَّبَعُوا الْحَقَّ مِنْ رَبِّهِمْ كَذَلِكَ يَضْرِبُ اللَّهُ لِلنَّاسِ أَمْثَالَهُمْ (3)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/2/047004.mp3',
          'audio/2/047005.mp3',
          'audio/2/047006.mp3',
          'audio/2/047007.mp3',
          'audio/2/047008.mp3',
          'audio/2/047009.mp3',
        ],
        werdFromTo: '4-9',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "فَإِذَا لَقِيتُمُ الَّذِينَ كَفَرُوا فَضَرْبَ الرِّقَابِ حَتَّىٰ إِذَا أَثْخَنتُمُوهُمْ فَشُدُّوا الْوَثَاقَ فَإِمَّا مَنًّا بَعْدُ وَإِمَّا فِدَاءً حَتَّىٰ تَضَعَ الْحَرْبُ أَوْزَارَهَا ذَٰلِكَ وَلَوْ يَشَاءُ اللَّهُ لَانتَصَرَ مِنْهُمْ وَلَٰكِن لِّيَبْلُوَ بَعْضَكُم بِبَعْضٍ وَالَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ فَلَن يُضِلَّ أَعْمَالَهُمْ (4)"
              "سَيَهْدِيهِمْ وَيُصْلِحُ بَالَهُمْ (5)"
              "وَيُدْخِلُهُمُ الْجَنَّةَ عَرَّفَهَا لَهُمْ (6)"
              "يَا أَيُّهَا الَّذِينَ آمَنُوا إِن تَنصُرُوا اللَّهَ يَنصُرْكُمْ وَيُثَبِّتْ أَقْدَامَكُمْ (7)"
              "وَالَّذِينَ كَفَرُوا فَتَعْسًا لَّهُمْ وَأَضَلَّ أَعْمَالَهُمْ (8)"
              "ذَٰلِكَ بِأَنَّهُمْ كَرِهُوا مَا أَنْزَلَ اللَّهُ فَأَحْبَطَ أَعْمَالَهُمْ (9)",
        ],
      ),
      Werd(
        mp3File: ['audio/2/047010.mp3', 'audio/2/047011.mp3'],
        werdFromTo: '10-11',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِنْ قَبْلِهِمْ دَمَّرَ اللَّهُ عَلَيْهِمْ وَلِلْكَافِرِينَ أَمْثَالُهَا (10)"
              "ذَٰلِكَ بِأَنَّ اللَّهَ مَوْلَى الَّذِينَ آمَنُوا وَأَنَّ الْكَافِرِينَ لَا مَوْلَىٰ لَهُمْ (11)",
        ],
      ),
      Werd(
        mp3File: ['audio/2/047012.mp3', 'audio/2/047013.mp3'],
        werdFromTo: '12-13',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ وَالَّذِينَ كَفَرُوا يَتَمَتَّعُونَ وَيَأْكُلُونَ كَمَا تَأْكُلُ الْأَنْعَامُ وَالنَّارُ مَثْوًى لَهُمْ (12)"
              "وَكَأَيِّنْ مِنْ قَرْيَةٍ هِيَ أَشَدُّ قُوَّةً مِنْ قَرْيَتِكَ الَّتِي أَخْرَجَتْكَ أَهْلَكْنَاهُمْ فَلَا نَاصِرَ لَهُمْ (13)",
        ],
      ),
      Werd(
        mp3File: ['audio/2/047014.mp3', 'audio/2/047015.mp3'],
        werdFromTo: '14-15',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَفَمَنْ كَانَ عَلَى بَيِّنَةٍ مِنْ رَبِّهِ كَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ وَاتَّبَعُوا أَهْوَاءَهُمْ (14)"
              "مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ فِيهَا أَنْهَارٌ مِنْ مَاءٍ غَيْرِ آسِنٍ وَأَنْهَارٌ مِنْ لَبَنٍ لَمْ يَتَغَيَّرْ طَعْمُهُ وَأَنْهَارٌ مِنْ خَمْرٍ لَذَّةٍ لِلشَّارِبِينَ وَأَنْهَارٌ مِنْ عَسَلٍ مُصَفًّى وَلَهُمْ فِيهَا مِنْ كُلِّ الثَّمَرَاتِ وَمَغْفِرَةٌ مِنْ رَبِّهِمْ كَمَنْ هُوَ خَالِدٌ فِي النَّارِ وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أَمْعَاءَهُمْ (15)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/2/047016.mp3',
          'audio/2/047017.mp3',
          'audio/2/047018.mp3',
          'audio/2/047019.mp3',
        ],
        werdFromTo: '16-19',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَمِنْهُمْ مَنْ يَسْتَمِعُ إِلَيْكَ حَتَّى إِذَا خَرَجُوا مِنْ عِنْدِكَ قَالُوا لِلَّذِينَ أُوتُوا الْعِلْمَ مَاذَا قَالَ آنِفًا أُولَئِكَ الَّذِينَ طَبَعَ اللَّهُ عَلَى قُلُوبِهِمْ وَاتَّبَعُوا أَهْوَاءَهُمْ (16)"
              "وَالَّذِينَ اهْتَدَوْا زَادَهُمْ هُدًى وَآتَاهُمْ تَقْوَاهُمْ (17)"
              "فَهَلْ يَنْظُرُونَ إِلَّا السَّاعَةَ أَنْ تَأْتِيَهُمْ بَغْتَةً فَقَدْ جَاءَ أَشْرَاطُهَا فَأَنَّى لَهُمْ إِذَا جَاءَتْهُمْ ذِكْرَاهُمْ (18)"
              "فَاعْلَمْ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ وَاسْتَغْفِرْ لِذَنْبِكَ وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَاللَّهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْوَاكُمْ (19)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/2/047020.mp3',
          'audio/2/047021.mp3',
          'audio/2/047022.mp3',
          'audio/2/047023.mp3',
        ],
        werdFromTo: '20-23',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَيَقُولُ الَّذِينَ آمَنُوا لَوْلَا نُزِّلَتْ سُورَةٌ فَإِذَا أُنْزِلَتْ سُورَةٌ مُحْكَمَةٌ وَذُكِرَ فِيهَا الْقِتَالُ رَأَيْتَ الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ يَنْظُرُونَ إِلَيْكَ نَظَرَ الْمَغْشِيِّ عَلَيْهِ مِنَ الْمَوْتِ فَأَوْلَى لَهُمْ (20)"
              "طَاعَةٌ وَقَوْلٌ مَعْرُوفٌ فَإِذَا عَزَمَ الْأَمْرُ فَلَوْ صَدَقُوا اللَّهَ لَكَانَ خَيْرًا لَهُمْ (21)"
              "فَهَلْ عَسَيْتُمْ إِنْ تَوَلَّيْتُمْ أَنْ تُفْسِدُوا فِي الْأَرْضِ وَتُقَطِّعُوا أَرْحَامَكُمْ (22)"
              "أُولَئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ فَأَصَمَّهُمْ وَأَعْمَى أَبْصَارَهُمْ (23)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/2/047024.mp3',
          'audio/2/047025.mp3',
          'audio/2/047026.mp3',
          'audio/2/047027.mp3',
          'audio/2/047028.mp3',
          'audio/2/047029.mp3',
          'audio/2/047030.mp3',
          'audio/2/047031.mp3',
        ],
        werdFromTo: '24-31',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ أَمْ عَلَى قُلُوبٍ أَقْفَالُهَا (24)"
              "إِنَّ الَّذِينَ ارْتَدُّوا عَلَى أَدْبَارِهِمْ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَى الشَّيْطَانُ سَوَّلَ لَهُمْ وَأَمْلَى لَهُمْ (25)"
              "ذَٰلِكَ بِأَنَّهُمْ قَالُوا لِلَّذِينَ كَرِهُوا مَا نَزَّلَ اللَّهُ سَنُطِيعُكُمْ فِي بَعْضِ الْأَمْرِ وَاللَّهُ يَعْلَمُ إِسْرَارَهُمْ (26)"
              "فَكَيْفَ إِذَا تَوَفَّتْهُمُ الْمَلَائِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ (27)"
              "ذَٰلِكَ بِأَنَّهُمُ اتَّبَعُوا مَا أَسْخَطَ اللَّهَ وَكَرِهُوا رِضْوَانَهُ فَأَحْبَطَ أَعْمَالَهُمْ (28)"
              "أَمْ حَسِبَ الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ أَنْ لَنْ يُخْرِجَ اللَّهُ أَضْغَانَهُمْ (29)"
              "وَلَوْ نَشَاءُ لَأَرَيْنَاكَهُمْ فَلَعَرَفْتَهُمْ بِسِيمَاهُمْ وَلَتَعْرِفَنَّهُمْ فِي لَحْنِ الْقَوْلِ وَاللَّهُ يَعْلَمُ أَعْمَالَكُمْ (30)"
              "وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ الْمُجَاهِدِينَ مِنْكُمْ وَالصَّابِرِينَ وَنَبْلُوَ أَخْبَارَكُمْ (31)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/2/047032.mp3',
          'audio/2/047033.mp3',
          'audio/2/047034.mp3',
          'audio/2/047035.mp3',
        ],
        werdFromTo: '32-35',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ وَشَاقُّوا الرَّسُولَ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَى لَنْ يَضُرُّوا اللَّهَ شَيْئًا وَسَيُحْبِطُ أَعْمَالَهُمْ (32)"
              "يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَلَا تُبْطِلُوا أَعْمَالَكُمْ (33)"
              "إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ ثُمَّ مَاتُوا وَهُمْ كُفَّارٌ فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ (34)"
              "فَلَا تَهِنُوا وَتَدْعُوا إِلَى السَّلْمِ وَأَنْتُمُ الْأَعْلَوْنَ وَاللَّهُ مَعَكُمْ وَلَنْ يَتِرَكُمْ أَعْمَالَكُمْ (35)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/2/047036.mp3',
          'audio/2/047037.mp3',
          'audio/2/047038.mp3',
        ],
        werdFromTo: '36-38',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ وَإِنْ تُؤْمِنُوا وَتَتَّقُوا يُؤْتِكُمْ أُجُورَكُمْ وَلَا يَسْأَلْكُمْ أَمْوَالَكُمْ (36)"
              "إِنْ يَسْأَلْكُمُوهَا فَيُحْفِكُمْ تَبْخَلُوا وَيُخْرِجْ أَضْغَانَكُمْ (37)"
              "هَا أَنْتُمْ هَؤُلَاءِ تُدْعَوْنَ لِتُنْفِقُوا فِي سَبِيلِ اللَّهِ فَمِنْكُمْ مَنْ يَبْخَلُ وَمَنْ يَبْخَلْ فَإِنَّمَا يَبْخَلُ عَنْ نَفْسِهِ وَاللَّهُ الْغَنِيُّ وَأَنْتُمُ الْفُقَرَاءُ وَإِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ ثُمَّ لَا يَكُونُوا أَمْثَالَكُمْ (38)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: 'الفتح',
    surahNumber: 48,
    werd: [
      Werd(
        mp3File: [
          'audio/3/048000.mp3',
          'audio/3/048001.mp3',
          'audio/3/048002.mp3',
          'audio/3/048003.mp3',
          'audio/3/048004.mp3',
          'audio/3/048005.mp3',
          'audio/3/048006.mp3',
          'audio/3/048007.mp3',
          'audio/3/048008.mp3',
          'audio/3/048009.mp3',
        ],
        werdFromTo: '1-9',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا (1)"
              "لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعْمَتَهُ عَلَيْكَ وَيَهْدِيَكَ صِرَاطًا مُسْتَقِيمًا (2)"
              "وَيَنْصُرَكَ اللَّهُ نَصْرًا عَزِيزًا (3)"
              "هُوَ الَّذِي أَنْزَلَ السَّكِينَةَ فِي قُلُوبِ الْمُؤْمِنِينَ لِيَزْدَادُوا إِيمَانًا مَعَ إِيمَانِهِمْ وَلِلَّهِ جُنُودُ السَّمَاوَاتِ وَالْأَرْضِ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا (4)"
              "لِيُدْخِلَ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا وَيُكَفِّرَ عَنْهُمْ سَيِّئَاتِهِمْ وَكَانَ ذَٰلِكَ عِنْدَ اللَّهِ فَوْزًا عَظِيمًا (5)"
              "وَيُعَذِّبَ الْمُنَافِقِينَ وَالْمُنَافِقَاتِ وَالْمُشْرِكِينَ وَالْمُشْرِكَاتِ الظَّانِّينَ بِاللَّهِ ظَنَّ السَّوْءِ عَلَيْهِمْ دَائِرَةُ السَّوْءِ وَغَضِبَ اللَّهُ عَلَيْهِمْ وَلَعَنَهُمْ وَأَعَدَّ لَهُمْ جَهَنَّمَ وَسَاءَتْ مَصِيرًا (6)"
              "وَلِلَّهِ جُنُودُ السَّمَاوَاتِ وَالْأَرْضِ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا (7)"
              "إِنَّا أَرْسَلْنَاكَ شَاهِدًا وَمُبَشِّرًا وَنَذِيرًا (8)"
              "لِتُؤْمِنُوا بِاللَّهِ وَرَسُولِهِ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُ وَتُسَبِّحُوهُ بُكْرَةً وَأَصِيلًا (9)",
        ],
      ),
      Werd(
        mp3File: ['audio/3/048010.mp3'],
        werdFromTo: '10',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ الَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ اللَّهَ يَدُ اللَّهِ فَوْقَ أَيْدِيهِمْ فَمَنْ نَكَثَ فَإِنَّمَا يَنْكُثُ عَلَى نَفْسِهِ وَمَنْ أَوْفَى بِمَا عَاهَدَ عَلَيْهُ اللَّهَ فَسَيُؤْتِيهِ أَجْرًا عَظِيمًا (10)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/3/048011.mp3',
          'audio/3/048012.mp3',
          'audio/3/048013.mp3',
          'audio/3/048014.mp3',
        ],
        werdFromTo: '11-14',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "سَيَقُولُ لَكَ الْمُخَلَّفُونَ مِنَ الْأَعْرَابِ شَغَلَتْنَا أَمْوَالُنَا وَأَهْلُونَا فَاسْتَغْفِرْ لَنَا يَقُولُونَ بِأَلْسِنَتِهِمْ مَا لَيْسَ فِي قُلُوبِهِمْ قُلْ فَمَنْ يَمْلِكُ لَكُمْ مِنَ اللَّهِ شَيْئًا إِنْ أَرَادَ بِكُمْ ضَرًّا أَوْ أَرَادَ بِكُمْ نَفْعًا بَلْ كَانَ اللَّهُ بِمَا تَعْمَلُونَ خَبِيرًا (11)"
              "بَلْ ظَنَنْتُمْ أَنْ لَنْ يَنْقَلِبَ الرَّسُولُ وَالْمُؤْمِنُونَ إِلَى أَهْلِيهِمْ أَبَدًا وَزُيِّنَ ذَٰلِكَ فِي قُلُوبِكُمْ وَظَنَنْتُمْ ظَنَّ السَّوْءِ وَكُنْتُمْ قَوْمًا بُورًا (12)"
              "وَمَنْ لَمْ يُؤْمِنْ بِاللَّهِ وَرَسُولِهِ فَإِنَّا أَعْتَدْنَا لِلْكَافِرِينَ سَعِيرًا (13)"
              "وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ يَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا (14)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/3/048015.mp3',
          'audio/3/048016.mp3',
          'audio/3/048017.mp3',
        ],
        werdFromTo: '15-17',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "سَيَقُولُ الْمُخَلَّفُونَ إِذَا انْطَلَقْتُمْ إِلَى مَغَانِمَ لِتَأْخُذُوهَا ذَرُونَا نَتَّبِعْكُمْ يُرِيدُونَ أَنْ يُبَدِّلُوا كَلَامَ اللَّهِ قُلْ لَنْ تَتَّبِعُونَا كَذَٰلِكُمْ قَالَ اللَّهُ مِنْ قَبْلُ فَسَيَقُولُونَ بَلْ تَحْسُدُونَنَا بَلْ كَانُوا لَا يَفْقَهُونَ إِلَّا قَلِيلًا (15)"
              "قُلْ لِلْمُخَلَّفِينَ مِنَ الْأَعْرَابِ سَتُدْعَوْنَ إِلَى قَوْمٍ أُولِي بَأْسٍ شَدِيدٍ تُقَاتِلُونَهُمْ أَوْ يُسْلِمُونَ فَإِنْ تُطِيعُوا يُؤْتِكُمُ اللَّهُ أَجْرًا حَسَنًا وَإِنْ تَتَوَلَّوْا كَمَا تَوَلَّيْتُمْ مِنْ قَبْلُ يُعَذِّبْكُمْ عَذَابًا أَلِيمًا (16)"
              "لَيْسَ عَلَى الْأَعْمَى حَرَجٌ وَلَا عَلَى الْأَعْرَجِ حَرَجٌ وَلَا عَلَى الْمَرِيضِ حَرَجٌ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ وَمَنْ يَتَوَلَّ يُعَذِّبْهُ عَذَابًا أَلِيمًا (17)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/3/048018.mp3',
          'audio/3/048019.mp3',
          'audio/3/048020.mp3',
          'audio/3/048021.mp3',
        ],
        werdFromTo: '18-23',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "لَقَدْ رَضِيَ اللَّهُ عَنِ الْمُؤْمِنِينَ إِذْ يُبَايِعُونَكَ تَحْتَ الشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمْ فَأَنْزَلَ السَّكِينَةَ عَلَيْهِمْ وَأَثَابَهُمْ فَتْحًا قَرِيبًا (18)"
              "وَمَغَانِمَ كَثِيرَةً يَأْخُذُونَهَا وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا (19)"
              "وَعَدَكُمُ اللَّهُ مَغَانِمَ كَثِيرَةً تَأْخُذُونَهَا فَعَجَّلَ لَكُمْ هَٰذِهِ وَكَفَّ أَيْدِيَ النَّاسِ عَنْكُمْ وَلِتَكُونَ آيَةً لِلْمُؤْمِنِينَ وَيَهْدِيَكُمْ صِرَاطًا مُسْتَقِيمًا (20)"
              "وَأُخْرَى لَمْ تَقْدِرُوا عَلَيْهَا قَدْ أَحَاطَ اللَّهُ بِهَا وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرًا (21)"
              "وَلَوْ قَاتَلَكُمُ الَّذِينَ كَفَرُوا لَوَلَّوُا الْأَدْبَارَ ثُمَّ لَا يَجِدُونَ وَلِيًّا وَلَا نَصِيرًا (22)"
              "سُنَّةَ اللَّهِ الَّتِي قَدْ خَلَتْ مِنْ قَبْلُ وَلَنْ تَجِدَ لِسُنَّةِ اللَّهِ تَبْدِيلًا (23)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/3/048024.mp3',
          'audio/3/048025.mp3',
          'audio/3/048026.mp3',
        ],
        werdFromTo: '24-26',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَهُوَ الَّذِي كَفَّ أَيْدِيَهُمْ عَنْكُمْ وَأَيْدِيَكُمْ عَنْهُمْ بِبَطْنِ مَكَّةَ مِنْ بَعْدِ أَنْ أَظْفَرَكُمْ عَلَيْهِمْ وَكَانَ اللَّهُ بِمَا تَعْمَلُونَ بَصِيرًا (24)"
              "هُمُ الَّذِينَ كَفَرُوا وَصَدُّوكُمْ عَنِ الْمَسْجِدِ الْحَرَامِ وَالْهَدْيَ مَعْكُوفًا أَنْ يَبْلُغَ مَحِلَّهُ وَلَوْلَا رِجَالٌ مُؤْمِنُونَ وَنِسَاءٌ مُؤْمِنَاتٌ لَمْ تَعْلَمُوهُمْ أَنْ تَطَئُوهُمْ فَتُصِيبَكُمْ مِنْهُمْ مَعَرَّةٌ بِغَيْرِ عِلْمٍ لِيُدْخِلَ اللَّهُ فِي رَحْمَتِهِ مَنْ يَشَاءُ لَوْ تَزَيَّلُوا لَعَذَّبْنَا الَّذِينَ كَفَرُوا مِنْهُمْ عَذَابًا أَلِيمًا (25)"
              "إِذْ جَعَلَ الَّذِينَ كَفَرُوا فِي قُلُوبِهِمُ الْحَمِيَّةَ حَمِيَّةَ الْجَاهِلِيَّةِ فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَى رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ وَأَلْزَمَهُمْ كَلِمَةَ التَّقْوَى وَكَانُوا أَحَقَّ بِهَا وَأَهْلَهَا وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا (26)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/3/048027.mp3',
          'audio/3/048028.mp3',
          'audio/3/048029.mp3',
        ],
        werdFromTo: '27-29',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "لَقَدْ صَدَقَ اللَّهُ رَسُولَهُ الرُّؤْيَا بِالْحَقِّ لَتَدْخُلُنَّ الْمَسْجِدَ الْحَرَامَ إِنْ شَاءَ اللَّهُ آمِنِينَ مُحَلِّقِينَ رُءُوسَكُمْ وَمُقَصِّرِينَ لَا تَخَافُونَ فَعَلِمَ مَا لَمْ تَعْلَمُوا فَجَعَلَ مِنْ دُونِ ذَٰلِكَ فَتْحًا قَرِيبًا (27)"
              "هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَى وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَكَفَى بِاللَّهِ شَهِيدًا (28)"
              "مُحَمَّدٌ رَسُولُ اللَّهِ وَالَّذِينَ مَعَهُ أَشِدَّاءُ عَلَى الْكُفَّارِ رُحَمَاءُ بَيْنَهُمْ تَرَاهُمْ رُكَّعًا سُجَّدًا يَبْتَغُونَ فَضْلًا مِنَ اللَّهِ وَرِضْوَانًا سِيمَاهُمْ فِي وُجُوهِهِمْ مِنْ أَثَرِ السُّجُودِ ذَٰلِكَ مَثَلُهُمْ فِي التَّوْرَاةِ وَمَثَلُهُمْ فِي الْإِنْجِيلِ كَزَرْعٍ أَخْرَجَ شَطْأَهُ فَآزَرَهُ فَاسْتَغْلَظَ فَاسْتَوَى عَلَى سُوقِهِ يُعْجِبُ الزُّرَّاعَ لِيَغِيظَ بِهِمُ الْكُفَّارَ وَعَدَ اللَّهُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ مِنْهُمْ مَغْفِرَةً وَأَجْرًا عَظِيمًا (29)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: 'الحجرات',
    surahNumber: 49,
    werd: [
      Werd(
        mp3File: [
          'audio/4/049000.mp3',
          'audio/4/049001.mp3',
          'audio/4/049002.mp3',
          'audio/4/049003.mp3',
          'audio/4/049004.mp3',
          'audio/4/049005.mp3',
        ],
        werdFromTo: '1-5',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُقَدِّمُوا بَيْنَ يَدَيِ اللَّهِ وَرَسُولِهِ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ (1)"
              "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَرْفَعُوا أَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَلَا تَجْهَرُوا لَهُ بِالْقَوْلِ كَجَهْرِ بَعْضِكُمْ لِبَعْضٍ أَنْ تَحْبَطَ أَعْمَالُكُمْ وَأَنْتُمْ لَا تَشْعُرُونَ (2)"
              "إِنَّ الَّذِينَ يَغُضُّونَ أَصْوَاتَهُمْ عِنْدَ رَسُولِ اللَّهِ أُولَئِكَ الَّذِينَ امْتَحَنَ اللَّهُ قُلُوبَهُمْ لِلتَّقْوَى لَهُمْ مَغْفِرَةٌ وَأَجْرٌ عَظِيمٌ (3)"
              "إِنَّ الَّذِينَ يُنَادُونَكَ مِنْ وَرَاءِ الْحُجُرَاتِ أَكْثَرُهُمْ لَا يَعْقِلُونَ (4)"
              "وَلَوْ أَنَّهُمْ صَبَرُوا حَتَّى تَخْرُجَ إِلَيْهِمْ لَكَانَ خَيْرًا لَهُمْ وَاللَّهُ غَفُورٌ رَحِيمٌ (5)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/4/049006.mp3',
          'audio/4/049007.mp3',
          'audio/4/049008.mp3',
        ],
        werdFromTo: '6-8',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الَّذِينَ آمَنُوا إِنْ جَاءَكُمْ فَاسِقٌ بِنَبَإٍ فَتَبَيَّنُوا أَنْ تُصِيبُوا قَوْمًا بِجَهَالَةٍ فَتُصْبِحُوا عَلَى مَا فَعَلْتُمْ نَادِمِينَ (6)"
              "وَاعْلَمُوا أَنَّ فِيكُمْ رَسُولَ اللَّهِ لَوْ يُطِيعُكُمْ فِي كَثِيرٍ مِنَ الْأَمْرِ لَعَنِتُّمْ وَلَكِنَّ اللَّهَ حَبَّبَ إِلَيْكُمُ الْإِيمَانَ وَزَيَّنَهُ فِي قُلُوبِكُمْ وَكَرَّهَ إِلَيْكُمُ الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ أُولَئِكَ هُمُ الرَّاشِدُونَ (7)"
              "فَضْلًا مِنَ اللَّهِ وَنِعْمَةً وَاللَّهُ عَلِيمٌ حَكِيمٌ (8)",
        ],
      ),
      Werd(
        mp3File: ['audio/4/049009.mp3', 'audio/4/049010.mp3'],
        werdFromTo: '9-10',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا فَإِنْ بَغَتْ إِحْدَاهُمَا عَلَى الْأُخْرَى فَقَاتِلُوا الَّتِي تَبْغِي حَتَّى تَفِيءَ إِلَى أَمْرِ اللَّهِ فَإِنْ فَاءَتْ فَأَصْلِحُوا بَيْنَهُمَا بِالْعَدْلِ وَأَقْسِطُوا إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ (9)"
              "إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ (10)",
        ],
      ),
      Werd(
        mp3File: ['audio/4/049011.mp3'],
        werdFromTo: '11',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا يَسْخَرْ قَوْمٌ مِنْ قَوْمٍ عَسَى أَنْ يَكُونُوا خَيْرًا مِنْهُمْ وَلَا نِسَاءٌ مِنْ نِسَاءٍ عَسَى أَنْ يَكُنَّ خَيْرًا مِنْهُنَّ وَلَا تَلْمِزُوا أَنْفُسَكُمْ وَلَا تَنَابَزُوا بِالْأَلْقَابِ بِئْسَ الِاسْمُ الْفُسُوقُ بَعْدَ الْإِيمَانِ وَمَنْ لَمْ يَتُبْ فَأُولَئِكَ هُمُ الظَّالِمُونَ (11)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/4/049012.mp3',
          'audio/4/049013.mp3',
          'audio/4/049014.mp3',
        ],
        werdFromTo: '12-13',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الَّذِينَ آمَنُوا اجْتَنِبُوا كَثِيرًا مِنَ الظَّنِّ إِنَّ بَعْضَ الظَّنِّ إِثْمٌ وَلَا تَجَسَّسُوا وَلَا يَغْتَبْ بَعْضُكُمْ بَعْضًا أَيُحِبُّ أَحَدُكُمْ أَنْ يَأْكُلَ لَحْمَ أَخِيهِ مَيْتًا فَكَرِهْتُمُوهُ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ تَوَّابٌ رَحِيمٌ (12)"
              "يَا أَيُّهَا النَّاسُ إِنَّا خَلَقْنَاكُمْ مِنْ ذَكَرٍ وَأُنْثَى وَجَعَلْنَاكُمْ شُعُوبًا وَقَبَائِلَ لِتَعَارَفُوا إِنَّ أَكْرَمَكُمْ عِنْدَ اللَّهِ أَتْقَاكُمْ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ (13)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/4/049014.mp3',
          'audio/4/049015.mp3',
          'audio/4/049016.mp3',
          'audio/4/049017.mp3',
          'audio/4/049018.mp3',
        ],
        werdFromTo: '14-18',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "قَالَتِ الْأَعْرَابُ آمَنَّا قُلْ لَمْ تُؤْمِنُوا وَلَكِنْ قُولُوا أَسْلَمْنَا وَلَمَّا يَدْخُلِ الْإِيمَانُ فِي قُلُوبِكُمْ وَإِنْ تُطِيعُوا اللَّهَ وَرَسُولَهُ لَا يَلِتْكُمْ مِنْ أَعْمَالِكُمْ شَيْئًا إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ (14)"
              "إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ آمَنُوا بِاللَّهِ وَرَسُولِهِ ثُمَّ لَمْ يَرْتَابُوا وَجَاهَدُوا بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ فِي سَبِيلِ اللَّهِ أُولَئِكَ هُمُ الصَّادِقُونَ (15)"
              "قُلْ أَتُعَلِّمُونَ اللَّهَ بِدِينِكُمْ وَاللَّهُ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ (16)"
              "يَمُنُّونَ عَلَيْكَ أَنْ أَسْلَمُوا قُلْ لَا تَمُنُّوا عَلَيَّ إِسْلَامَكُمْ بَلِ اللَّهُ يَمُنُّ عَلَيْكُمْ أَنْ هَدَاكُمْ لِلْإِيمَانِ إِنْ كُنْتُمْ صَادِقِينَ (17)"
              "إِنَّ اللَّهَ يَعْلَمُ غَيْبَ السَّمَاوَاتِ وَالْأَرْضِ وَاللَّهُ بَصِيرٌ بِمَا تَعْمَلُونَ (18)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: 'ق',
    surahNumber: 50,
    werd: [
      Werd(
        mp3File: [
          'audio/50/050000.mp3',
          'audio/50/050001.mp3',
          'audio/50/050002.mp3',
          'audio/50/050003.mp3',
          'audio/50/050004.mp3',
          'audio/50/050005.mp3',
        ],
        werdFromTo: '1-5',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "ق وَالْقُرْآنِ الْمَجِيدِ (1)"
              "بَلْ عَجِبُوا أَنْ جَاءَهُمْ مُنْذِرٌ مِنْهُمْ فَقَالَ الْكَافِرُونَ هَذَا شَيْءٌ عَجِيبٌ (2)"
              "أَإِذَا مِتْنَا وَكُنَّا تُرَابًا ذَٰلِكَ رَجْعٌ بَعِيدٌ (3)"
              "قَدْ عَلِمْنَا مَا تَنْقُصُ الْأَرْضُ مِنْهُمْ وَعِنْدَنَا كِتَابٌ حَفِيظٌ (4)"
              "بَلْ كَذَّبُوا بِالْحَقِّ لَمَّا جَاءَهُمْ فَهُمْ فِي أَمْرٍ مَرِيجٍ (5)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/50/050006.mp3',
          'audio/50/050007.mp3',
          'audio/50/050008.mp3',
          'audio/50/050009.mp3',
          'audio/50/050010.mp3',
          'audio/50/050012.mp3',
          'audio/50/050010.mp3',
          'audio/50/050013.mp3',
          'audio/50/050014.mp3',
          'audio/50/050015.mp3',
        ],
        werdFromTo: '6-15',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَفَلَمْ يَنْظُرُوا إِلَى السَّمَاءِ فَوْقَهُمْ كَيْفَ بَنَيْنَاهَا وَزَيَّنَّاهَا وَمَا لَهَا مِنْ فُرُوجٍ (6)"
              "وَالْأَرْضَ مَدَدْنَاهَا وَأَلْقَيْنَا فِيهَا رَوَاسِيَ وَأَنْبَتْنَا فِيهَا مِنْ كُلِّ زَوْجٍ بَهِيجٍ (7)"
              "تَبْصِرَةً وَذِكْرَىٰ لِكُلِّ عَبْدٍ مُنِيبٍ (8)"
              "وَنَزَّلْنَا مِنَ السَّمَاءِ مَاءً مُبَارَكًا فَأَنْبَتْنَا بِهِ جَنَّاتٍ وَحَبَّ الْحَصِيدِ (9)"
              "وَالنَّخْلَ بَاسِقَاتٍ لَهَا طَلْعٌ نَضِيدٌ (10)"
              "رِزْقًا لِلْعِبَادِ وَأَحْيَيْنَا بِهِ بَلْدَةً مَيْتًا كَذَٰلِكَ الْخُرُوجُ (11)"
              "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَأَصْحَابُ الرَّسِّ وَثَمُودُ (12)"
              "وَعَادٌ وَفِرْعَوْنُ وَإِخْوَانُ لُوطٍ (13)"
              "وَأَصْحَابُ الْأَيْكَةِ وَقَوْمُ تُبَّعٍ كُلٌّ كَذَّبَ الرُّسُلَ فَحَقَّ وَعِيدِ (14)"
              "أَفَعَيِينَا بِالْخَلْقِ الْأَوَّلِ بَلْ هُمْ فِي لَبْسٍ مِنْ خَلْقٍ جَدِيدٍ (15)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/50/050016.mp3',
          'audio/50/050017.mp3',
          'audio/50/050018.mp3',
          'audio/50/050019.mp3',
          'audio/50/050020.mp3',
          'audio/50/050021.mp3',
          'audio/50/050022.mp3',
          'audio/50/050023.mp3',
          'audio/50/050024.mp3',
          'audio/50/050025.mp3',
          'audio/50/050026.mp3',
          'audio/50/050027.mp3',
          'audio/50/050028.mp3',
          'audio/50/050029.mp3',
        ],
        werdFromTo: '16-29',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَلَقَدْ خَلَقْنَا الْإِنْسَانَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِ نَفْسُهُ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ (16)"
              "إِذْ يَتَلَقَّى الْمُتَلَقِّيَانِ عَنِ الْيَمِينِ وَعَنِ الشِّمَالِ قَعِيدٌ (17)"
              "مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ (18)"
              "وَجَاءَتْ سَكْرَةُ الْمَوْتِ بِالْحَقِّ ذَٰلِكَ مَا كُنْتَ مِنْهُ تَحِيدُ (19)"
              "وَنُفِخَ فِي الصُّورِ ذَٰلِكَ يَوْمُ الْوَعِيدِ (20)"
              "وَجَاءَتْ كُلُّ نَفْسٍ مَعَهَا سَائِقٌ وَشَهِيدٌ (21)"
              "لَقَدْ كُنْتَ فِي غَفْلَةٍ مِنْ هَٰذَا فَكَشَفْنَا عَنْكَ غِطَاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ (22)"
              "وَقَالَ قَرِينُهُ هَٰذَا مَا لَدَيَّ عَتِيدٌ (23)"
              "أَلْقِيَا فِي جَهَنَّمَ كُلَّ كَفَّارٍ عَنِيدٍ (24)"
              "مَنَّاعٍ لِلْخَيْرِ مُعْتَدٍ مُرِيبٍ (25)"
              "الَّذِي جَعَلَ مَعَ اللَّهِ إِلَٰهًا آخَرَ فَأَلْقِيَاهُ فِي الْعَذَابِ الشَّدِيدِ (26)"
              "قَالَ قَرِينُهُ رَبَّنَا مَا أَطْغَيْتُهُ وَلَٰكِنْ كَانَ فِي ضَلَالٍ بَعِيدٍ (27)"
              "قَالَ لَا تَخْتَصِمُوا لَدَيَّ وَقَدْ قَدَّمْتُ إِلَيْكُمْ بِالْوَعِيدِ (28)"
              "مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ وَمَا أَنَا بِظَلَّامٍ لِلْعَبِيدِ (29)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/50/050030.mp3',
          'audio/50/050031.mp3',
          'audio/50/050033.mp3',
          'audio/50/050034.mp3',
          'audio/50/050035.mp3',
          'audio/50/050036.mp3',
          'audio/50/050037.mp3',
        ],
        werdFromTo: '30-37',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَوْمَ نَقُولُ لِجَهَنَّمَ هَلِ امْتَلَأْتِ وَتَقُولُ هَلْ مِنْ مَزِيدٍ (30)"
              "وَأُزْلِفَتِ الْجَنَّةُ لِلْمُتَّقِينَ غَيْرَ بَعِيدٍ (31)"
              "هَٰذَا مَا تُوعَدُونَ لِكُلِّ أَوَّابٍ حَفِيظٍ (32)"
              "مَنْ خَشِيَ الرَّحْمَٰنَ بِالْغَيْبِ وَجَاءَ بِقَلْبٍ مُنِيبٍ (33)"
              "ادْخُلُوهَا بِسَلَامٍ ذَٰلِكَ يَوْمُ الْخُلُودِ (34)"
              "لَهُمْ مَا يَشَاءُونَ فِيهَا وَلَدَيْنَا مَزِيدٌ (35)"
              "وَكَمْ أَهْلَكْنَا قَبْلَهُمْ مِنْ قَرْنٍ هُمْ أَشَدُّ مِنْهُمْ بَطْشًا فَنَقَّبُوا فِي الْبِلَادِ هَلْ مِنْ مَحِيصٍ (36)"
              "إِنَّ فِي ذَٰلِكَ لَذِكْرَىٰ لِمَنْ كَانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وَهُوَ شَهِيدٌ (37)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/50/050038.mp3',
          'audio/50/050039.mp3',
          'audio/50/050040.mp3',
          'audio/50/050041.mp3',
          'audio/50/050042.mp3',
          'audio/50/050043.mp3',
          'audio/50/050044.mp3',
          'audio/50/050045.mp3',
        ],
        werdFromTo: '38-45',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَلَقَدْ خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِي سِتَّةِ أَيَّامٍ وَمَا مَسَّنَا مِنْ لُغُوبٍ (38)"
              "فَاصْبِرْ عَلَى مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ الْغُرُوبِ (39)"
              "وَمِنَ اللَّيْلِ فَسَبِّحْهُ وَأَدْبَارَ السُّجُودِ (40)"
              "وَاسْتَمِعْ يَوْمَ يُنَادِ الْمُنَادِ مِنْ مَكَانٍ قَرِيبٍ (41)"
              "يَوْمَ يَسْمَعُونَ الصَّيْحَةَ بِالْحَقِّ ذَٰلِكَ يَوْمُ الْخُرُوجِ (42)"
              "إِنَّا نَحْنُ نُحْيِي وَنُمِيتُ وَإِلَيْنَا الْمَصِيرُ (43)"
              "يَوْمَ تَشَقَّقُ الْأَرْضُ عَنْهُمْ سِرَاعًا ذَٰلِكَ حَشْرٌ عَلَيْنَا يَسِيرٌ (44)"
              "نَحْنُ أَعْلَمُ بِمَا يَقُولُونَ وَمَا أَنْتَ عَلَيْهِمْ بِجَبَّارٍ فَذَكِّرْ بِالْقُرْآنِ مَنْ يَخَافُ وَعِيدِ (45)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: 'الذاريات',
    surahNumber: 51,
    werd: [
      Werd(
        mp3File: [
          'audio/51/051000.mp3',
          'audio/51/051001.mp3',
          'audio/51/051002.mp3',
          'audio/51/051003.mp3',
          'audio/51/051004.mp3',
          'audio/51/051005.mp3',
          'audio/51/051006.mp3',
          'audio/51/051007.mp3',
          'audio/51/051008.mp3',
          'audio/51/051009.mp3',
          'audio/51/051010.mp3',
          'audio/51/051011.mp3',
          'audio/51/051012.mp3',
          'audio/51/051013.mp3',
          'audio/51/051014.mp3',
        ],
        werdFromTo: '1-14',
        ayats: [
          "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
          "وَالذَّارِيَاتِ ذَرْوًا (1)"
              "فَالْحَامِلَاتِ وِقْرًا (2)"
              "فَالْجَارِيَاتِ يُسْرًا (3)"
              "فَالْمُقَسِّمَاتِ أَمْرًا (4)"
              "إِنَّمَا تُوعَدُونَ لَصَادِقٌ (5)"
              "وَإِنَّ الدِّينَ لَوَاقِعٌ (6)"
              "وَالسَّمَاءِ ذَاتِ الْحُبُكِ (7)"
              "إِنَّكُمْ لَفِي قَوْلٍ مُخْتَلِفٍ (8)"
              "يُؤْفَكُ عَنْهُ مَنْ أُفِكَ (9)"
              "قُتِلَ الْخَرَّاصُونَ (10)"
              "الَّذِينَ هُمْ فِي غَمْرَةٍ سَاهُونَ (11)"
              "يَسْأَلُونَ أَيَّانَ يَوْمُ الدِّينِ (12)"
              "يَوْمَ هُمْ عَلَى النَّارِ يُفْتَنُونَ (13)"
              "ذُوقُوا فِتْنَتَكُمْ هَذَا الَّذِي كُنْتُمْ بِهِ تَسْتَعْجِلُونَ (14)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/51/051015.mp3',
          'audio/51/051016.mp3',
          'audio/51/051017.mp3',
          'audio/51/051018.mp3',
          'audio/51/051019.mp3',
          'audio/51/051020.mp3',
          'audio/51/051021.mp3',
          'audio/51/051022.mp3',
          'audio/51/051023.mp3',
        ],
        werdFromTo: '15-23',
        ayats: [
          "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
          "إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَعُيُونٍ (15)"
              "آخِذِينَ مَا آتَاهُمْ رَبُّهُمْ إِنَّهُمْ كَانُوا قَبْلَ ذَٰلِكَ مُحْسِنِينَ (16)"
              "كَانُوا قَلِيلًا مِنَ اللَّيْلِ مَا يَهْجَعُونَ (17)"
              "وَبِالْأَسْحَارِ هُمْ يَسْتَغْفِرُونَ (18)"
              "وَفِي أَمْوَالِهِمْ حَقٌّ لِلسَّائِلِ وَالْمَحْرُومِ (19)"
              "وَفِي الْأَرْضِ آيَاتٌ لِلْمُوقِنِينَ (20)"
              "وَفِي أَنْفُسِكُمْ أَفَلَا تُبْصِرُونَ (21)"
              "وَفِي السَّمَاءِ رِزْقُكُمْ وَمَا تُوعَدُونَ (22)"
              "فَوَرَبِّ السَّمَاءِ وَالْأَرْضِ إِنَّهُ لَحَقٌّ مِثْلَ مَا أَنَّكُمْ تَنْطِقُونَ (23)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/51/051024.mp3',
          'audio/51/051025.mp3',
          'audio/51/051026.mp3',
          'audio/51/051027.mp3',
          'audio/51/051028.mp3',
          'audio/51/051029.mp3',
          'audio/51/051030.mp3',
        ],
        werdFromTo: '24-30',
        ayats: [
          "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
          "هَلْ أَتَاكَ حَدِيثُ ضَيْفِ إِبْرَاهِيمَ الْمُكْرَمِينَ (24)"
              "إِذْ دَخَلُوا عَلَيْهِ فَقَالُوا سَلَامًا قَالَ سَلَامٌ قَوْمٌ مُنْكَرُونَ (25)"
              "فَرَاغَ إِلَى أَهْلِهِ فَجَاءَ بِعِجْلٍ سَمِينٍ (26)"
              "فَقَرَّبَهُ إِلَيْهِمْ قَالَ أَلَا تَأْكُلُونَ (27)"
              "فَأَوْجَسَ مِنْهُمْ خِيفَةً قَالُوا لَا تَخَفْ وَبَشَّرُوهُ بِغُلَامٍ عَلِيمٍ (28)"
              "فَأَقْبَلَتِ امْرَأَتُهُ فِي صَرَّةٍ فَصَكَّتْ وَجْهَهَا وَقَالَتْ عَجُوزٌ عَقِيمٌ (29)"
              "قَالُوا كَذَٰلِكِ قَالَ رَبُّكِ إِنَّهُ هُوَ الْحَكِيمُ الْعَلِيمُ (30)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/51/051031.mp3',
          'audio/51/051032.mp3',
          'audio/51/051033.mp3',
          'audio/51/051034.mp3',
          'audio/51/051035.mp3',
          'audio/51/051036.mp3',
          'audio/51/051037.mp3',
        ],
        werdFromTo: '31-37',
        ayats: [
          "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
          "قَالَ فَمَا خَطْبُكُمْ أَيُّهَا الْمُرْسَلُونَ (31)"
              "قَالُوا إِنَّا أُرْسِلْنَا إِلَى قَوْمٍ مُجْرِمِينَ (32)"
              "لِنُرْسِلَ عَلَيْهِمْ حِجَارَةً مِنْ طِينٍ (33)"
              "مُسَوَّمَةً عِنْدَ رَبِّكَ لِلْمُسْرِفِينَ (34)"
              "فَأَخْرَجْنَا مَنْ كَانَ فِيهَا مِنَ الْمُؤْمِنِينَ (35)"
              "فَمَا وَجَدْنَا فِيهَا غَيْرَ بَيْتٍ مِنَ الْمُسْلِمِينَ (36)"
              "وَتَرَكْنَا فِيهَا آيَةً لِلَّذِينَ يَخَافُونَ الْعَذَابَ الْأَلِيمَ (37)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/51/051038.mp3',
          'audio/51/051039.mp3',
          'audio/51/051040.mp3',
          'audio/51/051041.mp3',
          'audio/51/051042.mp3',
          'audio/51/051043.mp3',
          'audio/51/051044.mp3',
          'audio/51/051045.mp3',
          'audio/51/051046.mp3',
        ],
        werdFromTo: '38-46',
        ayats: [
          "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
          "وَفِي مُوسَى إِذْ أَرْسَلْنَاهُ إِلَى فِرْعَوْنَ بِسُلْطَانٍ مُبِينٍ (38)"
              "فَتَوَلَّى بِرُكْنِهِ وَقَالَ سَاحِرٌ أَوْ مَجْنُونٌ (39)"
              "فَأَخَذْنَاهُ وَجُنُودَهُ فَنَبَذْنَاهُمْ فِي الْيَمِّ وَهُوَ مُلِيمٌ (40)"
              "وَفِي عَادٍ إِذْ أَرْسَلْنَا عَلَيْهِمُ الرِّيحَ الْعَقِيمَ (41)"
              "مَا تَذَرُ مِنْ شَيْءٍ أَتَتْ عَلَيْهِ إِلَّا جَعَلَتْهُ كَالرَّمِيمِ (42)"
              "وَفِي ثَمُودَ إِذْ قِيلَ لَهُمْ تَمَتَّعُوا حَتَّى حِينٍ (43)"
              "فَعَتَوْا عَنْ أَمْرِ رَبِّهِمْ فَأَخَذَتْهُمُ الصَّاعِقَةُ وَهُمْ يَنْظُرُونَ (44)"
              "فَمَا اسْتَطَاعُوا مِنْ قِيَامٍ وَمَا كَانُوا مُنْتَصِرِينَ (45)"
              "وَقَوْمَ نُوحٍ مِنْ قَبْلُ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ (46)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/51/051047.mp3',
          'audio/51/051048.mp3',
          'audio/51/051049.mp3',
          'audio/51/051050.mp3',
          'audio/51/051051.mp3',
          'audio/51/051052.mp3',
          'audio/51/051053.mp3',
          'audio/51/051054.mp3',
          'audio/51/051055.mp3',
          'audio/51/051056.mp3',
          'audio/51/051057.mp3',
          'audio/51/051058.mp3',
          'audio/51/051059.mp3',
          'audio/51/051060.mp3',
        ],
        werdFromTo: '47-60',
        ayats: [
          "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
          "وَالسَّمَاءَ بَنَيْنَاهَا بِأَيْدٍ وَإِنَّا لَمُوسِعُونَ (47)"
              "وَالْأَرْضَ فَرَشْنَاهَا فَنِعْمَ الْمَاهِدُونَ (48)"
              "وَمِنْ كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ لَعَلَّكُمْ تَذَكَّرُونَ (49)"
              "فَفِرُّوا إِلَى اللَّهِ إِنِّي لَكُمْ مِنْهُ نَذِيرٌ مُبِينٌ (50)"
              "وَلَا تَجْعَلُوا مَعَ اللَّهِ إِلَٰهًا آخَرَ إِنِّي لَكُمْ مِنْهُ نَذِيرٌ مُبِينٌ (51)"
              "كَذَٰلِكَ مَا أَتَى الَّذِينَ مِنْ قَبْلِهِمْ مِنْ رَسُولٍ إِلَّا قَالُوا سَاحِرٌ أَوْ مَجْنُونٌ (52)"
              "أَتَوَاصَوْا بِهِ بَلْ هُمْ قَوْمٌ طَاغُونَ (53)"
              "فَتَوَلَّ عَنْهُمْ فَمَا أَنْتَ بِمَلُومٍ (54)"
              "وَذَكِّرْ فَإِنَّ الذِّكْرَى تَنْفَعُ الْمُؤْمِنِينَ (55)"
              "وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ (56)"
              "مَا أُرِيدُ مِنْهُمْ مِنْ رِزْقٍ وَمَا أُرِيدُ أَنْ يُطْعِمُونِ (57)"
              "إِنَّ اللَّهَ هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ (58)"
              "فَإِنَّ لِلَّذِينَ ظَلَمُوا ذَنُوبًا مِثْلَ ذَنُوبِ أَصْحَابِهِمْ فَلَا يَسْتَعْجِلُونِ (59)"
              "فَوَيْلٌ لِلَّذِينَ كَفَرُوا مِنْ يَوْمِهِمُ الَّذِي يُوعَدُونَ (60)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: 'الطور',
    surahNumber: 52,
    werd: [
      Werd(
        mp3File: [
          'audio/52/052000.mp3',
          'audio/52/052001.mp3',
          'audio/52/052002.mp3',
          'audio/52/052003.mp3',
          'audio/52/052004.mp3',
          'audio/52/052005.mp3',
          'audio/52/052006.mp3',
          'audio/52/052007.mp3',
          'audio/52/052008.mp3',
          'audio/52/052009.mp3',
          'audio/52/052010.mp3',
          'audio/52/052011.mp3',
          'audio/52/052012.mp3',
          'audio/52/052013.mp3',
          'audio/52/052014.mp3',
          'audio/52/052015.mp3',
          'audio/52/052016.mp3',
        ],
        werdFromTo: '1-16',
        ayats: [
          "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
          "وَالطُّورِ (1)"
              "وَكِتَابٍ مَسْطُورٍ (2)"
              "فِي رَقٍّ مَنْشُورٍ (3)"
              "وَالْبَيْتِ الْمَعْمُورِ (4)"
              "وَالسَّقْفِ الْمَرْفُوعِ (5)"
              "وَالْبَحْرِ الْمَسْجُورِ (6)"
              "إِنَّ عَذَابَ رَبِّكَ لَوَاقِعٌ (7)"
              "مَا لَهُ مِنْ دَافِعٍ (8)"
              "يَوْمَ تَمُورُ السَّمَاءُ مَوْرًا (9)"
              "وَتَسِيرُ الْجِبَالُ سَيْرًا (10)"
              "فَوَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ (11)"
              "الَّذِينَ هُمْ فِي خَوْضٍ يَلْعَبُونَ (12)"
              "يَوْمَ يُدَعُّونَ إِلَى نَارِ جَهَنَّمَ دَعًّا (13)"
              "هَذِهِ النَّارُ الَّتِي كُنْتُمْ بِهَا تُكَذِّبُونَ (14)"
              "أَفَسِحْرٌ هَذَا أَمْ أَنْتُمْ لَا تُبْصِرُونَ (15)"
              "اصْلَوْهَا فَاصْبِرُوا أَوْ لَا تَصْبِرُوا سَوَاءٌ عَلَيْكُمْ إِنَّمَا تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُونَ (16)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/52/052017.mp3',
          'audio/52/052018.mp3',
          'audio/52/052019.mp3',
          'audio/52/052020.mp3',
        ],
        werdFromTo: '17-20',
        ayats: [
          "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
          "إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَنَعِيمٍ (17)"
              "فَاكِهِينَ بِمَا آتَاهُمْ رَبُّهُمْ وَوَقَاهُمْ رَبُّهُمْ عَذَابَ الْجَحِيمِ (18)"
              "كُلُوا وَاشْرَبُوا هَنِيئًا بِمَا كُنْتُمْ تَعْمَلُونَ (19)"
              "مُتَّكِئِينَ عَلَى سُرُرٍ مَصْفُوفَةٍ وَزَوَّجْنَاهُمْ بِحُورٍ عِينٍ (20)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/52/052021.mp3',
          'audio/52/052022.mp3',
          'audio/52/052023.mp3',
          'audio/52/052024.mp3',
          'audio/52/052025.mp3',
          'audio/52/052026.mp3',
          'audio/52/052027.mp3',
          'audio/52/052028.mp3',
        ],
        werdFromTo: '21-28',
        ayats: [
          "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
          "وَالَّذِينَ آمَنُوا وَاتَّبَعَتْهُمْ ذُرِّيَّتُهُمْ بِإِيمَانٍ أَلْحَقْنَا بِهِمْ ذُرِّيَّتَهُمْ وَمَا أَلَتْنَاهُمْ مِنْ عَمَلِهِمْ مِنْ شَيْءٍ كُلُّ امْرِئٍ بِمَا كَسَبَ رَهِينٌ (21)"
              "وَأَمْدَدْنَاهُمْ بِفَاكِهَةٍ وَلَحْمٍ مِمَّا يَشْتَهُونَ (22)"
              "يَتَنَازَعُونَ فِيهَا كَأْسًا لَا لَغْوٌ فِيهَا وَلَا تَأْثِيمٌ (23)"
              "وَيَطُوفُ عَلَيْهِمْ غِلْمَانٌ لَهُمْ كَأَنَّهُمْ لُؤْلُؤٌ مَكْنُونٌ (24)"
              "وَأَقْبَلَ بَعْضُهُمْ عَلَى بَعْضٍ يَتَسَاءَلُونَ (25)"
              "قَالُوا إِنَّا كُنَّا قَبْلُ فِي أَهْلِنَا مُشْفِقِينَ (26)"
              "فَمَنَّ اللَّهُ عَلَيْنَا وَوَقَانَا عَذَابَ السَّمُومِ (27)"
              "إِنَّا كُنَّا مِنْ قَبْلُ نَدْعُوهُ إِنَّهُ هُوَ الْبَرُّ الرَّحِيمُ (28)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/52/052029.mp3',
          'audio/52/052030.mp3',
          'audio/52/052031.mp3',
          'audio/52/052032.mp3',
          'audio/52/052033.mp3',
          'audio/52/052034.mp3',
          'audio/52/052035.mp3',
          'audio/52/052036.mp3',
          'audio/52/052037.mp3',
          'audio/52/052038.mp3',
          'audio/52/052039.mp3',
          'audio/52/052040.mp3',
          'audio/52/052041.mp3',
          'audio/52/052042.mp3',
          'audio/52/052043.mp3',
        ],
        werdFromTo: '29-43',
        ayats: [
          "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
          "فَذَكِّرْ فَمَا أَنْتَ بِنِعْمَتِ رَبِّكَ بِكَاهِنٍ وَلَا مَجْنُونٍ (29)"
              "أَمْ يَقُولُونَ شَاعِرٌ نَتَرَبَّصُ بِهِ رَيْبَ الْمَنُونِ (30)"
              "قُلْ تَرَبَّصُوا فَإِنِّي مَعَكُمْ مِنَ الْمُتَرَبِّصِينَ (31)"
              "أَمْ تَأْمُرُهُمْ أَحْلَامُهُمْ بِهَٰذَا أَمْ هُمْ قَوْمٌ طَاغُونَ (32)"
              "أَمْ يَقُولُونَ تَقَوَّلَهُ بَلْ لَا يُؤْمِنُونَ (33)"
              "فَلْيَأْتُوا بِحَدِيثٍ مِثْلِهِ إِنْ كَانُوا صَادِقِينَ (34)"
              "أَمْ خُلِقُوا مِنْ غَيْرِ شَيْءٍ أَمْ هُمُ الْخَالِقُونَ (35)"
              "أَمْ خَلَقُوا السَّمَاوَاتِ وَالْأَرْضَ بَلْ لَا يُوقِنُونَ (36)"
              "أَمْ عِنْدَهُمْ خَزَائِنُ رَبِّكَ أَمْ هُمُ الْمُصَيْطِرُونَ (37)"
              "أَمْ لَهُمْ سُلَّمٌ يَسْتَمِعُونَ فِيهِ فَلْيَأْتِ مُسْتَمِعُهُمْ بِسُلْطَانٍ مُبِينٍ (38)"
              "أَمْ لَهُ الْبَنَاتُ وَلَكُمُ الْبَنُونَ (39)"
              "أَمْ تَسْأَلُهُمْ أَجْرًا فَهُمْ مِنْ مَغْرَمٍ مُثْقَلُونَ (40)"
              "أَمْ عِنْدَهُمُ الْغَيْبُ فَهُمْ يَكْتُبُونَ (41)"
              "أَمْ يُرِيدُونَ كَيْدًا فَالَّذِينَ كَفَرُوا هُمُ الْمَكِيدُونَ (42)"
              "أَمْ لَهُمْ إِلَٰهٌ غَيْرُ اللَّهِ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ (43)",
        ],
      ),
      Werd(
        mp3File: [
          'assets/mp3/44.mp3',
          'assets/mp3/45.mp3',
          'assets/mp3/46.mp3',
          'assets/mp3/47.mp3',
          'assets/mp3/48.mp3',
          'assets/mp3/49.mp3',
        ],
        werdFromTo: '44-49',
        ayats: [
          "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
          "وَإِنْ يَرَوْا كِسْفًا مِنَ السَّمَاءِ سَاقِطًا يَقُولُوا سَحَابٌ مَرْكُومٌ (44)"
              "فَذَرْهُمْ حَتَّى يُلَاقُوا يَوْمَهُمُ الَّذِي فِيهِ يُصْعَقُونَ (45)"
              "يَوْمَ لَا يُغْنِي عَنْهُمْ كَيْدُهُمْ شَيْئًا وَلَا هُمْ يُنْصَرُونَ (46)"
              "وَإِنَّ لِلَّذِينَ ظَلَمُوا عَذَابًا دُونَ ذَٰلِكَ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ (47)"
              "وَاصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنَا وَسَبِّحْ بِحَمْدِ رَبِّكَ حِينَ تَقُومُ (48)"
              "وَمِنَ اللَّيْلِ فَسَبِّحْهُ وَإِدْبَارَ النُّجُومِ (49)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "النجم",
    surahNumber: 53,
    werd: [
      Werd(
        mp3File: [
          'audio/53/053000.mp3',
          'audio/53/053001.mp3',
          'audio/53/053002.mp3',
          'audio/53/053003.mp3',
          'audio/53/053004.mp3',
          'audio/53/053005.mp3',
          'audio/53/053006.mp3',
          'audio/53/053007.mp3',
          'audio/53/053008.mp3',
          'audio/53/053009.mp3',
          'audio/53/053010.mp3',
          'audio/53/053011.mp3',
          'audio/53/053012.mp3',
          'audio/53/053013.mp3',
          'audio/53/053014.mp3',
          'audio/53/053015.mp3',
          'audio/53/053016.mp3',
          'audio/53/053017.mp3',
        ],
        werdFromTo: '1-17',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَالنَّجْمِ إِذَا هَوَى (1)"
              "مَا ضَلَّ صَاحِبُكُمْ وَمَا غَوَى (2)"
              "وَمَا يَنْطِقُ عَنِ الْهَوَى (3)"
              "إِنْ هُوَ إِلَّا وَحْيٌ يُوحَى (4)"
              "عَلَّمَهُ شَدِيدُ الْقُوَى (5)"
              "ذُو مِرَّةٍ فَاسْتَوَى (6)"
              "وَهُوَ بِالْأُفُقِ الْأَعْلَى (7)"
              "ثُمَّ دَنَا فَتَدَلَّى (8)"
              "فَكَانَ قَابَ قَوْسَيْنِ أَوْ أَدْنَى (9)"
              "فَأَوْحَى إِلَى عَبْدِهِ مَا أَوْحَى (10)"
              "مَا كَذَبَ الْفُؤَادُ مَا رَأَى (11)"
              "أَفَتُمَارُونَهُ عَلَى مَا يَرَى (12)"
              "وَلَقَدْ رَآهُ نَزْلَةً أُخْرَى (13)"
              "عِنْدَ سِدْرَةِ الْمُنْتَهَى (14)"
              "عِنْدَهَا جَنَّةُ الْمَأْوَى (15)"
              "إِذْ يَغْشَى السِّدْرَةَ مَا يَغْشَى (16)"
              "مَا زَاغَ الْبَصَرُ وَمَا طَغَى (17)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/53/053018.mp3',
          'audio/53/053019.mp3',
          'audio/53/053020.mp3',
          'audio/53/053021.mp3',
          'audio/53/053022.mp3',
          'audio/53/053023.mp3',
          'audio/53/053024.mp3',
          'audio/53/053025.mp3',
          'audio/53/053026.mp3',
        ],
        werdFromTo: '18-26',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "لَقَدْ رَأَى مِنْ آيَاتِ رَبِّهِ الْكُبْرَى (18)"
              "أَفَرَأَيْتُمُ اللَّاتَ وَالْعُزَّى (19)"
              "وَمَنَاةَ الثَّالِثَةَ الْأُخْرَى (20)"
              "أَلَكُمُ الذَّكَرُ وَلَهُ الْأُنْثَى (21)"
              "تِلْكَ إِذًا قِسْمَةٌ ضِيزَى (22)"
              "إِنْ هِيَ إِلَّا أَسْمَاءٌ سَمَّيْتُمُوهَا أَنْتُمْ وَآبَاؤُكُمْ مَا أَنْزَلَ اللَّهُ بِهَا مِنْ سُلْطَانٍ إِنْ يَتَّبِعُونَ إِلَّا الظَّنَّ وَمَا تَهْوَى الْأَنْفُسُ وَلَقَدْ جَاءَهُمْ مِنْ رَبِّهِمُ الْهُدَى (23)"
              "أَمْ لِلْإِنْسَانِ مَا تَمَنَّى (24)"
              "فَلِلَّهِ الْآخِرَةُ وَالْأُولَى (25)"
              "وَكَمْ مِنْ مَلَكٍ فِي السَّمَاوَاتِ لَا تُغْنِي شَفَاعَتُهُمْ شَيْئًا إِلَّا مِنْ بَعْدِ أَنْ يَأْذَنَ اللَّهُ لِمَنْ يَشَاءُ وَيَرْضَى (26)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/53/053027.mp3',
          'audio/53/053028.mp3',
          'audio/53/053029.mp3',
          'audio/53/053030.mp3',
        ],
        werdFromTo: '27-30',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ لَيُسَمُّونَ الْمَلَائِكَةَ تَسْمِيَةَ الْأُنْثَى (27)"
              "وَمَا لَهُمْ بِهِ مِنْ عِلْمٍ إِنْ يَتَّبِعُونَ إِلَّا الظَّنَّ وَإِنَّ الظَّنَّ لَا يُغْنِي مِنَ الْحَقِّ شَيْئًا (28)"
              "فَأَعْرِضْ عَنْ مَنْ تَوَلَّى عَنْ ذِكْرِنَا وَلَمْ يُرِدْ إِلَّا الْحَيَاةَ الدُّنْيَا (29)"
              "ذَٰلِكَ مَبْلَغُهُمْ مِنَ الْعِلْمِ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ وَهُوَ أَعْلَمُ بِمَنِ اهْتَدَى (30)",
        ],
      ),
      Werd(
        mp3File: ['audio/53/053031.mp3', 'audio/53/053032.mp3'],
        werdFromTo: '31-32',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ لِيَجْزِيَ الَّذِينَ أَسَاءُوا بِمَا عَمِلُوا وَيَجْزِيَ الَّذِينَ أَحْسَنُوا بِالْحُسْنَى (31)"
              "الَّذِينَ يَجْتَنِبُونَ كَبَائِرَ الْإِثْمِ وَالْفَوَاحِشَ إِلَّا اللَّمَمَ إِنَّ رَبَّكَ وَاسِعُ الْمَغْفِرَةِ هُوَ أَعْلَمُ بِكُمْ إِذْ أَنْشَأَكُمْ مِنَ الْأَرْضِ وَإِذْ أَنْتُمْ أَجِنَّةٌ فِي بُطُونِ أُمَّهَاتِكُمْ فَلَا تُزَكُّوا أَنْفْسَكُمْ هُوَ أَعْلَمُ بِمَنِ اتَّقَى (32)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/53/053033.mp3',
          'audio/53/053034.mp3',
          'audio/53/053035.mp3',
          'audio/53/053036.mp3',
          'audio/53/053037.mp3',
          'audio/53/053038.mp3',
          'audio/53/053039.mp3',
          'audio/53/053040.mp3',
          'audio/53/053041.mp3',
        ],
        werdFromTo: '33-41',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَفَرَأَيْتَ الَّذِي تَوَلَّى (33)"
              "وَأَعْطَى قَلِيلًا وَأَكْدَى (34)"
              "أَعِنْدَهُ عِلْمُ الْغَيْبِ فَهُوَ يَرَى (35)"
              "أَمْ لَمْ يُنَبَّأْ بِمَا فِي صُحُفِ مُوسَى (36)"
              "وَإِبْرَاهِيمَ الَّذِي وَفَّى (37)"
              "أَلَّا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى (38)"
              "وَأَنْ لَيْسَ لِلْإِنْسَانِ إِلَّا مَا سَعَى (39)"
              "وَأَنَّ سَعْيَهُ سَوْفَ يُرَى (40)"
              "ثُمَّ يُجْزَاهُ الْجَزَاءَ الْأَوْفَى (41)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/53/053042.mp3',
          'audio/53/053043.mp3',
          'audio/53/053044.mp3',
          'audio/53/053045.mp3',
          'audio/53/053046.mp3',
          'audio/53/053047.mp3',
          'audio/53/053048.mp3',
          'audio/53/053049.mp3',
          'audio/53/053050.mp3',
          'audio/53/053051.mp3',
          'audio/53/053052.mp3',
          'audio/53/053053.mp3',
          'audio/53/053054.mp3',
          'audio/53/053055.mp3',
          'audio/53/053056.mp3',
          'audio/53/053057.mp3',
          'audio/53/053058.mp3',
          'audio/53/053059.mp3',
          'audio/53/053060.mp3',
          'audio/53/053061.mp3',
          'audio/53/053062.mp3',
        ],
        werdFromTo: '42-62',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَأَنَّ إِلَى رَبِّكَ الْمُنْتَهَى (42)"
              "وَأَنَّهُ هُوَ أَضْحَكَ وَأَبْكَى (43)"
              "وَأَنَّهُ هُوَ أَمَاتَ وَأَحْيَا (44)"
              "وَأَنَّهُ خَلَقَ الزَّوْجَيْنِ الذَّكَرَ وَالْأُنْثَى (45)"
              "مِنْ نُطْفَةٍ إِذَا تُمْنَى (46)"
              "وَأَنَّ عَلَيْهِ النَّشْأَةَ الْأُخْرَى (47)"
              "وَأَنَّهُ هُوَ أَغْنَى وَأَقْنَى (48)"
              "وَأَنَّهُ هُوَ رَبُّ الشِّعْرَى (49)"
              "وَأَنَّهُ أَهْلَكَ عَادًا الْأُولَى (50)"
              "وَثَمُودَ فَمَا أَبْقَى (51)"
              "وَقَوْمَ نُوحٍ مِنْ قَبْلُ إِنَّهُمْ كَانُوا هُمْ أَظْلَمَ وَأَطْغَى (52)"
              "وَالْمُؤْتَفِكَةَ أَهْوَى (53)"
              "فَغَشَّاهَا مَا غَشَّى (54)"
              "فَبِأَيِّ آلَاءِ رَبِّكَ تَتَمَارَى (55)"
              "هَذَا نَذِيرٌ مِنَ النُّذُرِ الْأُولَى (56)"
              "أَزِفَتِ الْآزِفَةُ (57)"
              "لَيْسَ لَهَا مِنْ دُونِ اللَّهِ كَاشِفَةٌ (58)"
              "أَفَمِنْ هَذَا الْحَدِيثِ تَعْجَبُونَ (59)"
              "وَتَضْحَكُونَ وَلَا تَبْكُونَ (60)"
              "وَأَنْتُمْ سَامِدُونَ (61)"
              "فَاسْجُدُوا لِلَّهِ وَاعْبُدُوا (62)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: 'القمر',
    surahNumber: 54,
    werd: [
      Werd(
        mp3File: [
          'audio/54/054000.mp3',
          'audio/54/054001.mp3',
          'audio/54/054002.mp3',
          'audio/54/054003.mp3',
          'audio/54/054004.mp3',
          'audio/54/054005.mp3',
          'audio/54/054006.mp3',
          'audio/54/054007.mp3',
          'audio/54/054008.mp3',
        ],
        werdFromTo: '1-8',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "اقْتَرَبَتِ السَّاعَةُ وَانْشَقَّ الْقَمَرُ (1)"
              "وَإِنْ يَرَوْا آيَةً يُعْرِضُوا وَيَقُولُوا سِحْرٌ مُسْتَمِرٌّ (2)"
              "وَكَذَّبُوا وَاتَّبَعُوا أَهْوَاءَهُمْ وَكُلُّ أَمْرٍ مُسْتَقِرٌّ (3)"
              "وَلَقَدْ جَاءَهُمْ مِنَ الْأَنْبَاءِ مَا فِيهِ مُزْدَجَرٌ (4)"
              "حِكْمَةٌ بَالِغَةٌ فَمَا تُغْنِ النُّذُرُ (5)"
              "فَتَوَلَّ عَنْهُمْ يَوْمَ يَدْعُ الدَّاعِ إِلَى شَيْءٍ نُكُرٍ (6)"
              "خُشَّعًا أَبْصَارُهُمْ يَخْرُجُونَ مِنَ الْأَجْدَاثِ كَأَنَّهُمْ جَرَادٌ مُنْتَشِرٌ (7)"
              "مُهْطِعِينَ إِلَى الدَّاعِ يَقُولُ الْكَافِرُونَ هَذَا يَوْمٌ عَسِرٌ (8)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/54/054009.mp3',
          'audio/54/054010.mp3',
          'audio/54/054011.mp3',
          'audio/54/054012.mp3',
          'audio/54/054013.mp3',
          'audio/54/054014.mp3',
          'audio/54/054015.mp3',
          'audio/54/054016.mp3',
          'audio/54/054017.mp3',
        ],
        werdFromTo: '9-17',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ فَكَذَّبُوا عَبْدَنَا وَقَالُوا مَجْنُونٌ وَازْدُجِرَ (9)"
              "فَدَعَا رَبَّهُ أَنِّي مَغْلُوبٌ فَانْتَصِرْ (10)"
              "فَفَتَحْنَا أَبْوَابَ السَّمَاءِ بِمَاءٍ مُنْهَمِرٍ (11)"
              "وَفَجَّرْنَا الْأَرْضَ عُيُونًا فَالْتَقَى الْمَاءُ عَلَى أَمْرٍ قَدْ قُدِرَ (12)"
              "وَحَمَلْنَاهُ عَلَى ذَاتِ أَلْوَاحٍ وَدُسُرٍ (13)"
              "تَجْرِي بِأَعْيُنِنَا جَزَاءً لِمَنْ كَانَ كُفِرَ (14)"
              "وَلَقَدْ تَرَكْنَاهَا آيَةً فَهَلْ مِنْ مُدَّكِرٍ (15)"
              "فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ (16)"
              "وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ (17)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/54/054018.mp3',
          'audio/54/054019.mp3',
          'audio/54/054020.mp3',
          'audio/54/054021.mp3',
          'audio/54/054022.mp3',
        ],
        werdFromTo: '18-22',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "كَذَّبَتْ عَادٌ فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ (18)"
              "إِنَّا أَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا فِي يَوْمِ نَحْسٍ مُسْتَمِرٍّ (19)"
              "تَنْزِعُ النَّاسَ كَأَنَّهُمْ أَعْجَازُ نَخْلٍ مُنْقَعِرٍ (20)"
              "فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ (21)"
              "وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ (22)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/54/054023.mp3',
          'audio/54/054024.mp3',
          'audio/54/054025.mp3',
          'audio/54/054026.mp3',
          'audio/54/054027.mp3',
          'audio/54/054028.mp3',
          'audio/54/054029.mp3',
          'audio/54/054030.mp3',
          'audio/54/054031.mp3',
          'audio/54/054032.mp3',
        ],
        werdFromTo: '23-32',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "كَذَّبَتْ ثَمُودُ بِالنُّذُرِ (23)"
              "فَقَالُوا أَبَشَرًا مِنَّا وَاحِدًا نَتَّبِعُهُ إِنَّا إِذًا لَفِي ضَلَالٍ وَسُعُرٍ (24)"
              "أَأُلْقِيَ الذِّكْرُ عَلَيْهِ مِنْ بَيْنِنَا بَلْ هُوَ كَذَّابٌ أَشِرٌ (25)"
              "سَيَعْلَمُونَ غَدًا مَنِ الْكَذَّابُ الْأَشِرُ (26)"
              "إِنَّا مُرْسِلُو النَّاقَةِ فِتْنَةً لَهُمْ فَارْتَقِبْهُمْ وَاصْطَبِرْ (27)"
              "وَنَبِّئْهُمْ أَنَّ الْمَاءَ قِسْمَةٌ بَيْنَهُمْ كُلُّ شِرْبٍ مُحْتَضَرٌ (28)"
              "فَنَادَوْا صَاحِبَهُمْ فَتَعَاطَى فَعَقَرَ (29)"
              "فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ (30)"
              "إِنَّا أَرْسَلْنَا عَلَيْهِمْ صَيْحَةً وَاحِدَةً فَكَانُوا كَهَشِيمِ الْمُحْتَظِرِ (31)"
              "وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ (32)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/54/054033.mp3',
          'audio/54/054034.mp3',
          'audio/54/054035.mp3',
          'audio/54/054036.mp3',
          'audio/54/054037.mp3',
          'audio/54/054038.mp3',
          'audio/54/054039.mp3',
          'audio/54/054040.mp3',
        ],
        werdFromTo: '33-40',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "كَذَّبَتْ قَوْمُ لُوطٍ بِالنُّذُرِ (33)"
              "إِنَّا أَرْسَلْنَا عَلَيْهِمْ حَاصِبًا إِلَّا آلَ لُوطٍ نَجَّيْنَاهُمْ بِسَحَرٍ (34)"
              "نِعْمَةً مِنْ عِنْدِنَا كَذَٰلِكَ نَجْزِي مَنْ شَكَرَ (35)"
              "وَلَقَدْ أَنْذَرَهُمْ بَطْشَتَنَا فَتَمَارَوْا بِالنُّذُرِ (36)"
              "وَلَقَدْ رَاوَدُوهُ عَنْ ضَيْفِهِ فَطَمَسْنَا أَعْيُنَهُمْ فَذُوقُوا عَذَابِي وَنُذُرِ (37)"
              "وَلَقَدْ صَبَّحَهُمْ بُكْرَةً عَذَابٌ مُسْتَقِرٌّ (38)"
              "فَذُوقُوا عَذَابِي وَنُذُرِ (39)"
              "وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ (40)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/54/054041.mp3',
          'audio/54/054042.mp3',
          'audio/54/054043.mp3',
          'audio/54/054044.mp3',
          'audio/54/054045.mp3',
          'audio/54/054046.mp3',
          'audio/54/054047.mp3',
          'audio/54/054048.mp3',
          'audio/54/054049.mp3',
          'audio/54/054050.mp3',
          'audio/54/054051.mp3',
          'audio/54/054052.mp3',
          'audio/54/054053.mp3',
          'audio/54/054054.mp3',
          'audio/54/054055.mp3',
        ],
        werdFromTo: '41-55',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَلَقَدْ جَاءَ آلَ فِرْعَوْنَ النُّذُرُ (41)"
              "كَذَّبُوا بِآيَاتِنَا كُلِّهَا فَأَخَذْنَاهُمْ أَخْذَ عَزِيزٍ مُقْتَدِرٍ (42)"
              "أَكُفَّارُكُمْ خَيْرٌ مِنْ أُولَٰئِكُمْ أَمْ لَكُمْ بَرَاءَةٌ فِي الزُّبُرِ (43)"
              "أَمْ يَقُولُونَ نَحْنُ جَمِيعٌ مُنْتَصِرٌ (44)"
              "سَيُهْزَمُ الْجَمْعُ وَيُوَلُّونَ الدُّبُرَ (45)"
              "بَلِ السَّاعَةُ مَوْعِدُهُمْ وَالسَّاعَةُ أَدْهَىٰ وَأَمَرُّ (46)"
              "إِنَّ الْمُجْرِمِينَ فِي ضَلَالٍ وَسُعُرٍ (47)"
              "يَوْمَ يُسْحَبُونَ فِي النَّارِ عَلَى وُجُوهِهِمْ ذُوقُوا مَسَّ سَقَرَ (48)"
              "إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ (49)"
              "وَمَا أَمْرُنَا إِلَّا وَاحِدَةٌ كَلَمْحٍ بِالْبَصَرِ (50)"
              "وَلَقَدْ أَهْلَكْنَا أَشْيَاعَكُمْ فَهَلْ مِنْ مُدَّكِرٍ (51)"
              "وَكُلُّ شَيْءٍ فَعَلُوهُ فِي الزُّبُرِ (52)"
              "وَكُلُّ صَغِيرٍ وَكَبِيرٍ مُسْتَطَرٌ (53)"
              "إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَنَهَرٍ (54)"
              "فِي مَقْعَدِ صِدْقٍ عِنْدَ مَلِيكٍ مُقْتَدِرٍ (55)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: 'الرحمن',
    surahNumber: 55,
    werd: [
      Werd(
        mp3File: [
          'audio/55/055000.mp3',
          'audio/55/055001.mp3',
          'audio/55/055002.mp3',
          'audio/55/055003.mp3',
          'audio/55/055004.mp3',
          'audio/55/055005.mp3',
          'audio/55/055006.mp3',
          'audio/55/055007.mp3',
          'audio/55/055008.mp3',
          'audio/55/055009.mp3',
          'audio/55/055010.mp3',
          'audio/55/055011.mp3',
          'audio/55/055012.mp3',
          'audio/55/055013.mp3',
          'audio/55/055014.mp3',
          'audio/55/055015.mp3',
          'audio/55/055016.mp3',
          'audio/55/055017.mp3',
          'audio/55/055018.mp3',
        ],
        werdFromTo: '1-18',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "الرَّحْمَٰنُ (1)"
              "عَلَّمَ الْقُرْآنَ (2)"
              "خَلَقَ الْإِنْسَانَ (3)"
              "عَلَّمَهُ الْبَيَانَ (4)"
              "الشَّمْسُ وَالْقَمَرُ بِحُسْبَانٍ (5)"
              "وَالنَّجْمُ وَالشَّجَرُ يَسْجُدَانِ (6)"
              "وَالسَّمَاءَ رَفَعَهَا وَوَضَعَ الْمِيزَانَ (7)"
              "أَلَّا تَطْغَوْا فِي الْمِيزَانِ (8)"
              "وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ وَلَا تُخْسِرُوا الْمِيزَانَ (9)"
              "وَالْأَرْضَ وَضَعَهَا لِلْأَنَامِ (10)"
              "فِيهَا فَاكِهَةٌ وَالنَّخْلُ ذَاتُ الْأَكْمَامِ (11)"
              "وَالْحَبُّ ذُو الْعَصْفِ وَالرَّيْحَانُ (12)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (13)"
              "خَلَقَ الْإِنْسَانَ مِنْ صَلْصَالٍ كَالْفَخَّارِ (14)"
              "وَخَلَقَ الْجَانَّ مِنْ مَارِجٍ مِنْ نَارٍ (15)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (16)"
              "رَبُّ الْمَشْرِقَيْنِ وَرَبُّ الْمَغْرِبَيْنِ (17)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (18)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/55/055019.mp3',
          'audio/55/055020.mp3',
          'audio/55/055021.mp3',
          'audio/55/055022.mp3',
          'audio/55/055023.mp3',
          'audio/55/055024.mp3',
          'audio/55/055025.mp3',
          'audio/55/055026.mp3',
          'audio/55/055027.mp3',
          'audio/55/055028.mp3',
        ],
        werdFromTo: '19-28',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "مَرَجَ الْبَحْرَيْنِ يَلْتَقِيَانِ (19)"
              "بَيْنَهُمَا بَرْزَخٌ لَا يَبْغِيَانِ (20)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (21)"
              "يَخْرُجُ مِنْهُمَا اللُّؤْلُؤُ وَالْمَرْجَانُ (22)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (23)"
              "وَلَهُ الْجَوَارِ الْمُنْشَآتُ فِي الْبَحْرِ كَالْأَعْلَامِ (24)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (25)"
              "كُلُّ مَنْ عَلَيْهَا فَانٍ (26)"
              "وَيَبْقَى وَجْهُ رَبِّكَ ذُو الْجَلَالِ وَالْإِكْرَامِ (27)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (28)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/55/055029.mp3',
          'audio/55/055030.mp3',
          'audio/55/055031.mp3',
          'audio/55/055032.mp3',
          'audio/55/055033.mp3',
          'audio/55/055034.mp3',
          'audio/55/055035.mp3',
          'audio/55/055036.mp3',
        ],
        werdFromTo: '29-36',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَسْأَلُهُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ (29)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (30)"
              "سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ (31)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (32)"
              "يَا مَعْشَرَ الْجِنِّ وَالْإِنْسِ إِنِ اسْتَطَعْتُمْ أَنْ تَنْفُذُوا مِنْ أَقْطَارِ السَّمَاوَاتِ وَالْأَرْضِ فَانْفُذُوا لَا تَنْفُذُونَ إِلَّا بِسُلْطَانٍ (33)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (34)"
              "يُرْسَلُ عَلَيْكُمَا شُوَاظٌ مِنْ نَارٍ وَنُحَاسٌ فَلَا تَنْتَصِرَانِ (35)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (36)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/55/055037.mp3',
          'audio/55/055038.mp3',
          'audio/55/055039.mp3',
          'audio/55/055040.mp3',
          'audio/55/055041.mp3',
          'audio/55/055042.mp3',
          'audio/55/055043.mp3',
          'audio/55/055044.mp3',
          'audio/55/055045.mp3',
        ],
        werdFromTo: '37-45',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "فَإِذَا انْشَقَّتِ السَّمَاءُ فَكَانَتْ وَرْدَةً كَالدِّهَانِ (37)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (38)"
              "فَيَوْمَئِذٍ لَا يُسْأَلُ عَنْ ذَنْبِهِ إِنْسٌ وَلَا جَانٌّ (39)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (40)"
              "يُعْرَفُ الْمُجْرِمُونَ بِسِيمَاهُمْ فَيُؤْخَذُ بِالنَّوَاصِي وَالْأَقْدَامِ (41)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (42)"
              "هَٰذِهِ جَهَنَّمُ الَّتِي يُكَذِّبُ بِهَا الْمُجْرِمُونَ (43)"
              "يَطُوفُونَ بَيْنَهَا وَبَيْنَ حَمِيمٍ آنٍ (44)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (45)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/55/055046.mp3',
          'audio/55/055047.mp3',
          'audio/55/055048.mp3',
          'audio/55/055049.mp3',
          'audio/55/055050.mp3',
          'audio/55/055051.mp3',
          'audio/55/055052.mp3',
          'audio/55/055053.mp3',
          'audio/55/055054.mp3',
          'audio/55/055055.mp3',
          'audio/55/055056.mp3',
          'audio/55/055057.mp3',
          'audio/55/055058.mp3',
          'audio/55/055059.mp3',
          'audio/55/055060.mp3',
          'audio/55/055061.mp3',
        ],
        werdFromTo: '46-61',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَلِمَنْ خَافَ مَقَامَ رَبِّهِ جَنَّتَانِ (46)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (47)"
              "ذَوَاتَا أَفْنَانٍ (48)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (49)"
              "فِيهِمَا عَيْنَانِ تَجْرِيَانِ (50)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (51)"
              "فِيهِمَا مِنْ كُلِّ فَاكِهَةٍ زَوْجَانِ (52)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (53)"
              "مُتَّكِئِينَ عَلَى فُرُشٍ بَطَائِنُهَا مِنْ إِسْتَبْرَقٍ وَجَنَى الْجَنَّتَيْنِ دَانٍ (54)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (55)"
              "فِيهِنَّ قَاصِرَاتُ الطَّرْفِ لَمْ يَطْمِثْهُنَّ إِنْسٌ قَبْلَهُمْ وَلَا جَانٌّ (56)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (57)"
              "كَأَنَّهُنَّ الْيَاقُوتُ وَالْمَرْجَانُ (58)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (59)"
              "هَلْ جَزَاءُ الْإِحْسَانِ إِلَّا الْإِحْسَانُ (60)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (61)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/55/055062.mp3',
          'audio/55/055063.mp3',
          'audio/55/055064.mp3',
          'audio/55/055065.mp3',
          'audio/55/055066.mp3',
          'audio/55/055067.mp3',
          'audio/55/055068.mp3',
          'audio/55/055069.mp3',
          'audio/55/055070.mp3',
          'audio/55/055071.mp3',
          'audio/55/055072.mp3',
          'audio/55/055073.mp3',
          'audio/55/055074.mp3',
          'audio/55/055075.mp3',
          'audio/55/055076.mp3',
          'audio/55/055077.mp3',
          'audio/55/055078.mp3',
        ],
        werdFromTo: '62-78',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَمِنْ دُونِهِمَا جَنَّتَانِ (62)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (63)"
              "مُدْهَامَّتَانِ (64)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (65)"
              "فِيهِمَا عَيْنَانِ نَضَّاخَتَانِ (66)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (67)"
              "فِيهِمَا فَاكِهَةٌ وَنَخْلٌ وَرُمَّانٌ (68)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (69)"
              "فِيهِنَّ خَيْرَاتٌ حِسَانٌ (70)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (71)"
              "حُورٌ مَقْصُورَاتٌ فِي الْخِيَامِ (72)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (73)"
              "لَمْ يَطْمِثْهُنَّ إِنْسٌ قَبْلَهُمْ وَلَا جَانٌّ (74)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (75)"
              "مُتَّكِئِينَ عَلَى رَفْرَفٍ خُضْرٍ وَعَبْقَرِيٍّ حِسَانٍ (76)"
              "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (77)"
              "تَبَارَكَ اسْمُ رَبِّكَ ذِي الْجَلَالِ وَالْإِكْرَامِ (78)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: 'الواقعة',
    surahNumber: 56,
    werd: [
      Werd(
        mp3File: [
          'audio/56/056000.mp3',
          'audio/56/056001.mp3',
          'audio/56/056002.mp3',
          'audio/56/056003.mp3',
          'audio/56/056004.mp3',
          'audio/56/056005.mp3',
          'audio/56/056006.mp3',
          'audio/56/056007.mp3',
          'audio/56/056008.mp3',
          'audio/56/056009.mp3',
          'audio/56/056010.mp3',
          'audio/56/056011.mp3',
          'audio/56/056012.mp3',
        ],
        werdFromTo: '1-12',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِذَا وَقَعَتِ الْوَاقِعَةُ (1)"
              "لَيْسَ لِوَقْعَتِهَا كَاذِبَةٌ (2)"
              "خَافِضَةٌ رَافِعَةٌ (3)"
              "إِذَا رُجَّتِ الْأَرْضُ رَجًّا (4)"
              "وَبُسَّتِ الْجِبَالُ بَسًّا (5)"
              "فَكَانَتْ هَبَاءً مُنْبَثًّا (6)"
              "وَكُنْتُمْ أَزْوَاجًا ثَلَاثَةً (7)"
              "فَأَصْحَابُ الْمَيْمَنَةِ مَا أَصْحَابُ الْمَيْمَنَةِ (8)"
              "وَأَصْحَابُ الْمَشْأَمَةِ مَا أَصْحَابُ الْمَشْأَمَةِ (9)"
              "وَالسَّابِقُونَ السَّابِقُونَ (10)"
              "أُولَئِكَ الْمُقَرَّبُونَ (11)"
              "فِي جَنَّاتِ النَّعِيمِ (12)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/56/056013.mp3',
          'audio/56/056014.mp3',
          'audio/56/056015.mp3',
          'audio/56/056016.mp3',
          'audio/56/056017.mp3',
          'audio/56/056018.mp3',
          'audio/56/056019.mp3',
          'audio/56/056020.mp3',
          'audio/56/056021.mp3',
          'audio/56/056022.mp3',
          'audio/56/056023.mp3',
          'audio/56/056024.mp3',
          'audio/56/056025.mp3',
          'audio/56/056026.mp3',
        ],
        werdFromTo: '13-26',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "ثُلَّةٌ مِنَ الْأَوَّلِينَ (13)"
              "وَقَلِيلٌ مِنَ الْآخِرِينَ (14)"
              "عَلَى سُرُرٍ مَوْضُونَةٍ (15)"
              "مُتَّكِئِينَ عَلَيْهَا مُتَقَابِلِينَ (16)"
              "يَطُوفُ عَلَيْهِمْ وِلْدَانٌ مُخَلَّدُونَ (17)"
              "بِأَكْوَابٍ وَأَبَارِيقَ وَكَأْسٍ مِنْ مَعِينٍ (18)"
              "لَا يُصَدَّعُونَ عَنْهَا وَلَا يُنْزِفُونَ (19)"
              "وَفَاكِهَةٍ مِمَّا يَتَخَيَّرُونَ (20)"
              "وَلَحْمِ طَيْرٍ مِمَّا يَشْتَهُونَ (21)"
              "وَحُورٌ عِينٌ (22)"
              "كَأَمْثَالِ اللُّؤْلُؤِ الْمَكْنُونِ (23)"
              "جَزَاءً بِمَا كَانُوا يَعْمَلُونَ (24)"
              "لَا يَسْمَعُونَ فِيهَا لَغْوًا وَلَا تَأْثِيمًا (25)"
              "إِلَّا قِيلًا سَلَامًا سَلَامًا (26)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/56/056027.mp3',
          'audio/56/056028.mp3',
          'audio/56/056029.mp3',
          'audio/56/056030.mp3',
          'audio/56/056031.mp3',
          'audio/56/056032.mp3',
          'audio/56/056033.mp3',
          'audio/56/056034.mp3',
          'audio/56/056035.mp3',
          'audio/56/056036.mp3',
          'audio/56/056037.mp3',
          'audio/56/056038.mp3',
          'audio/56/056039.mp3',
          'audio/56/056040.mp3',
        ],
        werdFromTo: '27-40',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَأَصْحَابُ الْيَمِينِ مَا أَصْحَابُ الْيَمِينِ (27)"
              "فِي سِدْرٍ مَخْضُودٍ (28)"
              "وَطَلْحٍ مَنْضُودٍ (29)"
              "وَظِلٍّ مَمْدُودٍ (30)"
              "وَمَاءٍ مَسْكُوبٍ (31)"
              "وَفَاكِهَةٍ كَثِيرَةٍ (32)"
              "لَا مَقْطُوعَةٍ وَلَا مَمْنُوعَةٍ (33)"
              "وَفُرُشٍ مَرْفُوعَةٍ (34)"
              "إِنَّا أَنْشَأْنَاهُنَّ إِنْشَاءً (35)"
              "فَجَعَلْنَاهُنَّ أَبْكَارًا (36)"
              "عُرُبًا أَتْرَابًا (37)"
              "لِأَصْحَابِ الْيَمِينِ (38)"
              "ثُلَّةٌ مِنَ الْأَوَّلِينَ (39)"
              "وَثُلَّةٌ مِنَ الْآخِرِينَ (40)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/56/056041.mp3',
          'audio/56/056042.mp3',
          'audio/56/056043.mp3',
          'audio/56/056044.mp3',
          'audio/56/056045.mp3',
          'audio/56/056046.mp3',
          'audio/56/056047.mp3',
          'audio/56/056048.mp3',
          'audio/56/056049.mp3',
          'audio/56/056050.mp3',
          'audio/56/056051.mp3',
          'audio/56/056052.mp3',
          'audio/56/056053.mp3',
          'audio/56/056054.mp3',
          'audio/56/056055.mp3',
          'audio/56/056056.mp3',
        ],
        werdFromTo: '41-56',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَأَصْحَابُ الشِّمَالِ مَا أَصْحَابُ الشِّمَالِ (41)"
              "فِي سَمُومٍ وَحَمِيمٍ (42)"
              "وَظِلٍّ مِنْ يَحْمُومٍ (43)"
              "لَا بَارِدٍ وَلَا كَرِيمٍ (44)"
              "إِنَّهُمْ كَانُوا قَبْلَ ذَٰلِكَ مُتْرَفِينَ (45)"
              "وَكَانُوا يُصِرُّونَ عَلَى الْحِنْثِ الْعَظِيمِ (46)"
              "وَكَانُوا يَقُولُونَ أَئِذَا مِتْنَا وَكُنَّا تُرَابًا وَعِظَامًا أَئِنَّا لَمَبْعُوثُونَ (47)"
              "أَوَآبَاؤُنَا الْأَوَّلُونَ (48)"
              "قُلْ إِنَّ الْأَوَّلِينَ وَالْآخِرِينَ (49)"
              "لَمَجْمُوعُونَ إِلَى مِيقَاتِ يَوْمٍ مَعْلُومٍ (50)"
              "ثُمَّ إِنَّكُمْ أَيُّهَا الضَّالُّونَ الْمُكَذِّبُونَ (51)"
              "لَآكِلُونَ مِنْ شَجَرٍ مِنْ زَقُّومٍ (52)"
              "فَمَالِئُونَ مِنْهَا الْبُطُونَ (53)"
              "فَشَارِبُونَ عَلَيْهِ مِنَ الْحَمِيمِ (54)"
              "فَشَارِبُونَ شُرْبَ الْهِيمِ (55)"
              "هَٰذَا نُزُلُهُمْ يَوْمَ الدِّينِ (56)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/56/056057.mp3',
          'audio/56/056058.mp3',
          'audio/56/056059.mp3',
          'audio/56/056060.mp3',
          'audio/56/056061.mp3',
          'audio/56/056062.mp3',
          'audio/56/056063.mp3',
          'audio/56/056064.mp3',
          'audio/56/056065.mp3',
          'audio/56/056066.mp3',
          'audio/56/056067.mp3',
          'audio/56/056068.mp3',
          'audio/56/056069.mp3',
          'audio/56/056070.mp3',
          'audio/56/056071.mp3',
          'audio/56/056072.mp3',
          'audio/56/056073.mp3',
          'audio/56/056074.mp3',
        ],
        werdFromTo: '57-74',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "نَحْنُ خَلَقْنَاكُمْ فَلَوْلَا تُصَدِّقُونَ (57)"
              "أَفَرَأَيْتُمْ مَا تُمْنُونَ (58)"
              "أَأَنْتُمْ تَخْلُقُونَهُ أَمْ نَحْنُ الْخَالِقُونَ (59)"
              "نَحْنُ قَدَّرْنَا بَيْنَكُمُ الْمَوْتَ وَمَا نَحْنُ بِمَسْبُوقِينَ (60)"
              "عَلَى أَنْ نُبَدِّلَ أَمْثَالَكُمْ وَنُنْشِئَكُمْ فِي مَا لَا تَعْلَمُونَ (61)"
              "وَلَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولَى فَلَوْلَا تَذَكَّرُونَ (62)"
              "أَفَرَأَيْتُمْ مَا تَحْرُثُونَ (63)"
              "أَأَنْتُمْ تَزْرَعُونَهُ أَمْ نَحْنُ الزَّارِعُونَ (64)"
              "لَوْ نَشَاءُ لَجَعَلْنَاهُ حُطَامًا فَظَلَلْتُمْ تَفَكَّهُونَ (65)"
              "إِنَّا لَمُغْرَمُونَ (66)"
              "بَلْ نَحْنُ مَحْرُومُونَ (67)"
              "أَفَرَأَيْتُمُ الْمَاءَ الَّذِي تَشْرَبُونَ (68)"
              "أَأَنْتُمْ أَنْزَلْتُمُوهُ مِنَ الْمُزْنِ أَمْ نَحْنُ الْمُنْزِلُونَ (69)"
              "لَوْ نَشَاءُ جَعَلْنَاهُ أُجَاجًا فَلَوْلَا تَشْكُرُونَ (70)"
              "أَفَرَأَيْتُمُ النَّارَ الَّتِي تُورُونَ (71)"
              "أَأَنْتُمْ أَنْشَأْتُمْ شَجَرَتَهَا أَمْ نَحْنُ الْمُنْشِئُونَ (72)"
              "نَحْنُ جَعَلْنَاهَا تَذْكِرَةً وَمَتَاعًا لِلْمُقْوِينَ (73)"
              "فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ (74)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/56/056075.mp3',
          'audio/56/056076.mp3',
          'audio/56/056077.mp3',
          'audio/56/056078.mp3',
          'audio/56/056079.mp3',
          'audio/56/056080.mp3',
          'audio/56/056081.mp3',
          'audio/56/056082.mp3',
        ],
        werdFromTo: '75-82',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "فَلَا أُقْسِمُ بِمَوَاقِعِ النُّجُومِ (75)"
              "وَإِنَّهُ لَقَسَمٌ لَوْ تَعْلَمُونَ عَظِيمٌ (76)"
              "إِنَّهُ لَقُرْآنٌ كَرِيمٌ (77)"
              "فِي كِتَابٍ مَكْنُونٍ (78)"
              "لَا يَمَسُّهُ إِلَّا الْمُطَهَّرُونَ (79)"
              "تَنْزِيلٌ مِنْ رَبِّ الْعَالَمِينَ (80)"
              "أَفَبِهَٰذَا الْحَدِيثِ أَنْتُمْ مُدْهِنُونَ (81)"
              "وَتَجْعَلُونَ رِزْقَكُمْ أَنَّكُمْ تُكَذِّبُونَ (82)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/56/056083.mp3',
          'audio/56/056084.mp3',
          'audio/56/056085.mp3',
          'audio/56/056086.mp3',
          'audio/56/056087.mp3',
          'audio/56/056088.mp3',
          'audio/56/056089.mp3',
          'audio/56/056090.mp3',
          'audio/56/056091.mp3',
          'audio/56/056092.mp3',
          'audio/56/056093.mp3',
          'audio/56/056094.mp3',
          'audio/56/056095.mp3',
          'audio/56/056096.mp3',
        ],
        werdFromTo: '83-96',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "فَلَوْلَا إِذَا بَلَغَتِ الْحُلْقُومَ (83)"
              "وَأَنْتُمْ حِينَئِذٍ تَنْظُرُونَ (84)"
              "وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ وَلَٰكِنْ لَا تُبْصِرُونَ (85)"
              "فَلَوْلَا إِنْ كُنْتُمْ غَيْرَ مَدِينِينَ (86)"
              "تَرْجِعُونَهَا إِنْ كُنْتُمْ صَادِقِينَ (87)"
              "فَأَمَّا إِنْ كَانَ مِنَ الْمُقَرَّبِينَ (88)"
              "فَرَوْحٌ وَرَيْحَانٌ وَجَنَّةُ نَعِيمٍ (89)"
              "وَأَمَّا إِنْ كَانَ مِنْ أَصْحَابِ الْيَمِينِ (90)"
              "فَسَلَامٌ لَكَ مِنْ أَصْحَابِ الْيَمِينِ (91)"
              "وَأَمَّا إِنْ كَانَ مِنَ الْمُكَذِّبِينَ الضَّالِّينَ (92)"
              "فَنُزُلٌ مِنْ حَمِيمٍ (93)"
              "وَتَصْلِيَةُ جَحِيمٍ (94)"
              "إِنَّ هَٰذَا لَهُوَ حَقُّ الْيَقِينِ (95)"
              "فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ (96)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: 'الحديد',
    surahNumber: 57,
    werd: [
      Werd(
        mp3File: [
          'audio/57/057000.mp3',
          'audio/57/057001.mp3',
          'audio/57/057002.mp3',
          'audio/57/057003.mp3',
          'audio/57/057004.mp3',
          'audio/57/057005.mp3',
          'audio/57/057006.mp3',
        ],

        werdFromTo: '1-6',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ (1)"
              "لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (2)"
              "هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ (3)"
              "هُوَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضِ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَى عَلَى الْعَرْشِ يَعْلَمُ مَا يَلِجُ فِي الْأَرْضِ وَمَا يَخْرُجُ مِنْهَا وَمَا يَنْزِلُ مِنَ السَّمَاءِ وَمَا يَعْرُجُ فِيهَا وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ (4)"
              "لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ (5)"
              "يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ وَهُوَ عَلِيمٌ بِذَاتِ الصُّدُورِ (6)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/57/057007.mp3',
          'audio/57/057008.mp3',
          'audio/57/057009.mp3',
        ],
        werdFromTo: '7-9',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "آمِنُوا بِاللَّهِ وَرَسُولِهِ وَأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ فَالَّذِينَ آمَنُوا مِنْكُمْ وَأَنْفَقُوا لَهُمْ أَجْرٌ كَبِيرٌ (7)"
              "وَمَا لَكُمْ لَا تُؤْمِنُونَ بِاللَّهِ وَالرَّسُولُ يَدْعُوكُمْ لِتُؤْمِنُوا بِرَبِّكُمْ وَقَدْ أَخَذَ مِيثَاقَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ (8)"
              "هُوَ الَّذِي يُنَزِّلُ عَلَى عَبْدِهِ آيَاتٍ بَيِّنَاتٍ لِيُخْرِجَكُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ وَإِنَّ اللَّهَ بِكُمْ لَرَءُوفٌ رَحِيمٌ (9)",
        ],
      ),
      Werd(
        mp3File: ['audio/57/057010.mp3', 'audio/57/057011.mp3'],

        werdFromTo: '10-11',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَمَا لَكُمْ أَلَّا تُنْفِقُوا فِي سَبِيلِ اللَّهِ وَلِلَّهِ مِيرَاثُ السَّمَاوَاتِ وَالْأَرْضِ لَا يَسْتَوِي مِنْكُمْ مَنْ أَنْفَقَ مِنْ قَبْلِ الْفَتْحِ وَقَاتَلَ أُولَئِكَ أَعْظَمُ دَرَجَةً مِنَ الَّذِينَ أَنْفَقُوا مِنْ بَعْدُ وَقَاتَلُوا وَكُلًّا وَعَدَ اللَّهُ الْحُسْنَى وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ (10)"
              "مَنْ ذَا الَّذِي يُقْرِضُ اللَّهَ قَرْضًا حَسَنًا فَيُضَاعِفَهُ لَهُ وَلَهُ أَجْرٌ كَرِيمٌ (11)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/57/057012.mp3',
          'audio/57/057013.mp3',
          'audio/57/057014.mp3',
          'audio/57/057015.mp3',
        ],
        werdFromTo: '12-15',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَوْمَ تَرَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ يَسْعَى نُورُهُمْ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ بُشْرَاكُمُ الْيَوْمَ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ (12)"
              "يَوْمَ يَقُولُ الْمُنَافِقُونَ وَالْمُنَافِقَاتُ لِلَّذِينَ آمَنُوا انْظُرُونَا نَقْتَبِسْ مِنْ نُورِكُمْ قِيلَ ارْجِعُوا وَرَاءَكُمْ فَالْتَمِسُوا نُورًا فَضُرِبَ بَيْنَهُمْ بِسُورٍ لَهُ بَابٌ بَاطِنُهُ فِيهِ الرَّحْمَةُ وَظَاهِرُهُ مِنْ قِبَلِهِ الْعَذَابُ (13)"
              "يُنَادُونَهُمْ أَلَمْ نَكُنْ مَعَكُمْ قَالُوا بَلَى وَلَٰكِنَّكُمْ فَتَنْتُمْ أَنْفُسَكُمْ وَتَرَبَّصْتُمْ وَارْتَبْتُمْ وَغَرَّتْكُمُ الْأَمَانِيُّ حَتَّى جَاءَ أَمْرُ اللَّهِ وَغَرَّكُمْ بِاللَّهِ الْغَرُورُ (14)"
              "فَالْيَوْمَ لَا يُؤْخَذُ مِنْكُمْ فِدْيَةٌ وَلَا مِنَ الَّذِينَ كَفَرُوا مَأْوَاكُمُ النَّارُ هِيَ مَوْلَاكُمْ وَبِئْسَ الْمَصِيرُ (15)",
        ],
      ),
      Werd(
        mp3File: ['audio/57/057016.mp3', 'audio/57/057017.mp3'],
        werdFromTo: '16-17',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَنْ تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ اللَّهِ وَمَا نَزَلَ مِنَ الْحَقِّ وَلَا يَكُونُوا كَالَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلُ فَطَالَ عَلَيْهِمُ الْأَمَدُ فَقَسَتْ قُلُوبُهُمْ وَكَثِيرٌ مِنْهُمْ فَاسِقُونَ (16)"
              "اعْلَمُوا أَنَّ اللَّهَ يُحْيِي الْأَرْضَ بَعْدَ مَوْتِهَا قَدْ بَيَّنَّا لَكُمُ الْآيَاتِ لَعَلَّكُمْ تَعْقِلُونَ (17)",
        ],
      ),
      Werd(
        mp3File: ['audio/57/057018.mp3', 'audio/57/057019.mp3'],
        werdFromTo: '18-19',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ الْمُصَّدِّقِينَ وَالْمُصَّدِّقَاتِ وَأَقْرَضُوا اللَّهَ قَرْضًا حَسَنًا يُضَاعَفُ لَهُمْ وَلَهُمْ أَجْرٌ كَرِيمٌ (18)"
              "وَالَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ أُولَٰئِكَ هُمُ الصِّدِّيقُونَ وَالشُّهَدَاءُ عِنْدَ رَبِّهِمْ لَهُمْ أَجْرُهُمْ وَنُورُهُمْ وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ الْجَحِيمِ (19)",
        ],
      ),
      Werd(
        mp3File: ['audio/57/057020.mp3', 'audio/57/057021.mp3'],
        werdFromTo: '20-21',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "اعْلَمُوا أَنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ وَزِينَةٌ وَتَفَاخُرٌ بَيْنَكُمْ وَتَكَاثُرٌ فِي الْأَمْوَالِ وَالْأَوْلَادِ كَمَثَلِ غَيْثٍ أَعْجَبَ الْكُفَّارَ نَبَاتُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرًّا ثُمَّ يَكُونُ حُطَامًا وَفِي الْآخِرَةِ عَذَابٌ شَدِيدٌ وَمَغْفِرَةٌ مِنَ اللَّهِ وَرِضْوَانٌ وَمَا الْحَيَاةُ الدُّنْيَا إِلَّا مَتَاعُ الْغُرُورِ (20)"
              "سَابِقُوا إِلَى مَغْفِرَةٍ مِنْ رَبِّكُمْ وَجَنَّةٍ عَرْضُهَا كَعَرْضِ السَّمَاءِ وَالْأَرْضِ أُعِدَّتْ لِلَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ ذَٰلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ (21)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/57/057022.mp3',
          'audio/57/057023.mp3',
          'audio/57/057024.mp3',
          'audio/57/057025.mp3',
        ],
        werdFromTo: '22-25',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "مَا أَصَابَ مِنْ مُصِيبَةٍ فِي الْأَرْضِ وَلَا فِي أَنْفُسِكُمْ إِلَّا فِي كِتَابٍ مِنْ قَبْلِ أَنْ نَبْرَأَهَا إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ (22)"
              "لِكَيْلَا تَأْسَوْا عَلَى مَا فَاتَكُمْ وَلَا تَفْرَحُوا بِمَا آتَاكُمْ وَاللَّهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ (23)"
              "الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ وَمَنْ يَتَوَلَّ فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ (24)"
              "لَقَدْ أَرْسَلْنَا رُسُلَنَا بِالْبَيِّنَاتِ وَأَنْزَلْنَا مَعَهُمُ الْكِتَابَ وَالْمِيزَانَ لِيَقُومَ النَّاسُ بِالْقِسْطِ وَأَنْزَلْنَا الْحَدِيدَ فِيهِ بَأْسٌ شَدِيدٌ وَمَنَافِعُ لِلنَّاسِ وَلِيَعْلَمَ اللَّهُ مَنْ يَنْصُرُهُ وَرُسُلَهُ بِالْغَيْبِ إِنَّ اللَّهَ قَوِيٌّ عَزِيزٌ (25)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/57/057026.mp3',
          'audio/57/057027.mp3',
          'audio/57/057028.mp3',
          'audio/57/057029.mp3',
        ],
        werdFromTo: '26-29',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَلَقَدْ أَرْسَلْنَا نُوحًا وَإِبْرَاهِيمَ وَجَعَلْنَا فِي ذُرِّيَّتِهِمَا النُّبُوَّةَ وَالْكِتَابَ فَمِنْهُمْ مُهْتَدٍ وَكَثِيرٌ مِنْهُمْ فَاسِقُونَ (26)"
              "ثُمَّ قَفَّيْنَا عَلَى آثَارِهِمْ بِرُسُلِنَا وَقَفَّيْنَا بِعِيسَى ابْنِ مَرْيَمَ وَآتَيْنَاهُ الْإِنْجِيلَ وَجَعَلْنَا فِي قُلُوبِ الَّذِينَ اتَّبَعُوهُ رَأْفَةً وَرَحْمَةً وَرَهْبَانِيَّةً ابْتَدَعُوهَا مَا كَتَبْنَاهَا عَلَيْهِمْ إِلَّا ابْتِغَاءَ رِضْوَانِ اللَّهِ فَمَا رَعَوْهَا حَقَّ رِعَايَتِهَا فَآتَيْنَا الَّذِينَ آمَنُوا مِنْهُمْ أَجْرَهُمْ وَكَثِيرٌ مِنْهُمْ فَاسِقُونَ (27)"
              "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَآمِنُوا بِرَسُولِهِ يُؤْتِكُمْ كِفْلَيْنِ مِنْ رَحْمَتِهِ وَيَجْعَلْ لَكُمْ نُورًا تَمْشُونَ بِهِ وَيَغْفِرْ لَكُمْ وَاللَّهُ غَفُورٌ رَحِيمٌ (28)"
              "لِئَلَّا يَعْلَمَ أَهْلُ الْكِتَابِ أَلَّا يَقْدِرُونَ عَلَى شَيْءٍ مِنْ فَضْلِ اللَّهِ وَأَنَّ الْفَضْلَ بِيَدِ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ (29)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "المجادلة",
    surahNumber: 58,
    werd: [
      Werd(
        mp3File: [
          'audio/58/058000.mp3',
          'audio/58/058001.mp3',
          'audio/58/058002.mp3',
          'audio/58/058003.mp3',
          'audio/58/058004.mp3',
        ],
        werdFromTo: '1-4',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "قَدْ سَمِعَ اللَّهُ قَوْلَ الَّتِي تُجَادِلُكَ فِي زَوْجِهَا وَتَشْتَكِي إِلَى اللَّهِ وَاللَّهُ يَسْمَعُ تَحَاوُرَكُمَا إِنَّ اللَّهَ سَمِيعٌ بَصِيرٌ (1)"
              "الَّذِينَ يُظَاهِرُونَ مِنْكُمْ مِنْ نِسَائِهِمْ مَا هُنَّ أُمَّهَاتِهِمْ إِنْ أُمَّهَاتُهُمْ إِلَّا اللَّائِي وَلَدْنَهُمْ وَإِنَّهُمْ لَيَقُولُونَ مُنْكَرًا مِنَ الْقَوْلِ وَزُورًا وَإِنَّ اللَّهَ لَعَفُوٌّ غَفُورٌ (2)"
              "وَالَّذِينَ يُظَاهِرُونَ مِنْ نِسَائِهِمْ ثُمَّ يَعُودُونَ لِمَا قَالُوا فَتَحْرِيرُ رَقَبَةٍ مِنْ قَبْلِ أَنْ يَتَمَاسَّا ذَٰلِكُمْ تُوعَظُونَ بِهِ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ (3)"
              "فَمَنْ لَمْ يَجِدْ فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ مِنْ قَبْلِ أَنْ يَتَمَاسَّا فَمَنْ لَمْ يَسْتَطِعْ فَإِطْعَامُ سِتِّينَ مِسْكِينًا ذَٰلِكَ لِتُؤْمِنُوا بِاللَّهِ وَرَسُولِهِ وَتِلْكَ حُدُودُ اللَّهِ وَلِلْكَافِرِينَ عَذَابٌ أَلِيمٌ (4)",
        ],
      ),
      Werd(
        mp3File: ['audio/58/058005.mp3', 'audio/58/058006.mp3'],
        werdFromTo: '5-6',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ الَّذِينَ يُحَادُّونَ اللَّهَ وَرَسُولَهُ كُبِتُوا كَمَا كُبِتَ الَّذِينَ مِنْ قَبْلِهِمْ وَقَدْ أَنْزَلْنَا آيَاتٍ بَيِّنَاتٍ وَلِلْكَافِرِينَ عَذَابٌ مُهِينٌ (5)"
              "يَوْمَ يَبْعَثُهُمُ اللَّهُ جَمِيعًا فَيُنَبِّئُهُمْ بِمَا عَمِلُوا أَحْصَاهُ اللَّهُ وَنَسُوهُ وَاللَّهُ عَلَى كُلِّ شَيْءٍ شَهِيدٌ (6)",
        ],
      ),
      Werd(
        mp3File: ['audio/58/058007.mp3', 'audio/58/058008.mp3'],
        werdFromTo: '7-8',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَلَمْ تَرَ أَنَّ اللَّهَ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ وَلَا أَدْنَى مِنْ ذَٰلِكَ وَلَا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ مَا كَانُوا ثُمَّ يُنَبِّئُهُمْ بِمَا عَمِلُوا يَوْمَ الْقِيَامَةِ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ (7)"
              "أَلَمْ تَرَ إِلَى الَّذِينَ نُهُوا عَنِ النَّجْوَى ثُمَّ يَعُودُونَ لِمَا نُهُوا عَنْهُ وَيَتَنَاجَوْنَ بِالْإِثْمِ وَالْعُدْوَانِ وَمَعْصِيَتِ الرَّسُولِ وَإِذَا جَاءُوكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ اللَّهُ وَيَقُولُونَ فِي أَنْفُسِهِمْ لَوْلَا يُعَذِّبُنَا اللَّهُ بِمَا نَقُولُ حَسْبُهُمْ جَهَنَّمُ يَصْلَوْنَهَا فَبِئْسَ الْمَصِيرُ (8)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/58/058009.mp3',
          'audio/58/058010.mp3',
          'audio/58/058011.mp3',
        ],
        werdFromTo: '9-11',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا تَنَاجَيْتُمْ فَلَا تَتَنَاجَوْا بِالْإِثْمِ وَالْعُدْوَانِ وَمَعْصِيَتِ الرَّسُولِ وَتَنَاجَوْا بِالْبِرِّ وَالتَّقْوَى وَاتَّقُوا اللَّهَ الَّذِي إِلَيْهِ تُحْشَرُونَ (9)"
              "إِنَّمَا النَّجْوَى مِنَ الشَّيْطَانِ لِيَحْزُنَ الَّذِينَ آمَنُوا وَلَيْسَ بِضَارِّهِمْ شَيْئًا إِلَّا بِإِذْنِ اللَّهِ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ (10)"
              "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قِيلَ لَكُمْ تَفَسَّحُوا فِي الْمَجَالِسِ فَافْسَحُوا يَفْسَحِ اللَّهُ لَكُمْ وَإِذَا قِيلَ انْشُزُوا فَانْشُزُوا يَرْفَعِ اللَّهُ الَّذِينَ آمَنُوا مِنْكُمْ وَالَّذِينَ أُوتُوا الْعِلْمَ دَرَجَاتٍ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ (11)",
        ],
      ),
      Werd(
        mp3File: ['audio/58/058012.mp3', 'audio/58/058013.mp3'],
        werdFromTo: '12-13',
        ayats: [
          "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نَاجَيْتُمُ الرَّسُولَ فَقَدِّمُوا بَيْنَ يَدَيْ نَجْوَاكُمْ صَدَقَةً ذَٰلِكَ خَيْرٌ لَكُمْ وَأَطْهَرُ فَإِنْ لَمْ تَجِدُوا فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ (12)"
              "أَأَشْفَقْتُمْ أَنْ تُقَدِّمُوا بَيْنَ يَدَيْ نَجْوَاكُمْ صَدَقَاتٍ فَإِذْ لَمْ تَفْعَلُوا وَتَابَ اللَّهُ عَلَيْكُمْ فَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَأَطِيعُوا اللَّهَ وَرَسُولَهُ وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ (13)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/58/058014.mp3',
          'audio/58/058015.mp3',
          'audio/58/058016.mp3',
          'audio/58/058017.mp3',
          'audio/58/058018.mp3',
          'audio/58/058019.mp3',
        ],
        werdFromTo: '14-19',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَلَمْ تَرَ إِلَى الَّذِينَ تَوَلَّوْا قَوْمًا غَضِبَ اللَّهُ عَلَيْهِمْ مَا هُمْ مِنْكُمْ وَلَا مِنْهُمْ وَيَحْلِفُونَ عَلَى الْكَذِبِ وَهُمْ يَعْلَمُونَ (14)"
              "أَعَدَّ اللَّهُ لَهُمْ عَذَابًا شَدِيدًا إِنَّهُمْ سَاءَ مَا كَانُوا يَعْمَلُونَ (15)"
              "اتَّخَذُوا أَيْمَانَهُمْ جُنَّةً فَصَدُّوا عَنْ سَبِيلِ اللَّهِ فَلَهُمْ عَذَابٌ مُهِينٌ (16)"
              "لَنْ تُغْنِيَ عَنْهُمْ أَمْوَالُهُمْ وَلَا أَوْلَادُهُمْ مِنَ اللَّهِ شَيْئًا أُولَٰئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ (17)"
              "يَوْمَ يَبْعَثُهُمُ اللَّهُ جَمِيعًا فَيَحْلِفُونَ لَهُ كَمَا يَحْلِفُونَ لَكُمْ وَيَحْسَبُونَ أَنَّهُمْ عَلَى شَيْءٍ أَلَا إِنَّهُمْ هُمُ الْكَاذِبُونَ (18)"
              "اسْتَحْوَذَ عَلَيْهِمُ الشَّيْطَانُ فَأَنْسَاهُمْ ذِكْرَ اللَّهِ أُولَٰئِكَ حِزْبُ الشَّيْطَانِ أَلَا إِنَّ حِزْبَ الشَّيْطَانِ هُمُ الْخَاسِرُونَ (19)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/58/058020.mp3',
          'audio/58/058021.mp3',
          'audio/58/058022.mp3',
        ],
        werdFromTo: '20-22',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ الَّذِينَ يُحَادُّونَ اللَّهَ وَرَسُولَهُ أُولَٰئِكَ فِي الْأَذَلِّينَ (20)"
              "كَتَبَ اللَّهُ لَأَغْلِبَنَّ أَنَا وَرُسُلِي إِنَّ اللَّهَ قَوِيٌّ عَزِيزٌ (21)"
              "لَا تَجِدُ قَوْمًا يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ يُوَادُّونَ مَنْ حَادَّ اللَّهَ وَرَسُولَهُ وَلَوْ كَانُوا آبَاءَهُمْ أَوْ أَبْنَاءَهُمْ أَوْ إِخْوَانَهُمْ أَوْ عَشِيرَتَهُمْ أُولَٰئِكَ كَتَبَ فِي قُلُوبِهِمُ الْإِيمَانَ وَأَيَّدَهُمْ بِرُوحٍ مِنْهُ وَيُدْخِلُهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ أُولَٰئِكَ حِزْبُ اللَّهِ أَلَا إِنَّ حِزْبَ اللَّهِ هُمُ الْمُفْلِحُونَ (22)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: 'الحشر',
    surahNumber: 59,
    werd: [
      Werd(
        mp3File: [
          'audio/59/059001.mp3',
          'audio/59/059002.mp3',
          'audio/59/059003.mp3',
          'audio/59/059004.mp3',
        ],
        werdFromTo: '1-4',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ (1)"
              "هُوَ الَّذِي أَخْرَجَ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ مِنْ دِيَارِهِمْ لِأَوَّلِ الْحَشْرِ مَا ظَنَنْتُمْ أَنْ يَخْرُجُوا وَظَنُّوا أَنَّهُمْ مَانِعَتُهُمْ حُصُونُهُمْ مِنَ اللَّهِ فَأَتَاهُمُ اللَّهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوا وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ يُخْرِبُونَ بُيُوتَهُمْ بِأَيْدِيهِمْ وَأَيْدِي الْمُؤْمِنِينَ فَاعْتَبِرُوا يَا أُولِي الْأَبْصَارِ (2)"
              "وَلَوْلَا أَنْ كَتَبَ اللَّهُ عَلَيْهِمُ الْجَلَاءَ لَعَذَّبَهُمْ فِي الدُّنْيَا وَلَهُمْ فِي الْآخِرَةِ عَذَابُ النَّارِ (3)"
              "ذَٰلِكَ بِأَنَّهُمْ شَاقُّوا اللَّهَ وَرَسُولَهُ وَمَنْ يُشَاقِّ اللَّهَ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ (4)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/59/059005.mp3',
          'audio/59/059006.mp3',
          'audio/59/059007.mp3',
        ],
        werdFromTo: '5-7',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَى أُصُولِهَا فَبِإِذْنِ اللَّهِ وَلِيُخْزِيَ الْفَاسِقِينَ (5)"
              "وَمَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ وَلَٰكِنَّ اللَّهَ يُسَلِّطُ رُسُلَهُ عَلَى مَنْ يَشَاءُ وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (6)"
              "مَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْ أَهْلِ الْقُرَى فَلِلَّهِ وَلِلرَّسُولِ وَلِذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ كَيْ لَا يَكُونَ دُولَةً بَيْنَ الْأَغْنِيَاءِ مِنْكُمْ وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ شَدِيدُ الْعِقَابِ (7)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/59/059008.mp3',
          'audio/59/059009.mp3',
          'audio/59/059010.mp3',
        ],
        werdFromTo: '8-10',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "لِلْفُقَرَاءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِنْ دِيَارِهِمْ وَأَمْوَالِهِمْ يَبْتَغُونَ فَضْلًا مِنَ اللَّهِ وَرِضْوَانًا وَيَنْصُرُونَ اللَّهَ وَرَسُولَهُ أُولَٰئِكَ هُمُ الصَّادِقُونَ (8)"
              "وَالَّذِينَ تَبَوَّءُوا الدَّارَ وَالْإِيمَانَ مِنْ قَبْلِهِمْ يُحِبُّونَ مَنْ هَاجَرَ إِلَيْهِمْ وَلَا يَجِدُونَ فِي صُدُورِهِمْ حَاجَةً مِمَّا أُوتُوا وَيُؤْثِرُونَ عَلَى أَنْفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ وَمَنْ يُوقَ شُحَّ نَفْسِهِ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ (9)"
              "وَالَّذِينَ جَاءُوا مِنْ بَعْدِهِمْ يَقُولُونَ رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ (10)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/59/059011.mp3',
          'audio/59/059012.mp3',
          'audio/59/059013.mp3',
        ],
        werdFromTo: '11-13',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَلَمْ تَرَ إِلَى الَّذِينَ نَافَقُوا يَقُولُونَ لِإِخْوَانِهِمُ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ لَئِنْ أُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلَا نُطِيعُ فِيكُمْ أَحَدًا أَبَدًا وَإِذَا قُوتِلْتُمْ لَنَنْصُرَنَّكُمْ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ (11)"
              "لَئِنْ أُخْرِجُوا لَا يَخْرُجُونَ مَعَهُمْ وَلَئِنْ قُوتِلُوا لَا يَنْصُرُونَهُمْ وَلَئِنْ نَصَرُوهُمْ لَيُوَلُّنَّ الْأَدْبَارَ ثُمَّ لَا يُنْصَرُونَ (12)"
              "لَأَنْتُمْ أَشَدُّ رَهْبَةً فِي صُدُورِهِمْ مِنَ اللَّهِ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَفْقَهُونَ (13)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/59/059014.mp3',
          'audio/59/059015.mp3',
          'audio/59/059016.mp3',
          'audio/59/059017.mp3',
        ],
        werdFromTo: '14-17',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "لَا يُقَاتِلُونَكُمْ جَمِيعًا إِلَّا فِي قُرًى مُحَصَّنَةٍ أَوْ مِنْ وَرَاءِ جُدُرٍ بَأْسُهُمْ بَيْنَهُمْ شَدِيدٌ تَحْسَبُهُمْ جَمِيعًا وَقُلُوبُهُمْ شَتَّى ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَعْقِلُونَ (14)"
              "كَمَثَلِ الَّذِينَ مِنْ قَبْلِهِمْ قَرِيبًا ذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ (15)"
              "كَمَثَلِ الشَّيْطَانِ إِذْ قَالَ لِلْإِنْسَانِ اكْفُرْ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ (16)"
              "فَكَانَ عَاقِبَتَهُمَا أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا وَذَٰلِكَ جَزَاءُ الظَّالِمِينَ (17)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/59/059018.mp3',
          'audio/59/059019.mp3',
          'audio/59/059020.mp3',
          'audio/59/059021.mp3',
        ],
        werdFromTo: '18-21',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنْظُرْ نَفْسٌ مَا قَدَّمَتْ لِغَدٍ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ (18)"
              "وَلَا تَكُونُوا كَالَّذِينَ نَسُوا اللَّهَ فَأَنْسَاهُمْ أَنْفُسَهُمْ أُولَٰئِكَ هُمُ الْفَاسِقُونَ (19)"
              "لَا يَسْتَوِي أَصْحَابُ النَّارِ وَأَصْحَابُ الْجَنَّةِ أَصْحَابُ الْجَنَّةِ هُمُ الْفَائِزُونَ (20)"
              "لَوْ أَنْزَلْنَا هَذَا الْقُرْآنَ عَلَى جَبَلٍ لَرَأَيْتَهُ خَاشِعًا مُتَصَدِّعًا مِنْ خَشْيَةِ اللَّهِ وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ (21)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/59/059021.mp3',
          'audio/59/059022.mp3',
          'audio/59/059023.mp3',
          'audio/59/059024.mp3',
        ],

        werdFromTo: '21-24',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "لَوْ أَنْزَلْنَا هَذَا الْقُرْآنَ عَلَى جَبَلٍ لَرَأَيْتَهُ خَاشِعًا مُتَصَدِّعًا مِنْ خَشْيَةِ اللَّهِ وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ (21)"
              "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ هُوَ الرَّحْمَٰنُ الرَّحِيمُ (22)"
              "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ (23)"
              "هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاءُ الْحُسْنَى يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ (24)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الممتحنة",
    surahNumber: 60,
    werd: [
      Werd(
        mp3File: [
          'audio/60/060000.mp3',
          'audio/60/060001.mp3',
          'audio/60/060002.mp3',
          'audio/60/060003.mp3',
        ],
        werdFromTo: '1-3',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ أَوْلِيَاءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ وَقَدْ كَفَرُوا بِمَا جَاءَكُمْ مِنَ الْحَقِّ يُخْرِجُونَ الرَّسُولَ وَإِيَّاكُمْ أَنْ تُؤْمِنُوا بِاللَّهِ رَبِّكُمْ إِنْ كُنْتُمْ خَرَجْتُمْ جِهَادًا فِي سَبِيلِي وَابْتِغَاءَ مَرْضَاتِي تُسِرُّونَ إِلَيْهِمْ بِالْمَوَدَّةِ وَأَنَا أَعْلَمُ بِمَا أَخْفَيْتُمْ وَمَا أَعْلَنْتُمْ وَمَنْ يَفْعَلْهُ مِنْكُمْ فَقَدْ ضَلَّ سَوَاءَ السَّبِيلِ (1)"
              "إِنْ يَثْقَفُوكُمْ يَكُونُوا لَكُمْ أَعْدَاءً وَيَبْسُطُوا إِلَيْكُمْ أَيْدِيَهُمْ وَأَلْسِنَتَهُمْ بِالسُّوءِ وَوَدُّوا لَوْ تَكْفُرُونَ (2)"
              "لَنْ تَنْفَعَكُمْ أَرْحَامُكُمْ وَلَا أَوْلَادُكُمْ يَوْمَ الْقِيَامَةِ يَفْصِلُ بَيْنَكُمْ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ (3)",
        ],
      ),
      Werd(
        mp3File: [
          'audio/60/060004.mp3',
          'audio/60/060005.mp3',
          'audio/60/060006.mp3',
          'audio/60/060007.mp3',
        ],
        werdFromTo: '4-7',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "قَدْ كَانَتْ لَكُمْ أُسْوَةٌ حَسَنَةٌ فِي إِبْرَاهِيمَ وَالَّذِينَ مَعَهُ إِذْ قَالُوا لِقَوْمِهِمْ إِنَّا بُرَآءُ مِنْكُمْ وَمِمَّا تَعْبُدُونَ مِنْ دُونِ اللَّهِ كَفَرْنَا بِكُمْ وَبَدَا بَيْنَنَا وَبَيْنَكُمُ الْعَدَاوَةُ وَالْبَغْضَاءُ أَبَدًا حَتَّى تُؤْمِنُوا بِاللَّهِ وَحْدَهُ إِلَّا قَوْلَ إِبْرَاهِيمَ لِأَبِيهِ لَأَسْتَغْفِرَنَّ لَكَ وَمَا أَمْلِكُ لَكَ مِنَ اللَّهِ مِنْ شَيْءٍ رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ (4)"
              "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ (5)"
              "لَقَدْ كَانَ لَكُمْ فِيهِمْ أُسْوَةٌ حَسَنَةٌ لِمَنْ كَانَ يَرْجُو اللَّهَ وَالْيَوْمَ الْآخِرَ وَمَنْ يَتَوَلَّ فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ (6)"
              "عَسَى اللَّهُ أَنْ يَجْعَلَ بَيْنَكُمْ وَبَيْنَ الَّذِينَ عَادَيْتُمْ مِنْهُمْ مَوَدَّةً وَاللَّهُ قَدِيرٌ وَاللَّهُ غَفُورٌ رَحِيمٌ (7)",
        ],
      ),
      Werd(
        mp3File: ['audio/60/060008.mp3', 'audio/60/060009.mp3'],
        werdFromTo: '8-9',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "لَا يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ لَمْ يُقَاتِلُوكُمْ فِي الدِّينِ وَلَمْ يُخْرِجُوكُمْ مِنْ دِيَارِكُمْ أَنْ تَبَرُّوهُمْ وَتُقْسِطُوا إِلَيْهِمْ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ (8)"
              "إِنَّمَا يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ قَاتَلُوكُمْ فِي الدِّينِ وَأَخْرَجُوكُمْ مِنْ دِيَارِكُمْ وَظَاهَرُوا عَلَى إِخْرَاجِكُمْ أَنْ تَوَلَّوْهُمْ وَمَنْ يَتَوَلَّهُمْ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ (9)",
        ],
      ),
      Werd(
        mp3File: ['audio/60/060010.mp3', 'audio/60/060011.mp3'],

        werdFromTo: '10-11',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا جَاءَكُمُ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ فَامْتَحِنُوهُنَّ اللَّهُ أَعْلَمُ بِإِيمَانِهِنَّ فَإِنْ عَلِمْتُمُوهُنَّ مُؤْمِنَاتٍ فَلَا تَرْجِعُوهُنَّ إِلَى الْكُفَّارِ لَا هُنَّ حِلٌّ لَهُمْ وَلَا هُمْ يَحِلُّونَ لَهُنَّ وَآتُوهُمْ مَا أَنْفَقُوا وَلَا جُنَاحَ عَلَيْكُمْ أَنْ تَنْكِحُوهُنَّ إِذَا آتَيْتُمُوهُنَّ أُجُورَهُنَّ وَلَا تُمْسِكُوا بِعِصَمِ الْكَوَافِرِ وَاسْأَلُوا مَا أَنْفَقْتُمْ وَلْيَسْأَلُوا مَا أَنْفَقُوا ذَٰلِكُمْ حُكْمُ اللَّهِ يَحْكُمُ بَيْنَكُمْ وَاللَّهُ عَلِيمٌ حَكِيمٌ (10)"
              "وَإِنْ فَاتَكُمْ شَيْءٌ مِنْ أَزْوَاجِكُمْ إِلَى الْكُفَّارِ فَعَاقَبْتُمْ فَآتُوا الَّذِينَ ذَهَبَتْ أَزْوَاجُهُمْ مِثْلَ مَا أَنْفَقُوا وَاتَّقُوا اللَّهَ الَّذِي أَنْتُمْ بِهِ مُؤْمِنُونَ (11)",
        ],
      ),
      Werd(
        mp3File: ['audio/60/060012.mp3', 'audio/60/060013.mp3'],
        werdFromTo: '12-13',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ عَلَى أَنْ لَا يُشْرِكْنَ بِاللَّهِ شَيْئًا وَلَا يَسْرِقْنَ وَلَا يَزْنِينَ وَلَا يَقْتُلْنَ أَوْلَادَهُنَّ وَلَا يَأْتِينَ بِبُهْتَانٍ يَفْتَرِينَهُ بَيْنَ أَيْدِيهِنَّ وَأَرْجُلِهِنَّ وَلَا يَعْصِينَكَ فِي مَعْرُوفٍ فَبَايِعْهُنَّ وَاسْتَغْفِرْ لَهُنَّ اللَّهَ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ (12)"
              "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَوَلَّوْا قَوْمًا غَضِبَ اللَّهُ عَلَيْهِمْ قَدْ يَئِسُوا مِنَ الْآخِرَةِ كَمَا يَئِسَ الْكُفَّارُ مِنْ أَصْحَابِ الْقُبُورِ (13)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الصف",
    surahNumber: 61,
    werd: [
      Werd(
        werdFromTo: '1-5',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ (1)"
              "يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ (2)"
              "كَبُرَ مَقْتًا عِنْدَ اللَّهِ أَنْ تَقُولُوا مَا لَا تَفْعَلُونَ (3)"
              "إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُمْ بُنْيَانٌ مَرْصُوصٌ (4)"
              "وَإِذْ قَالَ مُوسَى لِقَوْمِهِ يَا قَوْمِ لِمَ تُؤْذُونَنِي وَقَدْ تَعْلَمُونَ أَنِّي رَسُولُ اللَّهِ إِلَيْكُمْ فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ (5)",
        ],
      ),
      Werd(
        werdFromTo: '6-9',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَإِذْ قَالَ عِيسَى ابْنُ مَرْيَمَ يَا بَنِي إِسْرَائِيلَ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ مُصَدِّقًا لِمَا بَيْنَ يَدَيَّ مِنَ التَّوْرَاةِ وَمُبَشِّرًا بِرَسُولٍ يَأْتِي مِنْ بَعْدِي اسْمُهُ أَحْمَدُ فَلَمَّا جَاءَهُمْ بِالْبَيِّنَاتِ قَالُوا هَذَا سِحْرٌ مُبِينٌ (6)"
              "وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَى عَلَى اللَّهِ الْكَذِبَ وَهُوَ يُدْعَى إِلَى الْإِسْلَامِ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ (7)"
              "يُرِيدُونَ لِيُطْفِئُوا نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَاللَّهُ مُتِمُّ نُورِهِ وَلَوْ كَرِهَ الْكَافِرُونَ (8)"
              "هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَى وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ (9)",
        ],
      ),
      Werd(
        werdFromTo: '10-13',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الَّذِينَ آمَنُوا هَلْ أَدُلُّكُمْ عَلَى تِجَارَةٍ تُنْجِيكُمْ مِنْ عَذَابٍ أَلِيمٍ (10)"
              "تُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ اللَّهِ بِأَمْوَالِكُمْ وَأَنْفُسِكُمْ ذَٰلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ (11)"
              "يَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَيُدْخِلْكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ وَمَسَاكِنَ طَيِّبَةً فِي جَنَّاتِ عَدْنٍ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ (12)"
              "وَأُخْرَى تُحِبُّونَهَا نَصْرٌ مِنَ اللَّهِ وَفَتْحٌ قَرِيبٌ وَبَشِّرِ الْمُؤْمِنِينَ (13)",
        ],
      ),
      Werd(
        werdFromTo: '14',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا أَنْصَارَ اللَّهِ كَمَا قَالَ عِيسَى ابْنُ مَرْيَمَ لِلْحَوَارِيِّينَ مَنْ أَنْصَارِي إِلَى اللَّهِ قَالَ الْحَوَارِيُّونَ نَحْنُ أَنْصَارُ اللَّهِ فَآمَنَتْ طَائِفَةٌ مِنْ بَنِي إِسْرَائِيلَ وَكَفَرَتْ طَائِفَةٌ فَأَيَّدْنَا الَّذِينَ آمَنُوا عَلَى عَدُوِّهِمْ فَأَصْبَحُوا ظَاهِرِينَ (14)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الجمعة",
    surahNumber: 62,
    werd: [
      Werd(
        werdFromTo: '1-4',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ الْمَلِكِ الْقُدُّوسِ الْعَزِيزِ الْحَكِيمِ (1)"
              "هُوَ الَّذِي بَعَثَ فِي الْأُمِّيِّينَ رَسُولًا مِنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِهِ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَإِنْ كَانُوا مِنْ قَبْلُ لَفِي ضَلَالٍ مُبِينٍ (2)"
              "وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا بِهِمْ وَهُوَ الْعَزِيزُ الْحَكِيمُ (3)"
              "ذَٰلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ (4)",
        ],
      ),
      Werd(
        werdFromTo: '5-8',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "مَثَلُ الَّذِينَ حُمِّلُوا التَّوْرَاةَ ثُمَّ لَمْ يَحْمِلُوهَا كَمَثَلِ الْحِمَارِ يَحْمِلُ أَسْفَارًا بِئْسَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِ اللَّهِ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ (5)"
              "قُلْ يَا أَيُّهَا الَّذِينَ هَادُوا إِنْ زَعَمْتُمْ أَنَّكُمْ أَوْلِيَاءُ لِلَّهِ مِنْ دُونِ النَّاسِ فَتَمَنَّوُا الْمَوْتَ إِنْ كُنْتُمْ صَادِقِينَ (6)"
              "وَلَا يَتَمَنَّوْنَهُ أَبَدًا بِمَا قَدَّمَتْ أَيْدِيهِمْ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ (7)"
              "قُلْ إِنَّ الْمَوْتَ الَّذِي تَفِرُّونَ مِنْهُ فَإِنَّهُ مُلَاقِيكُمْ ثُمَّ تُرَدُّونَ إِلَى عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ (8)",
        ],
      ),
      Werd(
        werdFromTo: '9-11',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نُودِيَ لِلصَّلَاةِ مِنْ يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَى ذِكْرِ اللَّهِ وَذَرُوا الْبَيْعَ ذَٰلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ (9)"
              "فَإِذَا قُضِيَتِ الصَّلَاةُ فَانْتَشِرُوا فِي الْأَرْضِ وَابْتَغُوا مِنْ فَضْلِ اللَّهِ وَاذْكُرُوا اللَّهَ كَثِيرًا لَعَلَّكُمْ تُفْلِحُونَ (10)"
              "وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا قُلْ مَا عِنْدَ اللَّهِ خَيْرٌ مِنَ اللَّهْوِ وَمِنَ التِّجَارَةِ وَاللَّهُ خَيْرُ الرَّازِقِينَ (11)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "المنافقون",
    surahNumber: 63,
    werd: [
      Werd(
        werdFromTo: '1-3',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِذَا جَاءَكَ الْمُنَافِقُونَ قَالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ اللَّهِ وَاللَّهُ يَعْلَمُ إِنَّكَ لَرَسُولُهُ وَاللَّهُ يَشْهَدُ إِنَّ الْمُنَافِقِينَ لَكَاذِبُونَ (1)"
              "اتَّخَذُوا أَيْمَانَهُمْ جُنَّةً فَصَدُّوا عَنْ سَبِيلِ اللَّهِ إِنَّهُمْ سَاءَ مَا كَانُوا يَعْمَلُونَ (2)"
              "ذَٰلِكَ بِأَنَّهُمْ آمَنُوا ثُمَّ كَفَرُوا فَطُبِعَ عَلَى قُلُوبِهِمْ فَهُمْ لَا يَفْقَهُونَ (3)",
        ],
      ),
      Werd(
        werdFromTo: '4-8',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَإِذَا رَأَيْتَهُمْ تُعْجِبُكَ أَجْسَامُهُمْ وَإِنْ يَقُولُوا تَسْمَعْ لِقَوْلِهِمْ كَأَنَّهُمْ خُشُبٌ مُسَنَّدَةٌ يَحْسَبُونَ كُلَّ صَيْحَةٍ عَلَيْهِمْ هُمُ الْعَدُوُّ فَاحْذَرْهُمْ قَاتَلَهُمُ اللَّهُ أَنَّى يُؤْفَكُونَ (4)"
              "وَإِذَا قِيلَ لَهُمْ تَعَالَوْا يَسْتَغْفِرْ لَكُمْ رَسُولُ اللَّهِ لَوَّوْا رُءُوسَهُمْ وَرَأَيْتَهُمْ يَصُدُّونَ وَهُمْ مُسْتَكْبِرُونَ (5)"
              "سَوَاءٌ عَلَيْهِمْ أَسْتَغْفَرْتَ لَهُمْ أَمْ لَمْ تَسْتَغْفِرْ لَهُمْ لَنْ يَغْفِرَ اللَّهُ لَهُمْ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ (6)"
              "هُمُ الَّذِينَ يَقُولُونَ لَا تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ حَتَّى يَنْفَضُّوا وَلِلَّهِ خَزَائِنُ السَّمَاوَاتِ وَالْأَرْضِ وَلَٰكِنَّ الْمُنَافِقِينَ لَا يَفْقَهُونَ (7)"
              "يَقُولُونَ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ وَلِلَّهِ الْعِزَّةُ وَلِرَسُولِهِ وَلِلْمُؤْمِنِينَ وَلَٰكِنَّ الْمُنَافِقِينَ لَا يَعْلَمُونَ (8)",
        ],
      ),
      Werd(
        werdFromTo: '9-11',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُلْهِكُمْ أَمْوَالُكُمْ وَلَا أَوْلَادُكُمْ عَنْ ذِكْرِ اللَّهِ وَمَنْ يَفْعَلْ ذَٰلِكَ فَأُولَٰئِكَ هُمُ الْخَاسِرُونَ (9)"
              "وَأَنْفِقُوا مِنْ مَا رَزَقْنَاكُمْ مِنْ قَبْلِ أَنْ يَأْتِيَ أَحَدَكُمُ الْمَوْتُ فَيَقُولَ رَبِّ لَوْلَا أَخَّرْتَنِي إِلَى أَجَلٍ قَرِيبٍ فَأَصَّدَّقَ وَأَكُنْ مِنَ الصَّالِحِينَ (10)"
              "وَلَنْ يُؤَخِّرَ اللَّهُ نَفْسًا إِذَا جَاءَ أَجَلُهَا وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ (11)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "التغابن",
    surahNumber: 64,
    werd: [
      Werd(
        werdFromTo: '1-4',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (1)"
              "هُوَ الَّذِي خَلَقَكُمْ فَمِنْكُمْ كَافِرٌ وَمِنْكُمْ مُؤْمِنٌ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ (2)"
              "خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ وَإِلَيْهِ الْمَصِيرُ (3)"
              "يَعْلَمُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَيَعْلَمُ مَا تُسِرُّونَ وَمَا تُعْلِنُونَ وَاللَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ (4)",
        ],
      ),
      Werd(
        werdFromTo: '5-6',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ كَفَرُوا مِنْ قَبْلُ فَذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ (5)"
              "ذَٰلِكَ بِأَنَّهُ كَانَتْ تَأْتِيهِمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَقَالُوا أَبَشَرٌ يَهْدُونَنَا فَكَفَرُوا وَتَوَلَّوْا وَاسْتَغْنَى اللَّهُ وَاللَّهُ غَنِيٌّ حَمِيدٌ (6)",
        ],
      ),
      Werd(
        werdFromTo: '7-10',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "زَعَمَ الَّذِينَ كَفَرُوا أَنْ لَنْ يُبْعَثُوا قُلْ بَلَى وَرَبِّي لَتُبْعَثُنَّ ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلْتُمْ وَذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ (7)"
              "فَآمِنُوا بِاللَّهِ وَرَسُولِهِ وَالنُّورِ الَّذِي أَنْزَلْنَا وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ (8)"
              "يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِ ذَٰلِكَ يَوْمُ التَّغَابُنِ وَمَنْ يُؤْمِنْ بِاللَّهِ وَيَعْمَلْ صَالِحًا يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ذَٰلِكَ الْفَوْزُ الْعَظِيمُ (9)"
              "وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ النَّارِ خَالِدِينَ فِيهَا وَبِئْسَ الْمَصِيرُ (10)",
        ],
      ),
      Werd(
        werdFromTo: '11-13',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "مَا أَصَابَ مِنْ مُصِيبَةٍ إِلَّا بِإِذْنِ اللَّهِ وَمَنْ يُؤْمِنْ بِاللَّهِ يَهْدِ قَلْبَهُ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ (11)"
              "وَأَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ فَإِنْ تَوَلَّيْتُمْ فَإِنَّمَا عَلَى رَسُولِنَا الْبَلَاغُ الْمُبِينُ (12)"
              "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ (13)",
        ],
      ),
      Werd(
        werdFromTo: '14-18',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّ مِنْ أَزْوَاجِكُمْ وَأَوْلَادِكُمْ عَدُوًّا لَكُمْ فَاحْذَرُوهُمْ وَإِنْ تَعْفُوا وَتَصْفَحُوا وَتَغْفِرُوا فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ (14)"
              "إِنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ وَاللَّهُ عِنْدَهُ أَجْرٌ عَظِيمٌ (15)"
              "فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ وَاسْمَعُوا وَأَطِيعُوا وَأَنْفِقُوا خَيْرًا لِأَنْفُسِكُمْ وَمَنْ يُوقَ شُحَّ نَفْسِهِ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ (16)"
              "إِنْ تُقْرِضُوا اللَّهَ قَرْضًا حَسَنًا يُضَاعِفْهُ لَكُمْ وَيَغْفِرْ لَكُمْ وَاللَّهُ شَكُورٌ حَلِيمٌ (17)"
              "عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْعَزِيزُ الْحَكِيمُ (18)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الطلاق",
    surahNumber: 65,
    werd: [
      Werd(
        werdFromTo: '1-3',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا النَّبِيُّ إِذَا طَلَّقْتُمُ النِّسَاءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحْصُوا الْعِدَّةَ وَاتَّقُوا اللَّهَ رَبَّكُمْ لَا تُخْرِجُوهُنَّ مِنْ بُيُوتِهِنَّ وَلَا يَخْرُجْنَ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ وَتِلْكَ حُدُودُ اللَّهِ وَمَنْ يَتَعَدَّ حُدُودَ اللَّهِ فَقَدْ ظَلَمَ نَفْسَهُ لَا تَدْرِي لَعَلَّ اللَّهَ يُحْدِثُ بَعْدَ ذَٰلِكَ أَمْرًا (1)"
              "فَإِذَا بَلَغْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَوْ فَارِقُوهُنَّ بِمَعْرُوفٍ وَأَشْهِدُوا ذَوَيْ عَدْلٍ مِنْكُمْ وَأَقِيمُوا الشَّهَادَةَ لِلَّهِ ذَٰلِكُمْ يُوعَظُ بِهِ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مَخْرَجًا (2)"
              "وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ وَمَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ إِنَّ اللَّهَ بَالِغُ أَمْرِهِ قَدْ جَعَلَ اللَّهُ لِكُلِّ شَيْءٍ قَدْرًا (3)",
        ],
      ),
      Werd(
        werdFromTo: '4-5',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَاللَّائِي يَئِسْنَ مِنَ الْمَحِيضِ مِنْ نِسَائِكُمْ إِنِ ارْتَبْتُمْ فَعِدَّتُهُنَّ ثَلَاثَةُ أَشْهُرٍ وَاللَّائِي لَمْ يَحِضْنَ وَأُولَاتُ الْأَحْمَالِ أَجَلُهُنَّ أَنْ يَضَعْنَ حَمْلَهُنَّ وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مِنْ أَمْرِهِ يُسْرًا (4)"
              "ذَٰلِكَ أَمْرُ اللَّهِ أَنْزَلَهُ إِلَيْكُمْ وَمَنْ يَتَّقِ اللَّهَ يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُعْظِمْ لَهُ أَجْرًا (5)",
        ],
      ),
      Werd(
        werdFromTo: '6-7',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَسْكِنُوهُنَّ مِنْ حَيْثُ سَكَنْتُمْ مِنْ وُجْدِكُمْ وَلَا تُضَارُّوهُنَّ لِتُضَيِّقُوا عَلَيْهِنَّ وَإِنْ كُنَّ أُولَاتِ حَمْلٍ فَأَنْفِقُوا عَلَيْهِنَّ حَتَّى يَضَعْنَ حَمْلَهُنَّ فَإِنْ أَرْضَعْنَ لَكُمْ فَآتُوهُنَّ أُجُورَهُنَّ وَأْتَمِرُوا بَيْنَكُمْ بِمَعْرُوفٍ وَإِنْ تَعَاسَرْتُمْ فَسَتُرْضِعُ لَهُ أُخْرَى (6)"
              "لِيُنْفِقْ ذُو سَعَةٍ مِنْ سَعَتِهِ وَمَنْ قُدِرَ عَلَيْهِ رِزْقُهُ فَلْيُنْفِقْ مِمَّا آتَاهُ اللَّهُ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا مَا آتَاهَا سَيَجْعَلُ اللَّهُ بَعْدَ عُسْرٍ يُسْرًا (7)",
        ],
      ),
      Werd(
        werdFromTo: '8-12',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَكَأَيِّنْ مِنْ قَرْيَةٍ عَتَتْ عَنْ أَمْرِ رَبِّهَا وَرُسُلِهِ فَحَاسَبْنَاهَا حِسَابًا شَدِيدًا وَعَذَّبْنَاهَا عَذَابًا نُكْرًا (8)"
              "فَذَاقَتْ وَبَالَ أَمْرِهَا وَكَانَ عَاقِبَةُ أَمْرِهَا خُسْرًا (9)"
              "أَعَدَّ اللَّهُ لَهُمْ عَذَابًا شَدِيدًا فَاتَّقُوا اللَّهَ يَا أُولِي الْأَلْبَابِ الَّذِينَ آمَنُوا قَدْ أَنْزَلَ اللَّهُ إِلَيْكُمْ ذِكْرًا (10)"
              "رَسُولًا يَتْلُو عَلَيْكُمْ آيَاتِ اللَّهِ مُبَيِّنَاتٍ لِيُخْرِجَ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ مِنَ الظُّلُمَاتِ إِلَى النُّورِ وَمَنْ يُؤْمِنْ بِاللَّهِ وَيَعْمَلْ صَالِحًا يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا قَدْ أَحْسَنَ اللَّهُ لَهُ رِزْقًا (11)"
              "اللَّهُ الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ وَمِنَ الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ لِتَعْلَمُوا أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا (12)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "التحريم",
    surahNumber: 66,
    werd: [
      Werd(
        werdFromTo: '1-5',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ تَبْتَغِي مَرْضَاتَ أَزْوَاجِكَ وَاللَّهُ غَفُورٌ رَحِيمٌ (1)"
              "قَدْ فَرَضَ اللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ وَاللَّهُ مَوْلَاكُمْ وَهُوَ الْعَلِيمُ الْحَكِيمُ (2)"
              "وَإِذْ أَسَرَّ النَّبِيُّ إِلَى بَعْضِ أَزْوَاجِهِ حَدِيثًا فَلَمَّا نَبَّأَتْ بِهِ وَأَظْهَرَهُ اللَّهُ عَلَيْهِ عَرَّفَ بَعْضَهُ وَأَعْرَضَ عَنْ بَعْضٍ فَلَمَّا نَبَّأَهَا بِهِ قَالَتْ مَنْ أَنْبَأَكَ هَٰذَا قَالَ نَبَّأَنِيَ الْعَلِيمُ الْخَبِيرُ (3)"
              "إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا وَإِنْ تَظَاهَرَا عَلَيْهِ فَإِنَّ اللَّهَ هُوَ مَوْلَاهُ وَجِبْرِيلُ وَصَالِحُ الْمُؤْمِنِينَ وَالْمَلَائِكَةُ بَعْدَ ذَٰلِكَ ظَهِيرٌ (4)"
              "عَسَى رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبْدِلَهُ أَزْوَاجًا خَيْرًا مِنْكُنَّ مُسْلِمَاتٍ مُؤْمِنَاتٍ قَانِتَاتٍ تَائِبَاتٍ عَابِدَاتٍ سَائِحَاتٍ ثَيِّبَاتٍ وَأَبْكَارًا (5)",
        ],
      ),
      Werd(
        werdFromTo: '6-7',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الَّذِينَ آمَنُوا قُوا أَنْفُسَكُمْ وَأَهْلِيكُمْ نَارًا وَقُودُهَا النَّاسُ وَالْحِجَارَةُ عَلَيْهَا مَلَائِكَةٌ غِلَاظٌ شِدَادٌ لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ (6)"
              "يَا أَيُّهَا الَّذِينَ كَفَرُوا لَا تَعْتَذِرُوا الْيَوْمَ إِنَّمَا تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُونَ (7)",
        ],
      ),
      Werd(
        werdFromTo: '8-9',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَصُوحًا عَسَى رَبُّكُمْ أَنْ يُكَفِّرَ عَنْكُمْ سَيِّئَاتِكُمْ وَيُدْخِلَكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارَ يَوْمَ لَا يُخْزِي اللَّهُ النَّبِيَّ وَالَّذِينَ آمَنُوا مَعَهُ نُورُهُمْ يَسْعَى بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ يَقُولُونَ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (8)"
              "يَا أَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنَافِقِينَ وَاغْلُظْ عَلَيْهِمْ وَمَأْوَاهُمْ جَهَنَّمُ وَبِئْسَ الْمَصِيرُ (9)",
        ],
      ),
      Werd(
        werdFromTo: '10-12',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "ضَرَبَ اللَّهُ مَثَلًا لِلَّذِينَ كَفَرُوا امْرَأَتَ نُوحٍ وَامْرَأَتَ لُوطٍ كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتَاهُمَا فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ اللَّهِ شَيْئًا وَقِيلَ ادْخُلَا النَّارَ مَعَ الدَّاخِلِينَ (10)"
              "وَضَرَبَ اللَّهُ مَثَلًا لِلَّذِينَ آمَنُوا امْرَأَتَ فِرْعَوْنَ إِذْ قَالَتْ رَبِّ ابْنِ لِي عِنْدَكَ بَيْتًا فِي الْجَنَّةِ وَنَجِّنِي مِنْ فِرْعَوْنَ وَعَمَلِهِ وَنَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ (11)"
              "وَمَرْيَمَ ابْنَتَ عِمْرَانَ الَّتِي أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهِ مِنْ رُوحِنَا وَصَدَّقَتْ بِكَلِمَاتِ رَبِّهَا وَكُتُبِهِ وَكَانَتْ مِنَ الْقَانِتِينَ (12)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الملك",
    surahNumber: 67,
    werd: [
      Werd(
        werdFromTo: '1-4',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (1)"
              "الَّذِي خَلَقَ الْمَوْتَ وَالْحَيَاةَ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا وَهُوَ الْعَزِيزُ الْغَفُورُ (2)"
              "الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ طِبَاقًا مَا تَرَى فِي خَلْقِ الرَّحْمَٰنِ مِنْ تَفَاوُتٍ فَارْجِعِ الْبَصَرَ هَلْ تَرَى مِنْ فُطُورٍ (3)"
              "ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ يَنْقَلِبْ إِلَيْكَ الْبَصَرُ خَاسِئًا وَهُوَ حَسِيرٌ (4)",
        ],
      ),
      Werd(
        werdFromTo: '5-11',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَلَقَدْ زَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيحَ وَجَعَلْنَاهَا رُجُومًا لِلشَّيَاطِينِ وَأَعْتَدْنَا لَهُمْ عَذَابَ السَّعِيرِ (5)"
              "وَلِلَّذِينَ كَفَرُوا بِرَبِّهِمْ عَذَابُ جَهَنَّمَ وَبِئْسَ الْمَصِيرُ (6)"
              "إِذَا أُلْقُوا فِيهَا سَمِعُوا لَهَا شَهِيقًا وَهِيَ تَفُورُ (7)"
              "تَكَادُ تَمَيَّزُ مِنَ الْغَيْظِ كُلَّمَا أُلْقِيَ فِيهَا فَوْجٌ سَأَلَهُمْ خَزَنَتُهَا أَلَمْ يَأْتِكُمْ نَذِيرٌ (8)"
              "قَالُوا بَلَى قَدْ جَاءَنَا نَذِيرٌ فَكَذَّبْنَا وَقُلْنَا مَا نَزَّلَ اللَّهُ مِنْ شَيْءٍ إِنْ أَنْتُمْ إِلَّا فِي ضَلَالٍ كَبِيرٍ (9)"
              "وَقَالُوا لَوْ كُنَّا نَسْمَعُ أَوْ نَعْقِلُ مَا كُنَّا فِي أَصْحَابِ السَّعِيرِ (10)"
              "فَاعْتَرَفُوا بِذَنْبِهِمْ فَسُحْقًا لِأَصْحَابِ السَّعِيرِ (11)",
        ],
      ),
      Werd(
        werdFromTo: '12-18',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ لَهُمْ مَغْفِرَةٌ وَأَجْرٌ كَبِيرٌ (12)"
              "وَأَسِرُّوا قَوْلَكُمْ أَوِ اجْهَرُوا بِهِ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ (13)"
              "أَلَا يَعْلَمُ مَنْ خَلَقَ وَهُوَ اللَّطِيفُ الْخَبِيرُ (14)"
              "هُوَ الَّذِي جَعَلَ لَكُمُ الْأَرْضَ ذَلُولًا فَامْشُوا فِي مَنَاكِبِهَا وَكُلُوا مِنْ رِزْقِهِ وَإِلَيْهِ النُّشُورُ (15)"
              "أَأَمِنْتُمْ مَنْ فِي السَّمَاءِ أَنْ يَخْسِفَ بِكُمُ الْأَرْضَ فَإِذَا هِيَ تَمُورُ (16)"
              "أَمْ أَمِنْتُمْ مَنْ فِي السَّمَاءِ أَنْ يُرْسِلَ عَلَيْكُمْ حَاصِبًا فَسَتَعْلَمُونَ كَيْفَ نَذِيرِ (17)"
              "وَلَقَدْ كَذَّبَ الَّذِينَ مِنْ قَبْلِهِمْ فَكَيْفَ كَانَ نَكِيرِ (18)",
        ],
      ),
      Werd(
        werdFromTo: '19-22',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَوَلَمْ يَرَوْا إِلَى الطَّيْرِ فَوْقَهُمْ صَافَّاتٍ وَيَقْبِضْنَ مَا يُمْسِكُهُنَّ إِلَّا الرَّحْمَٰنُ إِنَّهُ بِكُلِّ شَيْءٍ بَصِيرٌ (19)"
              "أَمَّنْ هَٰذَا الَّذِي هُوَ جُنْدٌ لَكُمْ يَنْصُرُكُمْ مِنْ دُونِ الرَّحْمَٰنِ إِنِ الْكَافِرُونَ إِلَّا فِي غُرُورٍ (20)"
              "أَمَّنْ هَٰذَا الَّذِي يَرْزُقُكُمْ إِنْ أَمْسَكَ رِزْقَهُ بَلْ لَجُّوا فِي عُتُوٍّ وَنُفُورٍ (21)"
              "أَفَمَنْ يَمْشِي مُكِبًّا عَلَى وَجْهِهِ أَهْدَى أَمَّنْ يَمْشِي سَوِيًّا عَلَى صِرَاطٍ مُسْتَقِيمٍ (22)",
        ],
      ),
      Werd(
        werdFromTo: '23-30',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "قُلْ هُوَ الَّذِي أَنْشَأَكُمْ وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ قَلِيلًا مَا تَشْكُرُونَ (23)"
              "قُلْ هُوَ الَّذِي ذَرَأَكُمْ فِي الْأَرْضِ وَإِلَيْهِ تُحْشَرُونَ (24)"
              "وَيَقُولُونَ مَتَى هَٰذَا الْوَعْدُ إِنْ كُنْتُمْ صَادِقِينَ (25)"
              "قُلْ إِنَّمَا الْعِلْمُ عِنْدَ اللَّهِ وَإِنَّمَا أَنَا نَذِيرٌ مُبِينٌ (26)"
              "فَلَمَّا رَأَوْهُ زُلْفَةً سِيئَتْ وُجُوهُ الَّذِينَ كَفَرُوا وَقِيلَ هَٰذَا الَّذِي كُنْتُمْ بِهِ تَدَّعُونَ (27)"
              "قُلْ أَرَأَيْتُمْ إِنْ أَهْلَكَنِيَ اللَّهُ وَمَنْ مَعِيَ أَوْ رَحِمَنَا فَمَنْ يُجِيرُ الْكَافِرِينَ مِنْ عَذَابٍ أَلِيمٍ (28)"
              "قُلْ هُوَ الرَّحْمَٰنُ آمَنَّا بِهِ وَعَلَيْهِ تَوَكَّلْنَا فَسَتَعْلَمُونَ مَنْ هُوَ فِي ضَلَالٍ مُبِينٍ (29)"
              "قُلْ أَرَأَيْتُمْ إِنْ أَصْبَحَ مَاؤُكُمْ غَوْرًا فَمَنْ يَأْتِيكُمْ بِمَاءٍ مَعِينٍ (30)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "القلم",
    surahNumber: 68,
    werd: [
      Werd(
        werdFromTo: '1-7',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "ن وَالْقَلَمِ وَمَا يَسْطُرُونَ (1)"
              "مَا أَنْتَ بِنِعْمَةِ رَبِّكَ بِمَجْنُونٍ (2)"
              "وَإِنَّ لَكَ لَأَجْرًا غَيْرَ مَمْنُونٍ (3)"
              "وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ (4)"
              "فَسَتُبْصِرُ وَيُبْصِرُونَ (5)"
              "بِأَيِيكُمُ الْمَفْتُونُ (6)"
              "إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ (7)",
        ],
      ),
      Werd(
        werdFromTo: '8-16',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "فَلَا تُطِعِ الْمُكَذِّبِينَ (8)"
              "وَدُّوا لَوْ تُدْهِنُ فَيُدْهِنُونَ (9)"
              "وَلَا تُطِعْ كُلَّ حَلَّافٍ مَهِينٍ (10)"
              "هَمَّازٍ مَشَّاءٍ بِنَمِيمٍ (11)"
              "مَنَّاعٍ لِلْخَيْرِ مُعْتَدٍ أَثِيمٍ (12)"
              "عُتُلٍّ بَعْدَ ذَٰلِكَ زَنِيمٍ (13)"
              "أَنْ كَانَ ذَا مَالٍ وَبَنِينَ (14)"
              "إِذَا تُتْلَى عَلَيْهِ آيَاتُنَا قَالَ أَسَاطِيرُ الْأَوَّلِينَ (15)"
              "سَنَسِمُهُ عَلَى الْخُرْطُومِ (16)",
        ],
      ),
      Werd(
        werdFromTo: '17-33',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّا بَلَوْنَاهُمْ كَمَا بَلَوْنَا أَصْحَابَ الْجَنَّةِ إِذْ أَقْسَمُوا لَيَصْرِمُنَّهَا مُصْبِحِينَ (17)"
              "وَلَا يَسْتَثْنُونَ (18)"
              "فَطَافَ عَلَيْهَا طَائِفٌ مِنْ رَبِّكَ وَهُمْ نَائِمُونَ (19)"
              "فَأَصْبَحَتْ كَالصَّرِيمِ (20)"
              "فَتَنَادَوْا مُصْبِحِينَ (21)"
              "أَنِ اغْدُوا عَلَى حَرْثِكُمْ إِنْ كُنْتُمْ صَارِمِينَ (22)"
              "فَانْطَلَقُوا وَهُمْ يَتَخَافَتُونَ (23)"
              "أَنْ لَا يَدْخُلَنَّهَا الْيَوْمَ عَلَيْكُمْ مِسْكِينٌ (24)"
              "وَغَدَوْا عَلَى حَرْدٍ قَادِرِينَ (25)"
              "فَلَمَّا رَأَوْهَا قَالُوا إِنَّا لَضَالُّونَ (26)"
              "بَلْ نَحْنُ مَحْرُومُونَ (27)"
              "قَالَ أَوْسَطُهُمْ أَلَمْ أَقُلْ لَكُمْ لَوْلَا تُسَبِّحُونَ (28)"
              "قَالُوا سُبْحَانَ رَبِّنَا إِنَّا كُنَّا ظَالِمِينَ (29)"
              "فَأَقْبَلَ بَعْضُهُمْ عَلَى بَعْضٍ يَتَلَاوَمُونَ (30)"
              "قَالُوا يَا وَيْلَنَا إِنَّا كُنَّا طَاغِينَ (31)"
              "عَسَى رَبُّنَا أَنْ يُبْدِلَنَا خَيْرًا مِنْهَا إِنَّا إِلَى رَبِّنَا رَاغِبُونَ (32)"
              "كَذَٰلِكَ الْعَذَابُ وَلَعَذَابُ الْآخِرَةِ أَكْبَرُ لَوْ كَانُوا يَعْلَمُونَ (33)",
        ],
      ),
      Werd(
        werdFromTo: '34-45',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ لِلْمُتَّقِينَ عِنْدَ رَبِّهِمْ جَنَّاتِ النَّعِيمِ (34)"
              "أَفَنَجْعَلُ الْمُسْلِمِينَ كَالْمُجْرِمِينَ (35)"
              "مَا لَكُمْ كَيْفَ تَحْكُمُونَ (36)"
              "أَمْ لَكُمْ كِتَابٌ فِيهِ تَدْرُسُونَ (37)"
              "إِنَّ لَكُمْ فِيهِ لَمَا تَخَيَّرُونَ (38)"
              "أَمْ لَكُمْ أَيْمَانٌ عَلَيْنَا بَالِغَةٌ إِلَى يَوْمِ الْقِيَامَةِ إِنَّ لَكُمْ لَمَا تَحْكُمُونَ (39)"
              "سَلْهُمْ أَيُّهُمْ بِذَٰلِكَ زَعِيمٌ (40)"
              "أَمْ لَهُمْ شُرَكَاءُ فَلْيَأْتُوا بِشُرَكَائِهِمْ إِنْ كَانُوا صَادِقِينَ (41)"
              "يَوْمَ يُكْشَفُ عَنْ سَاقٍ وَيُدْعَوْنَ إِلَى السُّجُودِ فَلَا يَسْتَطِيعُونَ (42)"
              "خَاشِعَةً أَبْصَارُهُمْ تَرْهَقُهُمْ ذِلَّةٌ وَقَدْ كَانُوا يُدْعَوْنَ إِلَى السُّجُودِ وَهُمْ سَالِمُونَ (43)"
              "فَذَرْنِي وَمَنْ يُكَذِّبُ بِهَٰذَا الْحَدِيثِ سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ (44)"
              "وَأُمْلِي لَهُمْ إِنَّ كَيْدِي مَتِينٌ (45)",
        ],
      ),
      Werd(
        werdFromTo: '46-52',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَمْ تَسْأَلُهُمْ أَجْرًا فَهُمْ مِنْ مَغْرَمٍ مُثْقَلُونَ (46)"
              "أَمْ عِنْدَهُمُ الْغَيْبُ فَهُمْ يَكْتُبُونَ (47)"
              "فَاصْبِرْ لِحُكْمِ رَبِّكَ وَلَا تَكُنْ كَصَاحِبِ الْحُوتِ إِذْ نَادَى وَهُوَ مَكْظُومٌ (48)"
              "لَوْلَا أَنْ تَدَارَكَهُ نِعْمَةٌ مِنْ رَبِّهِ لَنُبِذَ بِالْعَرَاءِ وَهُوَ مَذْمُومٌ (49)"
              "فَاجْتَبَاهُ رَبُّهُ فَجَعَلَهُ مِنَ الصَّالِحِينَ (50)"
              "وَإِنْ يَكَادُ الَّذِينَ كَفَرُوا لَيُزْلِقُونَكَ بِأَبْصَارِهِمْ لَمَّا سَمِعُوا الذِّكْرَ وَيَقُولُونَ إِنَّهُ لَمَجْنُونٌ (51)"
              "وَمَا هُوَ إِلَّا ذِكْرٌ لِلْعَالَمِينَ (52)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الحاقة",
    surahNumber: 69,
    werd: [
      Werd(
        werdFromTo: '1-8',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "الْحَاقَّةُ (1)"
              "مَا الْحَاقَّةُ (2)"
              "وَمَا أَدْرَاكَ مَا الْحَاقَّةُ (3)"
              "كَذَّبَتْ ثَمُودُ وَعَادٌ بِالْقَارِعَةِ (4)"
              "فَأَمَّا ثَمُودُ فَأُهْلِكُوا بِالطَّاغِيَةِ (5)"
              "وَأَمَّا عَادٌ فَأُهْلِكُوا بِرِيحٍ صَرْصَرٍ عَاتِيَةٍ (6)"
              "سَخَّرَهَا عَلَيْهِمْ سَبْعَ لَيَالٍ وَثَمَانِيَةَ أَيَّامٍ حُسُومًا فَتَرَى الْقَوْمَ فِيهَا صَرْعَىٰ كَأَنَّهُمْ أَعْجَازُ نَخْلٍ خَاوِيَةٍ (7)"
              "فَهَلْ تَرَىٰ لَهُم مِّن بَاقِيَةٍ (8)",
        ],
      ),
      Werd(
        werdFromTo: '9-12',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَجَاءَ فِرْعَوْنُ وَمَن قَبْلَهُ وَالْمُؤْتَفِكَاتُ بِالْخَاطِئَةِ (9)"
              "فَعَصَوْا رَسُولَ رَبِّهِمْ فَأَخَذَهُمْ أَخْذَةً رَّابِيَةً (10)"
              "إِنَّا لَمَّا طَغَى الْمَاءُ حَمَلْنَاكُمْ فِي الْجَارِيَةِ (11)"
              "لِنَجْعَلَهَا لَكُمْ تَذْكِرَةً وَتَعِيَهَا أُذُنٌ وَاعِيَةٌ (12)",
        ],
      ),
      Werd(
        werdFromTo: '13-24',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "فَإِذَا نُفِخَ فِي الصُّورِ نَفْخَةٌ وَاحِدَةٌ (13)"
              "وَحُمِلَتِ الْأَرْضُ وَالْجِبَالُ فَدُكَّتَا دَكَّةً وَاحِدَةً (14)"
              "فَيَوْمَئِذٍ وَقَعَتِ الْوَاقِعَةُ (15)"
              "وَانشَقَّتِ السَّمَاءُ فَهِيَ يَوْمَئِذٍ وَاهِيَةٌ (16)"
              "وَالْمَلَكُ عَلَىٰ أَرْجَائِهَا وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمَانِيَةٌ (17)"
              "يَوْمَئِذٍ تُعْرَضُونَ لَا تَخْفَىٰ مِنكُمْ خَافِيَةٌ (18)"
              "فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ فَيَقُولُ هَاؤُمُ اقْرَءُوا كِتَابِيَهْ (19)"
              "إِنِّي ظَنَنتُ أَنِّي مُلَاقٍ حِسَابِيَهْ (20)"
              "فَهُوَ فِي عِيشَةٍ رَّاضِيَةٍ (21)"
              "فِي جَنَّةٍ عَالِيَةٍ (22)"
              "قُطُوفُهَا دَانِيَةٌ (23)"
              "كُلُوا وَاشْرَبُوا هَنِيئًا بِمَا أَسْلَفْتُمْ فِي الْأَيَّامِ الْخَالِيَةِ (24)",
        ],
      ),
      Werd(
        werdFromTo: '25-37',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِشِمَالِهِ فَيَقُولُ يَا لَيْتَنِي لَمْ أُوتَ كِتَابِيَهْ (25)"
              "وَلَمْ أَدْرِ مَا حِسَابِيَهْ (26)"
              "يَا لَيْتَهَا كَانَتِ الْقَاضِيَةَ (27)"
              "مَا أَغْنَىٰ عَنِّي مَالِيَهْ ۜ (28)"
              "هَلَكَ عَنِّي سُلْطَانِيَهْ (29)"
              "خُذُوهُ فَغُلُّوهُ (30)"
              "ثُمَّ الْجَحِيمَ صَلُّوهُ (31)"
              "ثُمَّ فِي سِلْسِلَةٍ ذَرْعُهَا سَبْعُونَ ذِرَاعًا فَاسْلُكُوهُ (32)"
              "إِنَّهُ كَانَ لَا يُؤْمِنُ بِاللَّهِ الْعَظِيمِ (33)"
              "وَلَا يَحُضُّ عَلَىٰ طَعَامِ الْمِسْكِينِ (34)"
              "فَلَيْسَ لَهُ الْيَوْمَ هَاهُنَا حَمِيمٌ (35)"
              "وَلَا طَعَامٌ إِلَّا مِنْ غِسْلِينٍ (36)"
              "لَا يَأْكُلُهُ إِلَّا الْخَاطِئُونَ (37)",
        ],
      ),
      Werd(
        werdFromTo: '38-52',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "فَلَا أُقْسِمُ بِمَا تُبْصِرُونَ (38)"
              "وَمَا لَا تُبْصِرُونَ (39)"
              "إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ (40)"
              "وَمَا هُوَ بِقَوْلِ شَاعِرٍ قَلِيلًا مَا تُؤْمِنُونَ (41)"
              "وَلَا بِقَوْلِ كَاهِنٍ قَلِيلًا مَا تَذَكَّرُونَ (42)"
              "تَنزِيلٌ مِنْ رَبِّ الْعَالَمِينَ (43)"
              "وَلَوْ تَقَوَّلَ عَلَيْنَا بَعْضَ الْأَقَاوِيلِ (44)"
              "لَأَخَذْنَا مِنْهُ بِالْيَمِينِ (45)"
              "ثُمَّ لَقَطَعْنَا مِنْهُ الْوَتِينَ (46)"
              "فَمَا مِنكُم مِّنْ أَحَدٍ عَنْهُ حَاجِزِينَ (47)"
              "وَإِنَّهُ لَتَذْكِرَةٌ لِّلْمُتَّقِينَ (48)"
              "وَإِنَّا لَنَعْلَمُ أَنَّ مِنكُم مُّكَذِّبِينَ (49)"
              "وَإِنَّهُ لَحَسْرَةٌ عَلَى الْكَافِرِينَ (50)"
              "وَإِنَّهُ لَحَقُّ الْيَقِينِ (51)"
              "فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ (52)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "المعارج",
    surahNumber: 70,
    werd: [
      Werd(
        werdFromTo: '1-18',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "سَأَلَ سَائِلٌ بِعَذَابٍ وَاقِعٍ (1)"
              "لِّلْكَافِرِينَ لَيْسَ لَهُ دَافِعٌ (2)"
              "مِّنَ اللَّهِ ذِي الْمَعَارِجِ (3)"
              "تَعْرُجُ الْمَلَائِكَةُ وَالرُّوحُ إِلَيْهِ فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ (4)"
              "فَاصْبِرْ صَبْرًا جَمِيلًا (5)"
              "إِنَّهُمْ يَرَوْنَهُ بَعِيدًا (6)"
              "وَنَرَاهُ قَرِيبًا (7)"
              "يَوْمَ تَكُونُ السَّمَاءُ كَالْمُهْلِ (8)"
              "وَتَكُونُ الْجِبَالُ كَالْعِهْنِ (9)"
              "وَلَا يَسْأَلُ حَمِيمٌ حَمِيمًا (10)"
              "يُبَصَّرُونَهُمْ يَوَدُّ الْمُجْرِمُ لَوْ يَفْتَدِي مِنْ عَذَابِ يَوْمِئِذٍ بِبَنِيهِ (11)"
              "وَصَاحِبَتِهِ وَأَخِيهِ (12)"
              "وَفَصِيلَتِهِ الَّتِي تُؤْوِيهِ (13)"
              "وَمَن فِي الْأَرْضِ جَمِيعًا ثُمَّ يُنجِيهِ (14)"
              "كَلَّا إِنَّهَا لَظَىٰ (15)"
              "نَزَّاعَةً لِّلشَّوَىٰ (16)"
              "تَدْعُو مَنْ أَدْبَرَ وَتَوَلَّىٰ (17)"
              "وَجَمَعَ فَأَوْعَىٰ (18)",
        ],
      ),
      Werd(
        werdFromTo: '19-35',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ الْإِنسَانَ خُلِقَ هَلُوعًا (19)"
              "إِذَا مَسَّهُ الشَّرُّ جَزُوعًا (20)"
              "وَإِذَا مَسَّهُ الْخَيْرُ مَنُوعًا (21)"
              "إِلَّا الْمُصَلِّينَ (22)"
              "الَّذِينَ هُمْ عَلَىٰ صَلَاتِهِمْ دَائِمُونَ (23)"
              "وَالَّذِينَ فِي أَمْوَالِهِمْ حَقٌّ مَّعْلُومٌ (24)"
              "لِّلسَّائِلِ وَالْمَحْرُومِ (25)"
              "وَالَّذِينَ يُصَدِّقُونَ بِيَوْمِ الدِّينِ (26)"
              "وَالَّذِينَ هُم مِّنْ عَذَابِ رَبِّهِم مُّشْفِقُونَ (27)"
              "إِنَّ عَذَابَ رَبِّهِمْ غَيْرُ مَأْمُونٍ (28)"
              "وَالَّذِينَ هُمْ لِفُرُوجِهِمْ حَافِظُونَ (29)"
              "إِلَّا عَلَىٰ أَزْوَاجِهِمْ أَوْ مَا مَلَكَتْ أَيْمَانُهُمْ فَإِنَّهُمْ غَيْرُ مَلُومِينَ (30)"
              "فَمَنِ ابْتَغَىٰ وَرَاءَ ذَٰلِكَ فَأُولَٰئِكَ هُمُ الْعَادُونَ (31)"
              "وَالَّذِينَ هُمْ لِأَمَانَاتِهِمْ وَعَهْدِهِمْ رَاعُونَ (32)"
              "وَالَّذِينَ هُم بِشَهَادَاتِهِمْ قَائِمُونَ (33)"
              "وَالَّذِينَ هُمْ عَلَىٰ صَلَاتِهِمْ يُحَافِظُونَ (34)"
              "أُولَٰئِكَ فِي جَنَّاتٍ مُّكْرَمُونَ (35)",
        ],
      ),
      Werd(
        werdFromTo: '36-44',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "فَمَالِ الَّذِينَ كَفَرُوا قِبَلَكَ مُهْطِعِينَ (36)"
              "عَنِ الْيَمِينِ وَعَنِ الشِّمَالِ عِزِينَ (37)"
              "أَيَطْمَعُ كُلُّ امْرِئٍ مِّنْهُمْ أَن يُدْخَلَ جَنَّةَ نَعِيمٍ (38)"
              "كَلَّا إِنَّا خَلَقْنَاهُم مِّمَّا يَعْلَمُونَ (39)"
              "فَلَا أُقْسِمُ بِرَبِّ الْمَشَارِقِ وَالْمَغَارِبِ إِنَّا لَقَادِرُونَ (40)"
              "عَلَىٰ أَن نُّبَدِّلَ خَيْرًا مِّنْهُمْ وَمَا نَحْنُ بِمَسْبُوقِينَ (41)"
              "فَذَرْهُمْ يَخُوضُوا وَيَلْعَبُوا حَتَّىٰ يُلَاقُوا يَوْمَهُمُ الَّذِي يُوعَدُونَ (42)"
              "يَوْمَ يَخْرُجُونَ مِنَ الْأَجْدَاثِ سِرَاعًا كَأَنَّهُمْ إِلَىٰ نُصُبٍ يُوفِضُونَ (43)"
              "خَاشِعَةً أَبْصَارُهُمْ تَرْهَقُهُمْ ذِلَّةٌ ذَٰلِكَ الْيَوْمُ الَّذِي كَانُوا يُوعَدُونَ (44)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "نوح",
    surahNumber: 71,
    werd: [
      Werd(
        werdFromTo: '1-4',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّا أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ أَنْ أَنذِرْ قَوْمَكَ مِن قَبْلِ أَن يَأْتِيَهُمْ عَذَابٌ أَلِيمٌ (1)"
              "قَالَ يَا قَوْمِ إِنِّي لَكُمْ نَذِيرٌ مُّبِينٌ (2)"
              "أَنِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ وَأَطِيعُونِ (3)"
              "يَغْفِرْ لَكُم مِّن ذُنُوبِكُمْ وَيُؤَخِّرْكُمْ إِلَىٰ أَجَلٍ مُّسَمًّى إِنَّ أَجَلَ اللَّهِ إِذَا جَاءَ لَا يُؤَخَّرُ لَوْ كُنتُمْ تَعْلَمُونَ (4)",
        ],
      ),
      Werd(
        werdFromTo: '5-9',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "قَالَ رَبِّ إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا (5)"
              "فَلَمْ يَزِدْهُمْ دُعَائِي إِلَّا فِرَارًا (6)"
              "وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَأَصَرُّوا وَاسْتَكْبَرُوا اسْتِكْبَارًا (7)"
              "ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَارًا (8)"
              "ثُمَّ إِنِّي أَعْلَنتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا (9)",
        ],
      ),
      Werd(
        werdFromTo: '10-20',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا (10)"
              "يُرْسِلِ السَّمَاءَ عَلَيْكُم مِّدْرَارًا (11)"
              "وَيُمْدِدْكُم بِأَمْوَالٍ وَبَنِينَ وَيَجْعَل لَّكُمْ جَنَّاتٍ وَيَجْعَل لَّكُمْ أَنْهَارًا (12)"
              "مَّا لَكُمْ لَا تَرْجُونَ لِلَّهِ وَقَارًا (13)"
              "وَقَدْ خَلَقَكُمْ أَطْوَارًا (14)"
              "أَلَمْ تَرَوْا كَيْفَ خَلَقَ اللَّهُ سَبْعَ سَمَاوَاتٍ طِبَاقًا (15)"
              "وَجَعَلَ الْقَمَرَ فِيهِنَّ نُورًا وَجَعَلَ الشَّمْسَ سِرَاجًا (16)"
              "وَاللَّهُ أَنبَتَكُم مِّنَ الْأَرْضِ نَبَاتًا (17)"
              "ثُمَّ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجًا (18)"
              "وَاللَّهُ جَعَلَ لَكُمُ الْأَرْضَ بِسَاطًا (19)"
              "لِتَسْلُكُوا مِنْهَا سُبُلًا فِجَاجًا (20)",
        ],
      ),
      Werd(
        werdFromTo: '21-28',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "قَالَ نُوحٌ رَّبِّ إِنَّهُمْ عَصَوْنِي وَاتَّبَعُوا مَن لَّمْ يَزِدْهُ مَالُهُ وَوَلَدُهُ إِلَّا خَسَارًا (21)"
              "وَمَكَرُوا مَكْرًا كُبَّارًا (22)"
              "وَقَالُوا لَا تَذَرُنَّ آلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا (23)"
              "وَقَدْ أَضَلُّوا كَثِيرًا وَلَا تَزِدِ الظَّالِمِينَ إِلَّا ضَلَالًا (24)"
              "مِمَّا خَطِيئَاتِهِمْ أُغْرِقُوا فَأُدْخِلُوا نَارًا فَلَمْ يَجِدُوا لَهُم مِّن دُونِ اللَّهِ أَنصَارًا (25)"
              "وَقَالَ نُوحٌ رَّبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا (26)"
              "إِنَّكَ إِن تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا (27)"
              "رَّبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا (28)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الجن",
    surahNumber: 72,
    werd: [
      Werd(
        werdFromTo: '1-7',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِّنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا (1)"
              "يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ وَلَن نُّشْرِكَ بِرَبِّنَا أَحَدًا (2)"
              "وَأَنَّهُ تَعَالَىٰ جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلَا وَلَدًا (3)"
              "وَأَنَّهُ كَانَ يَقُولُ سَفِيهُنَا عَلَى اللَّهِ شَطَطًا (4)"
              "وَأَنَّا ظَنَنَّا أَن لَّن تَقُولَ الْإِنسُ وَالْجِنُّ عَلَى اللَّهِ كَذِبًا (5)"
              "وَأَنَّهُ كَانَ رِجَالٌ مِّنَ الْإِنسِ يَعُوذُونَ بِرِجَالٍ مِّنَ الْجِنِّ فَزَادُوهُمْ رَهَقًا (6)"
              "وَأَنَّهُمْ ظَنُّوا كَمَا ظَنَنتُمْ أَن لَّن يَبْعَثَ اللَّهُ أَحَدًا (7)",
        ],
      ),
      Werd(
        werdFromTo: '8-13',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَأَنَّا لَمَسْنَا السَّمَاءَ فَوَجَدْنَاهَا مُلِئَتْ حَرَسًا شَدِيدًا وَشُهُبًا (8)"
              "وَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ فَمَن يَسْتَمِعِ الْآنَ يَجِدْ لَهُ شِهَابًا رَّصَدًا (9)"
              "وَأَنَّا لَا نَدْرِي أَشَرٌّ أُرِيدَ بِمَن فِي الْأَرْضِ أَمْ أَرَادَ بِهِمْ رَبُّهُمْ رَشَدًا (10)"
              "وَأَنَّا مِنَّا الصَّالِحُونَ وَمِنَّا دُونَ ذَٰلِكَ كُنَّا طَرَائِقَ قِدَدًا (11)"
              "وَأَنَّا ظَنَنَّا أَن لَّن نُّعجِزَ اللَّهَ فِي الْأَرْضِ وَلَن نُّعْجِزَهُ هَرَبًا (12)"
              "وَأَنَّا لَمَّا سَمِعْنَا الْهُدَىٰ آمَنَّا بِهِ فَمَن يُؤْمِن بِرَبِّهِ فَلَا يَخَافُ بَخْسًا وَلَا رَهَقًا (13)",
        ],
      ),
      Werd(
        werdFromTo: '14-24',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَأَنَّا مِنَّا الْمُسْلِمُونَ وَمِنَّا الْقَاسِطُونَ فَمَنْ أَسْلَمَ فَأُولَٰئِكَ تَحَرَّوْا رَشَدًا (14)"
              "وَأَمَّا الْقَاسِطُونَ فَكَانُوا لِجَهَنَّمَ حَطَبًا (15)"
              "وَأَن لَّوِ اسْتَقَامُوا عَلَى الطَّرِيقَةِ لَأَسْقَيْنَاهُم مَّاءً غَدَقًا (16)"
              "لِنَفْتِنَهُمْ فِيهِ وَمَن يُعْرِضْ عَن ذِكْرِ رَبِّهِ يَسْلُكْهُ عَذَابًا صَعَدًا (17)"
              "وَأَنَّ الْمَسَاجِدَ لِلَّهِ فَلَا تَدْعُو مَعَ اللَّهِ أَحَدًا (18)"
              "وَأَنَّهُ لَمَّا قَامَ عَبْدُ اللَّهِ يَدْعُوهُ كَادُوا يَكُونُونَ عَلَيْهِ لِبَدًا (19)"
              "قُلْ إِنَّمَا أَدْعُو رَبِّي وَلَا أُشْرِكُ بِهِ أَحَدًا (20)"
              "قُلْ إِنِّي لَا أَمْلِكُ لَكُمْ ضَرًّا وَلَا رَشَدًا (21)"
              "قُلْ إِنِّي لَن يُجِيرَنِي مِنَ اللَّهِ أَحَدٌ وَلَنْ أَجِدَ مِن دُونِهِ مُلْتَحَدًا (22)"
              "إِلَّا بَلَاغًا مِّنَ اللَّهِ وَرِسَالَاتِهِ وَمَن يَعْصِ اللَّهَ وَرَسُولَهُ فَإِنَّ لَهُ نَارَ جَهَنَّمَ خَالِدِينَ فِيهَا أَبَدًا (23)"
              "حَتَّىٰ إِذَا رَأَوْا مَا يُوعَدُونَ فَسَيَعْلَمُونَ مَنْ أَضْعَفُ نَاصِرًا وَأَقَلُّ عَدَدًا (24)",
        ],
      ),
      Werd(
        werdFromTo: '25-28',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "قُلْ إِنْ أَدْرِي أَقَرِيبٌ مَّا تُوعَدُونَ أَمْ يَجْعَلُ لَهُ رَبِّي أَمَدًا (25)"
              "عَالِمُ الْغَيْبِ فَلَا يُظْهِرُ عَلَىٰ غَيْبِهِ أَحَدًا (26)"
              "إِلَّا مَنِ ارْتَضَىٰ مِن رَّسُولٍ فَإِنَّهُ يَسْلُكُ مِن بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ رَصَدًا (27)"
              "لِّيَعْلَمَ أَن قَدْ أَبْلَغُوا رِسَالَاتِ رَبِّهِمْ وَأَحَاطَ بِمَا لَدَيْهِمْ وَأَحْصَىٰ كُلَّ شَيْءٍ عَدَدًا (28)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "لمزمل",
    surahNumber: 73,
    werd: [
      Werd(
        werdFromTo: '1-14',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الْمُزَّمِّلُ (1)"
              "قُمِ اللَّيْلَ إِلَّا قَلِيلًا (2)"
              "نِصْفَهُ أَوِ انقُصْ مِنْهُ قَلِيلًا (3)"
              "أَوْ زِدْ عَلَيْهِ وَرَتِّلِ الْقُرْآنَ تَرْتِيلًا (4)"
              "إِنَّا سَنُلْقِي عَلَيْكَ قَوْلًا ثَقِيلًا (5)"
              "إِنَّ نَاشِئَةَ اللَّيْلِ هِيَ أَشَدُّ وَطْئًا وَأَقْوَمُ قِيلًا (6)"
              "إِنَّ لَكَ فِي النَّهَارِ سَبْحًا طَوِيلًا (7)"
              "وَاذْكُرِ اسْمَ رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلًا (8)"
              "رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ لَا إِلَٰهَ إِلَّا هُوَ فَاتَّخِذْهُ وَكِيلًا (9)"
              "وَاصْبِرْ عَلَىٰ مَا يَقُولُونَ وَاهْجُرْهُمْ هَجْرًا جَمِيلًا (10)"
              "وَذَرْنِي وَالْمُكَذِّبِينَ أُولِي النَّعْمَةِ وَمَهِّلْهُمْ قَلِيلًا (11)"
              "إِنَّ لَدَيْنَا أَنكَالًا وَجَحِيمًا (12)"
              "وَطَعَامًا ذَا غُصَّةٍ وَعَذَابًا أَلِيمًا (13)"
              "يَوْمَ تَرْجُفُ الْأَرْضُ وَالْجِبَالُ وَكَانَتِ الْجِبَالُ كَثِيبًا مَّهِيلًا (14)",
        ],
      ),
      Werd(
        werdFromTo: '15-19',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّا أَرْسَلْنَا إِلَيْكُمْ رَسُولًا شَاهِدًا عَلَيْكُمْ كَمَا أَرْسَلْنَا إِلَىٰ فِرْعَوْنَ رَسُولًا (15)"
              "فَعَصَىٰ فِرْعَوْنُ الرَّسُولَ فَأَخَذْنَاهُ أَخْذًا وَبِيلًا (16)"
              "فَكَيْفَ تَتَّقُونَ إِن كَفَرْتُمْ يَوْمًا يَجْعَلُ الْوِلْدَانَ شِيبًا (17)"
              "السَّمَاءُ مُنفَطِرٌ بِهِ كَانَ وَعْدُهُ مَفْعُولًا (18)"
              "إِنَّ هَٰذِهِ تَذْكِرَةٌ فَمَن شَاءَ اتَّخَذَ إِلَىٰ رَبِّهِ سَبِيلًا (19)",
        ],
      ),
      Werd(
        werdFromTo: '20',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنَىٰ مِن ثُلُثَيِ اللَّيْلِ وَنِصْفَهُ وَثُلُثَهُ وَطَائِفَةٌ مِّنَ الَّذِينَ مَعَكَ وَاللَّهُ يُقَدِّرُ اللَّيْلَ وَالنَّهَارَ عَلِمَ أَن لَّن تُحْصُوهُ فَتَابَ عَلَيْكُمْ فَاقْرَءُوا مَا تَيَسَّرَ مِنَ الْقُرْآنِ عَلِمَ أَن سَيَكُونُ مِنكُم مَّرْضَىٰ وَآخَرُونَ يَضْرِبُونَ فِي الْأَرْضِ يَبْتَغُونَ مِن فَضْلِ اللَّهِ وَآخَرُونَ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُ وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا وَمَا تُقَدِّمُوا لِأَنفُسِكُم مِّنْ خَيْرٍ تَجِدُوهُ عِندَ اللَّهِ هُوَ خَيْرًا وَأَعْظَمَ أَجْرًا وَاسْتَغْفِرُوا اللَّهَ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ (20)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "المدثر",
    surahNumber: 74,
    werd: [
      Werd(
        werdFromTo: '1-16',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "يَا أَيُّهَا الْمُدَّثِّرُ (1)"
              "قُمْ فَأَنذِرْ (2)"
              "وَرَبَّكَ فَكَبِّرْ (3)"
              "وَثِيَابَكَ فَطَهِّرْ (4)"
              "وَالرُّجْزَ فَاهْجُرْ (5)"
              "وَلَا تَمْنُن تَسْتَكْثِرُ (6)"
              "وَلِرَبِّكَ فَاصْبِرْ (7)"
              "فَإِذَا نُقِرَ فِي النَّاقُورِ (8)"
              "فَذَٰلِكَ يَوْمَئِذٍ يَوْمٌ عَسِيرٌ (9)"
              "عَلَى الْكَافِرِينَ غَيْرُ يَسِيرٍ (10)"
              "ذَرْنِي وَمَنْ خَلَقْتُ وَحِيدًا (11)"
              "وَجَعَلْتُ لَهُ مَالًا مَّمْدُودًا (12)"
              "وَبَنِينَ شُهُودًا (13)"
              "وَمَهَّدتُّ لَهُ تَمْهِيدًا (14)"
              "ثُمَّ يَطْمَعُ أَنْ أَزِيدَ (15)"
              "كَلَّا إِنَّهُ كَانَ لِآيَاتِنَا عَنِيدًا (16)",
        ],
      ),
      Werd(
        werdFromTo: '17-31',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "سَأُرْهِقُهُ صَعُودًا (17)"
              "إِنَّهُ فَكَّرَ وَقَدَّرَ (18)"
              "فَقُتِلَ كَيْفَ قَدَّرَ (19)"
              "ثُمَّ قُتِلَ كَيْفَ قَدَّرَ (20)"
              "ثُمَّ نَظَرَ (21)"
              "ثُمَّ عَبَسَ وَبَسَرَ (22)"
              "ثُمَّ أَدْبَرَ وَاسْتَكْبَرَ (23)"
              "فَقَالَ إِنْ هَٰذَا إِلَّا سِحْرٌ يُؤْثَرُ (24)"
              "إِنْ هَٰذَا إِلَّا قَوْلُ الْبَشَرِ (25)"
              "سَأُصْلِيهِ سَقَرَ (26)"
              "وَمَا أَدْرَاكَ مَا سَقَرُ (27)"
              "لَا تُبْقِي وَلَا تَذَرُ (28)"
              "لَوَّاحَةٌ لِّلْبَشَرِ (29)"
              "عَلَيْهَا تِسْعَةَ عَشَرَ (30)"
              "وَمَا جَعَلْنَا أَصْحَابَ النَّارِ إِلَّا مَلَائِكَةً وَمَا جَعَلْنَا عِدَّتَهُمْ إِلَّا فِتْنَةً لِّلَّذِينَ كَفَرُوا لِيَسْتَيْقِنَ الَّذِينَ أُوتُوا الْكِتَابَ وَيَزْدَادَ الَّذِينَ آمَنُوا إِيمَانًا وَلَا يَرْتَابَ الَّذِينَ أُوتُوا الْكِتَابَ وَالْمُؤْمِنُونَ وَلِيَقُولَ الَّذِينَ فِي قُلُوبِهِم مَّرَضٌ وَالْكَافِرُونَ مَاذَا أَرَادَ اللَّهُ بِهَٰذَا مَثَلًا كَذَٰلِكَ يُضِلُّ اللَّهُ مَن يَشَاءُ وَيَهْدِي مَن يَشَاءُ وَمَا يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ وَمَا هِيَ إِلَّا ذِكْرَىٰ لِلْبَشَرِ (31)",
        ],
      ),
      Werd(
        werdFromTo: '32-56',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "كَلَّا وَالْقَمَرِ (32)"
              "وَاللَّيْلِ إِذْ أَدْبَرَ (33)"
              "وَالصُّبْحِ إِذَا أَسْفَرَ (34)"
              "إِنَّهَا لَإِحْدَى الْكُبَرِ (35)"
              "نَذِيرًا لِّلْبَشَرِ (36)"
              "لِمَن شَاءَ مِنكُمْ أَن يَتَقَدَّمَ أَوْ يَتَأَخَّرَ (37)"
              "كُلُّ نَفْسٍ بِمَا كَسَبَتْ رَهِينَةٌ (38)"
              "إِلَّا أَصْحَابَ الْيَمِينِ (39)"
              "فِي جَنَّاتٍ يَتَسَاءَلُونَ (40)"
              "عَنِ الْمُجْرِمِينَ (41)"
              "مَا سَلَكَكُمْ فِي سَقَرَ (42)"
              "قَالُوا لَمْ نَكُ مِنَ الْمُصَلِّينَ (43)"
              "وَلَمْ نَكُ نُطْعِمُ الْمِسْكِينَ (44)"
              "وَكُنَّا نَخُوضُ مَعَ الْخَائِضِينَ (45)"
              "وَكُنَّا نُكَذِّبُ بِيَوْمِ الدِّينِ (46)"
              "حَتَّىٰ أَتَانَا الْيَقِينُ (47)"
              "فَمَا تَنفَعُهُمْ شَفَاعَةُ الشَّافِعِينَ (48)"
              "فَمَا لَهُمْ عَنِ التَّذْكِرَةِ مُعْرِضِينَ (49)"
              "كَأَنَّهُمْ حُمُرٌ مُّسْتَنفِرَةٌ (50)"
              "فَرَّتْ مِن قَسْوَرَةٍ (51)"
              "بَلْ يُرِيدُ كُلُّ امْرِئٍ مِّنْهُمْ أَن يُؤْتَىٰ صُحُفًا مُّنَشَّرَةً (52)"
              "كَلَّا بَل لَّا يَخَافُونَ الْآخِرَةَ (53)"
              "كَلَّا إِنَّهُ تَذْكِرَةٌ (54)"
              "فَمَن شَاءَ ذَكَرَهُ (55)"
              "وَمَا يَذْكُرُونَ إِلَّا أَن يَشَاءَ اللَّهُ هُوَ أَهْلُ التَّقْوَىٰ وَأَهْلُ الْمَغْفِرَةِ (56)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "القيامة",
    surahNumber: 75,
    werd: [
      Werd(
        werdFromTo: '1-19',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "لَا أُقْسِمُ بِيَوْمِ الْقِيَامَةِ (1)"
              "وَلَا أُقْسِمُ بِالنَّفْسِ اللَّوَّامَةِ (2)"
              "أَيَحْسَبُ الْإِنسَانُ أَلَّن نَّجْمَعَ عِظَامَهُ (3)"
              "بَلَىٰ قَادِرِينَ عَلَىٰ أَن نُّسَوِّيَ بَنَانَهُ (4)"
              "بَلْ يُرِيدُ الْإِنسَانُ لِيَفْجُرَ أَمَامَهُ (5)"
              "يَسْأَلُ أَيَّانَ يَوْمُ الْقِيَامَةِ (6)"
              "فَإِذَا بَرِقَ الْبَصَرُ (7)"
              "وَخَسَفَ الْقَمَرُ (8)"
              "وَجُمِعَ الشَّمْسُ وَالْقَمَرُ (9)"
              "يَقُولُ الْإِنسَانُ يَوْمَئِذٍ أَيْنَ الْمَفَرُّ (10)"
              "كَلَّا لَا وَزَرَ (11)"
              "إِلَىٰ رَبِّكَ يَوْمَئِذٍ الْمُسْتَقَرُّ (12)"
              "يُنَبَّأُ الْإِنسَانُ يَوْمَئِذٍ بِمَا قَدَّمَ وَأَخَّرَ (13)"
              "بَلِ الْإِنسَانُ عَلَىٰ نَفْسِهِ بَصِيرَةٌ (14)"
              "وَلَوْ أَلْقَىٰ مَعَاذِيرَهُ (15)"
              "لَا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ (16)"
              "إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ (17)"
              "فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ (18)"
              "ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ (19)",
        ],
      ),
      Werd(
        werdFromTo: '20-40',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "كَلَّا بَلْ تُحِبُّونَ الْعَاجِلَةَ (20)"
              "وَتَذَرُونَ الْآخِرَةَ (21)"
              "وُجُوهٌ يَوْمَئِذٍ نَّاضِرَةٌ (22)"
              "إِلَىٰ رَبِّهَا نَاظِرَةٌ (23)"
              "وَوُجُوهٌ يَوْمَئِذٍ بَاسِرَةٌ (24)"
              "تَظُنُّ أَن يُفْعَلَ بِهَا فَاقِرَةٌ (25)"
              "كَلَّا إِذَا بَلَغَتِ التَّرَاقِيَ (26)"
              "وَقِيلَ مَنْ رَاقٍ (27)"
              "وَظَنَّ أَنَّهُ الْفِرَاقُ (28)"
              "وَالْتَفَّتِ السَّاقُ بِالسَّاقِ (29)"
              "إِلَىٰ رَبِّكَ يَوْمَئِذٍ الْمَسَاقُ (30)"
              "فَلَا صَدَّقَ وَلَا صَلَّىٰ (31)"
              "وَلَٰكِن كَذَّبَ وَتَوَلَّىٰ (32)"
              "ثُمَّ ذَهَبَ إِلَىٰ أَهْلِهِ يَتَمَطَّىٰ (33)"
              "أَوْلَىٰ لَكَ فَأَوْلَىٰ (34)"
              "ثُمَّ أَوْلَىٰ لَكَ فَأَوْلَىٰ (35)"
              "أَيَحْسَبُ الْإِنسَانُ أَن يُتْرَكَ سُدًى (36)"
              "أَلَمْ يَكُ نُطْفَةً مِّن مَّنِيٍّ يُمْنَىٰ (37)"
              "ثُمَّ كَانَ عَلَقَةً فَخَلَقَ فَسَوَّىٰ (38)"
              "فَجَعَلَ مِنْهُ الزَّوْجَيْنِ الذَّكَرَ وَالْأُنثَىٰ (39)"
              "أَلَيْسَ ذَٰلِكَ بِقَادِرٍ عَلَىٰ أَن يُحْيِيَ الْمَوْتَىٰ (40)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الانسان",
    surahNumber: 76,
    werd: [
      Werd(
        werdFromTo: '1-4',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "هَلْ أَتَىٰ عَلَى الْإِنسَانِ حِينٌ مِّنَ الدَّهْرِ لَمْ يَكُن شَيْئًا مَّذْكُورًا (1)"
              "إِنَّا خَلَقْنَا الْإِنسَانَ مِن نُّطْفَةٍ أَمْشَاجٍ نَّبْتَلِيهِ فَجَعَلْنَاهُ سَمِيعًا بَصِيرًا (2)"
              "إِنَّا هَدَيْنَاهُ السَّبِيلَ إِمَّا شَاكِرًا وَإِمَّا كَفُورًا (3)"
              "إِنَّا أَعْتَدْنَا لِلْكَافِرِينَ سَلَاسِلَ وَأَغْلَالًا وَسَعِيرًا (4)",
        ],
      ),
      Werd(
        werdFromTo: '5-18',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ الْأَبْرَارَ يَشْرَبُونَ مِن كَأْسٍ كَانَ مِزَاجُهَا كَافُورًا (5)"
              "عَيْنًا يَشْرَبُ بِهَا عِبَادُ اللَّهِ يُفَجِّرُونَهَا تَفْجِيرًا (6)"
              "يُوفُونَ بِالنَّذْرِ وَيَخَافُونَ يَوْمًا كَانَ شَرُّهُ مُسْتَطِيرًا (7)"
              "وَيُطْعِمُونَ الطَّعَامَ عَلَىٰ حُبِّهِ مِسْكِينًا وَيَتِيمًا وَأَسِيرًا (8)"
              "إِنَّمَا نُطْعِمُكُمْ لِوَجْهِ اللَّهِ لَا نُرِيدُ مِنكُمْ جَزَاءً وَلَا شُكُورًا (9)"
              "إِنَّا نَخَافُ مِن رَّبِّنَا يَوْمًا عَبُوسًا قَمْطَرِيرًا (10)"
              "فَوَقَاهُمُ اللَّهُ شَرَّ ذَٰلِكَ الْيَوْمِ وَلَقَّاهُمْ نَضْرَةً وَسُرُورًا (11)"
              "وَجَزَاهُم بِمَا صَبَرُوا جَنَّةً وَحَرِيرًا (12)"
              "مُتَّكِئِينَ فِيهَا عَلَى الْأَرَائِكِ لَا يَرَوْنَ فِيهَا شَمْسًا وَلَا زَمْهَرِيرًا (13)"
              "وَدَانِيَةً عَلَيْهِمْ ظِلَالُهَا وَذُلِّلَتْ قُطُوفُهَا تَذْلِيلًا (14)"
              "وَيُطَافُ عَلَيْهِم بِآنِيَةٍ مِّن فِضَّةٍ وَأَكْوَابٍ كَانَتْ قَوَارِيرَا (15)"
              "قَوَارِيرَ مِن فِضَّةٍ قَدَّرُوهَا تَقْدِيرًا (16)"
              "وَيُسْقَوْنَ فِيهَا كَأْسًا كَانَ مِزَاجُهَا زَنجَبِيلًا (17)"
              "عَيْنًا فِيهَا تُسَمَّىٰ سَلْسَبِيلًا (18)",
        ],
      ),
      Werd(
        werdFromTo: '19-22',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَيَطُوفُ عَلَيْهِمْ وِلْدَانٌ مُّخَلَّدُونَ إِذَا رَأَيْتَهُمْ حَسِبْتَهُمْ لُؤْلُؤًا مَّنثُورًا (19)"
              "وَإِذَا رَأَيْتَ ثَمَّ رَأَيْتَ نَعِيمًا وَمُلْكًا كَبِيرًا (20)"
              "عَالِيَهُمْ ثِيَابُ سُندُسٍ خُضْرٌ وَإِسْتَبْرَقٌ وَحُلُّوا أَسَاوِرَ مِن فِضَّةٍ وَسَقَاهُمْ رَبُّهُمْ شَرَابًا طَهُورًا (21)"
              "إِنَّ هَٰذَا كَانَ لَكُمْ جَزَاءً وَكَانَ سَعْيُكُم مَّشْكُورًا (22)",
        ],
      ),
      Werd(
        werdFromTo: '23-31',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّا نَحْنُ نَزَّلْنَا عَلَيْكَ الْقُرْآنَ تَنزِيلًا (23)"
              "فَاصْبِرْ لِحُكْمِ رَبِّكَ وَلَا تُطِعْ مِنْهُمْ آثِمًا أَوْ كَفُورًا (24)"
              "وَاذْكُرِ اسْمَ رَبِّكَ بُكْرَةً وَأَصِيلًا (25)"
              "وَمِنَ اللَّيْلِ فَاسْجُدْ لَهُ وَسَبِّحْهُ لَيْلًا طَوِيلًا (26)"
              "إِنَّ هَٰؤُلَاءِ يُحِبُّونَ الْعَاجِلَةَ وَيَذَرُونَ وَرَاءَهُمْ يَوْمًا ثَقِيلًا (27)"
              "نَحْنُ خَلَقْنَاهُمْ وَشَدَدْنَا أَسْرَهُمْ وَإِذَا شِئْنَا بَدَّلْنَا أَمْثَالَهُمْ تَبْدِيلًا (28)"
              "إِنَّ هَٰذِهِ تَذْكِرَةٌ فَمَن شَاءَ اتَّخَذَ إِلَىٰ رَبِّهِ سَبِيلًا (29)"
              "وَمَا تَشَاءُونَ إِلَّا أَن يَشَاءَ اللَّهُ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا (30)"
              "يُدْخِلُ مَن يَشَاءُ فِي رَحْمَتِهِ وَالظَّالِمِينَ أَعَدَّ لَهُمْ عَذَابًا أَلِيمًا (31)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "المرسلات",
    surahNumber: 77,
    werd: [
      Werd(
        werdFromTo: '1-15',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَالْمُرْسَلَاتِ عُرْفًا (1)"
              "فَالْعَاصِفَاتِ عَصْفًا (2)"
              "وَالنَّاشِرَاتِ نَشْرًا (3)"
              "فَالْفَارِقَاتِ فَرْقًا (4)"
              "فَالْمُلْقِيَاتِ ذِكْرًا (5)"
              "عُذْرًا أَوْ نُذْرًا (6)"
              "إِنَّمَا تُوعَدُونَ لَوَاقِعٌ (7)"
              "فَإِذَا النُّجُومُ طُمِسَتْ (8)"
              "وَإِذَا السَّمَاءُ فُرِجَتْ (9)"
              "وَإِذَا الْجِبَالُ نُسِفَتْ (10)"
              "وَإِذَا الرُّسُلُ أُقِّتَتْ (11)"
              "لِأَيِّ يَوْمٍ أُجِّلَتْ (12)"
              "لِيَوْمِ الْفَصْلِ (13)"
              "وَمَا أَدْرَاكَ مَا يَوْمُ الْفَصْلِ (14)"
              "وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ (15)",
        ],
      ),
      Werd(
        werdFromTo: '16-28',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَلَمْ نُهْلِكِ الْأَوَّلِينَ (16)"
              "ثُمَّ نُتْبِعُهُمُ الْآخِرِينَ (17)"
              "كَذَٰلِكَ نَفْعَلُ بِالْمُجْرِمِينَ (18)"
              "وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ (19)"
              "أَلَمْ نَخْلُقكُّم مِّن مَّاءٍ مَّهِينٍ (20)"
              "فَجَعَلْنَاهُ فِي قَرَارٍ مَّكِينٍ (21)"
              "إِلَىٰ قَدَرٍ مَّعْلُومٍ (22)"
              "فَقَدَرْنَا فَنِعْمَ الْقَادِرُونَ (23)"
              "وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ (24)"
              "أَلَمْ نَجْعَلِ الْأَرْضَ كِفَاتًا (25)"
              "أَحْيَاءً وَأَمْوَاتًا (26)"
              "وَجَعَلْنَا فِيهَا رَوَاسِيَ شَامِخَاتٍ وَأَسْقَيْنَاكُم مَّاءً فُرَاتًا (27)"
              "وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ (28)",
        ],
      ),
      Werd(
        werdFromTo: '29-50',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "انطَلِقُوا إِلَىٰ مَا كُنتُم بِهِ تُكَذِّبُونَ (29)"
              "انطَلِقُوا إِلَىٰ ظِلٍّ ذِي ثَلَاثِ شُعَبٍ (30)"
              "لَا ظَلِيلٍ وَلَا يُغْنِي مِنَ اللَّهَبِ (31)"
              "إِنَّهَا تَرْمِي بِشَرَرٍ كَالْقَصْرِ (32)"
              "كَأَنَّهُ جِمَالَتٌ صُفْرٌ (33)"
              "وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ (34)"
              "هَٰذَا يَوْمُ لَا يَنطِقُونَ (35)"
              "وَلَا يُؤْذَنُ لَهُمْ فَيَعْتَذِرُونَ (36)"
              "وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ (37)"
              "هَٰذَا يَوْمُ الْفَصْلِ جَمَعْنَاكُمْ وَالْأَوَّلِينَ (38)"
              "فَإِن كَانَ لَكُمْ كَيْدٌ فَكِيدُونِ (39)"
              "وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ (40)"
              "إِنَّ الْمُتَّقِينَ فِي ظِلَالٍ وَعُيُونٍ (41)"
              "وَفَوَاكِهَ مِمَّا يَشْتَهُونَ (42)"
              "كُلُوا وَاشْرَبُوا هَنِيئًا بِمَا كُنتُمْ تَعْمَلُونَ (43)"
              "إِنَّا كَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ (44)"
              "وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ (45)"
              "كُلُوا وَتَمَتَّعُوا قَلِيلًا إِنَّكُم مُّجْرِمُونَ (46)"
              "وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ (47)"
              "وَإِذَا قِيلَ لَهُمُ ارْكَعُوا لَا يَرْكَعُونَ (48)"
              "وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ (49)"
              "فَبِأَيِّ حَدِيثٍ بَعْدَهُ يُؤْمِنُونَ (50)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "النبا",
    surahNumber: 78,
    werd: [
      Werd(
        werdFromTo: '1-16',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "عَمَّ يَتَسَاءَلُونَ (1)"
              "عَنِ النَّبَإِ الْعَظِيمِ (2)"
              "الَّذِي هُمْ فِيهِ مُخْتَلِفُونَ (3)"
              "كَلَّا سَيَعْلَمُونَ (4)"
              "ثُمَّ كَلَّا سَيَعْلَمُونَ (5)"
              "أَلَمْ نَجْعَلِ الْأَرْضَ مِهَادًا (6)"
              "وَالْجِبَالَ أَوْتَادًا (7)"
              "وَخَلَقْنَاكُمْ أَزْوَاجًا (8)"
              "وَجَعَلْنَا نَوْمَكُمْ سُبَاتًا (9)"
              "وَجَعَلْنَا اللَّيْلَ لِبَاسًا (10)"
              "وَجَعَلْنَا النَّهَارَ مَعَاشًا (11)"
              "وَبَنَيْنَا فَوْقَكُمْ سَبْعًا شِدَادًا (12)"
              "وَجَعَلْنَا سِرَاجًا وَهَّاجًا (13)"
              "وَأَنزَلْنَا مِنَ الْمُعْصِرَاتِ مَاءً ثَجَّاجًا (14)"
              "لِنُخْرِجَ بِهِ حَبًّا وَنَبَاتًا (15)"
              "وَجَنَّاتٍ أَلْفَافًا (16)",
        ],
      ),
      Werd(
        werdFromTo: '17-30',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ يَوْمَ الْفَصْلِ كَانَ مِيقَاتًا (17)"
              "يَوْمَ يُنفَخُ فِي الصُّورِ فَتَأْتُونَ أَفْوَاجًا (18)"
              "وَفُتِحَتِ السَّمَاءُ فَكَانَتْ أَبْوَابًا (19)"
              "وَسُيِّرَتِ الْجِبَالُ فَكَانَتْ سَرَابًا (20)"
              "إِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًا (21)"
              "لِلطَّاغِينَ مَآبًا (22)"
              "لَابِثِينَ فِيهَا أَحْقَابًا (23)"
              "لَا يَذُوقُونَ فِيهَا بَرْدًا وَلَا شَرَابًا (24)"
              "إِلَّا حَمِيمًا وَغَسَّاقًا (25)"
              "جَزَاءً وِفَاقًا (26)"
              "إِنَّهُمْ كَانُوا لَا يَرْجُونَ حِسَابًا (27)"
              "وَكَذَّبُوا بِآيَاتِنَا كِذَّابًا (28)"
              "وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ كِتَابًا (29)"
              "فَذُوقُوا فَلَن نَّزِيدَكُمْ إِلَّا عَذَابًا (30)",
        ],
      ),
      Werd(
        werdFromTo: '31-40',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ لِلْمُتَّقِينَ مَفَازًا (31)"
              "حَدَائِقَ وَأَعْنَابًا (32)"
              "وَكَوَاعِبَ أَتْرَابًا (33)"
              "وَكَأْسًا دِهَاقًا (34)"
              "لَّا يَسْمَعُونَ فِيهَا لَغْوًا وَلَا كِذَّابًا (35)"
              "جَزَاءً مِّن رَّبِّكَ عَطَاءً حِسَابًا (36)"
              "رَّبِّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الرَّحْمَٰنِ لَا يَمْلِكُونَ مِنْهُ خِطَابًا (37)"
              "يَوْمَ يَقُومُ الرُّوحُ وَالْمَلَائِكَةُ صَفًّا لَّا يَتَكَلَّمُونَ إِلَّا مَنْ أَذِنَ لَهُ الرَّحْمَٰنُ وَقَالَ صَوَابًا (38)"
              "ذَٰلِكَ الْيَوْمُ الْحَقُّ فَمَن شَاءَ اتَّخَذَ إِلَىٰ رَبِّهِ مَآبًا (39)"
              "إِنَّا أَنذَرْنَاكُمْ عَذَابًا قَرِيبًا يَوْمَ يَنظُرُ الْمَرْءُ مَا قَدَّمَتْ يَدَاهُ وَيَقُولُ الْكَافِرُ يَا لَيْتَنِي كُنتُ تُرَابًا (40)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "النازعات",
    surahNumber: 79,
    werd: [
      Werd(
        werdFromTo: '1-26',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَالنَّازِعَاتِ غَرْقًا (1)"
              "وَالنَّاشِطَاتِ نَشْطًا (2)"
              "وَالسَّابِحَاتِ سَبْحًا (3)"
              "فَالسَّابِقَاتِ سَبْقًا (4)"
              "فَالْمُدَبِّرَاتِ أَمْرًا (5)"
              "يَوْمَ تَرْجُفُ الرَّاجِفَةُ (6)"
              "تَتْبَعُهَا الرَّادِفَةُ (7)"
              "قُلُوبٌ يَوْمَئِذٍ وَاجِفَةٌ (8)"
              "أَبْصَارُهَا خَاشِعَةٌ (9)"
              "يَقُولُونَ أَئِنَّا لَمَرْدُودُونَ فِي الْحَافِرَةِ (10)"
              "أَئِذَا كُنَّا عِظَامًا نَّخِرَةً (11)"
              "قَالُوا تِلْكَ إِذًا كَرَّةٌ خَاسِرَةٌ (12)"
              "فَإِنَّمَا هِيَ زَجْرَةٌ وَاحِدَةٌ (13)"
              "فَإِذَا هُم بِالسَّاهِرَةِ (14)"
              "هَلْ أَتَىٰكَ حَدِيثُ مُوسَىٰ (15)"
              "إِذْ نَادَاهُ رَبُّهُ بِالْوَادِ الْمُقَدَّسِ طُوًى (16)"
              "اذْهَبْ إِلَىٰ فِرْعَوْنَ إِنَّهُ طَغَىٰ (17)"
              "فَقُلْ هَل لَّكَ إِلَىٰ أَن تَزَكَّىٰ (18)"
              "وَأَهْدِيَكَ إِلَىٰ رَبِّكَ فَتَخْشَىٰ (19)"
              "فَأَرَاهُ الْآيَةَ الْكُبْرَىٰ (20)"
              "فَكَذَّبَ وَعَصَىٰ (21)"
              "ثُمَّ أَدْبَرَ يَسْعَىٰ (22)"
              "فَحَشَرَ فَنَادَىٰ (23)"
              "فَقَالَ أَنَا رَبُّكُمُ الْأَعْلَىٰ (24)"
              "فَأَخَذَهُ اللَّهُ نَكَالَ الْآخِرَةِ وَالْأُولَىٰ (25)"
              "إِنَّ فِي ذَٰلِكَ لَعِبْرَةً لِّمَن يَخْشَىٰ (26)",
        ],
      ),
      Werd(
        werdFromTo: '27-47',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَأَنتُمْ أَشَدُّ خَلْقًا أَمِ السَّمَاءُ بَنَاهَا (27)"
              "رَفَعَ سَمْكَهَا فَسَوَّاهَا (28)"
              "وَأَغْطَشَ لَيْلَهَا وَأَخْرَجَ ضُحَاهَا (29)"
              "وَالْأَرْضَ بَعْدَ ذَٰلِكَ دَحَاهَا (30)"
              "أَخْرَجَ مِنْهَا مَاءَهَا وَمَرْعَاهَا (31)"
              "وَالْجِبَالَ أَرْسَاهَا (32)"
              "مَتَاعًا لَّكُمْ وَلِأَنْعَامِكُمْ (33)"
              "فَإِذَا جَاءَتِ الطَّامَّةُ الْكُبْرَىٰ (34)"
              "يَوْمَ يَتَذَكَّرُ الْإِنسَانُ مَا سَعَىٰ (35)"
              "وَبُرِّزَتِ الْجَحِيمُ لِمَن يَرَىٰ (36)"
              "فَأَمَّا مَن طَغَىٰ (37)"
              "وَآثَرَ الْحَيَاةَ الدُّنْيَا (38)"
              "فَإِنَّ الْجَحِيمَ هِيَ الْمَأْوَىٰ (39)"
              "وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ (40)"
              "فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ (41)"
              "يَسْأَلُونَكَ عَنِ السَّاعَةِ أَيَّانَ مُرْسَاهَا (42)"
              "فِيمَ أَنتَ مِن ذِكْرَاهَا (43)"
              "إِلَىٰ رَبِّكَ مُنتَهَاهَا (44)"
              "إِنَّمَا أَنتَ مُنذِرُ مَن يَخْشَاهَا (45)"
              "كَأَنَّهُمْ يَوْمَ يَرَوْنَهَا لَمْ يَلْبَثُوا إِلَّا عَشِيَّةً أَوْ ضُحَاهَا (46)"
              "فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ فَإِمَّا نُرِيَنَّكَ بَعْضَ الَّذِي نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ فَإِلَيْنَا يُرْجَعُونَ (47)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "عبس",
    surahNumber: 80,
    werd: [
      Werd(
        werdFromTo: '1-10',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "عَبَسَ وَتَوَلَّىٰ (1)"
              "أَن جَاءَهُ الْأَعْمَىٰ (2)"
              "وَمَا يُدْرِيكَ لَعَلَّهُ يَزَّكَّىٰ (3)"
              "أَوْ يَذَّكَّرُ فَتَنفَعَهُ الذِّكْرَىٰ (4)"
              "أَمَّا مَنِ اسْتَغْنَىٰ (5)"
              "فَأَنتَ لَهُ تَصَدَّىٰ (6)"
              "وَمَا عَلَيْكَ أَلَّا يَزَّكَّىٰ (7)"
              "وَأَمَّا مَن جَاءَكَ يَسْعَىٰ (8)"
              "وَهُوَ يَخْشَىٰ (9)"
              "فَأَنتَ عَنْهُ تَلَهَّىٰ (10)",
        ],
      ),
      Werd(
        werdFromTo: '11-32',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "كَلَّا إِنَّهَا تَذْكِرَةٌ (11)"
              "فَمَن شَاءَ ذَكَرَهُ (12)"
              "فِي صُحُفٍ مُّكَرَّمَةٍ (13)"
              "مَّرْفُوعَةٍ مُّطَهَّرَةٍ (14)"
              "بِأَيْدِي سَفَرَةٍ (15)"
              "كِرَامٍ بَرَرَةٍ (16)"
              "قُتِلَ الْإِنسَانُ مَا أَكْفَرَهُ (17)"
              "مِنْ أَيِّ شَيْءٍ خَلَقَهُ (18)"
              "مِن نُّطْفَةٍ خَلَقَهُ فَقَدَّرَهُ (19)"
              "ثُمَّ السَّبِيلَ يَسَّرَهُ (20)"
              "ثُمَّ أَمَاتَهُ فَأَقْبَرَهُ (21)"
              "ثُمَّ إِذَا شَاءَ أَنشَرَهُ (22)"
              "كَلَّا لَمَّا يَقْضِ مَا أَمَرَهُ (23)"
              "فَلْيَنظُرِ الْإِنسَانُ إِلَىٰ طَعَامِهِ (24)"
              "أَنَّا صَبَبْنَا الْمَاءَ صَبًّا (25)"
              "ثُمَّ شَقَقْنَا الْأَرْضَ شَقًّا (26)"
              "فَأَنبَتْنَا فِيهَا حَبًّا (27)"
              "وَعِنَبًا وَقَضْبًا (28)"
              "وَزَيْتُونًا وَنَخْلًا (29)"
              "وَحَدَائِقَ غُلْبًا (30)"
              "وَفَاكِهَةً وَأَبًّا (31)"
              "مَّتَاعًا لَّكُمْ وَلِأَنْعَامِكُمْ (32)",
        ],
      ),
      Werd(
        werdFromTo: '33-42',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "فَإِذَا جَاءَتِ الصَّاخَّةُ (33)"
              "يَوْمَ يَفِرُّ الْمَرْءُ مِنْ أَخِيهِ (34)"
              "وَأُمِّهِ وَأَبِيهِ (35)"
              "وَصَاحِبَتِهِ وَبَنِيهِ (36)"
              "لِكُلِّ امْرِئٍ مِّنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ (37)"
              "وُجُوهٌ يَوْمَئِذٍ مُّسْفِرَةٌ (38)"
              "ضَاحِكَةٌ مُّسْتَبْشِرَةٌ (39)"
              "وَوُجُوهٌ يَوْمَئِذٍ عَلَيْهَا غَبَرَةٌ (40)"
              "تَرْهَقُهَا قَتَرَةٌ (41)"
              "أُولَٰئِكَ هُمُ الْكَفَرَةُ الْفَجَرَةُ (42)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "التكوير",
    surahNumber: 81,
    werd: [
      Werd(
        werdFromTo: '1-14',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِذَا الشَّمْسُ كُوِّرَتْ (1)"
              "وَإِذَا النُّجُومُ انكَدَرَتْ (2)"
              "وَإِذَا الْجِبَالُ سُيِّرَتْ (3)"
              "وَإِذَا الْعِشَارُ عُطِّلَتْ (4)"
              "وَإِذَا الْوُحُوشُ حُشِرَتْ (5)"
              "وَإِذَا الْبِحَارُ سُجِّرَتْ (6)"
              "وَإِذَا النُّفُوسُ زُوِّجَتْ (7)"
              "وَإِذَا الْمَوْءُودَةُ سُئِلَتْ (8)"
              "بِأَيِّ ذَنبٍ قُتِلَتْ (9)"
              "وَإِذَا الصُّحُفُ نُشِرَتْ (10)"
              "وَإِذَا السَّمَاءُ كُشِطَتْ (11)"
              "وَإِذَا الْجَحِيمُ سُعِّرَتْ (12)"
              "وَإِذَا الْجَنَّةُ أُزْلِفَتْ (13)"
              "عَلِمَتْ نَفْسٌ مَّا أَحْضَرَتْ (14)",
        ],
      ),
      Werd(
        werdFromTo: '15-29',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "فَلَا أُقْسِمُ بِالْخُنَّسِ (15)"
              "الْجَوَارِ الْكُنَّسِ (16)"
              "وَاللَّيْلِ إِذَا عَسْعَسَ (17)"
              "وَالصُّبْحِ إِذَا تَنَفَّسَ (18)"
              "إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ (19)"
              "ذِي قُوَّةٍ عِندَ ذِي الْعَرْشِ مَكِينٍ (20)"
              "مُّطَاعٍ ثَمَّ أَمِينٍ (21)"
              "وَمَا صَاحِبُكُم بِمَجْنُونٍ (22)"
              "وَلَقَدْ رَآهُ بِالْأُفُقِ الْمُبِينِ (23)"
              "وَمَا هُوَ عَلَى الْغَيْبِ بِضَنِينٍ (24)"
              "وَمَا هُوَ بِقَوْلِ شَيْطَانٍ رَّجِيمٍ (25)"
              "فَأَيْنَ تَذْهَبُونَ (26)"
              "إِنْ هُوَ إِلَّا ذِكْرٌ لِّلْعَالَمِينَ (27)"
              "لِمَن شَاءَ مِنكُمْ أَن يَسْتَقِيمَ (28)"
              "وَمَا تَشَاءُونَ إِلَّا أَن يَشَاءَ اللَّهُ رَبُّ الْعَالَمِينَ (29)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الانفطار",
    surahNumber: 82,
    werd: [
      Werd(
        werdFromTo: '1-8',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِذَا السَّمَاءُ انفَطَرَتْ (1)"
              "وَإِذَا الْكَوَاكِبُ انتَثَرَتْ (2)"
              "وَإِذَا الْبِحَارُ فُجِّرَتْ (3)"
              "وَإِذَا الْقُبُورُ بُعْثِرَتْ (4)"
              "عَلِمَتْ نَفْسٌ مَّا قَدَّمَتْ وَأَخَّرَتْ (5)"
              "يَا أَيُّهَا الْإِنسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ (6)"
              "الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ (7)"
              "فِي أَيِّ صُورَةٍ مَّا شَاءَ رَكَّبَكَ (8)",
        ],
      ),
      Werd(
        werdFromTo: '9-19',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "كَلَّا بَلْ تُكَذِّبُونَ بِالدِّينِ (9)"
              "وَإِنَّ عَلَيْكُمْ لَحَافِظِينَ (10)"
              "كِرَامًا كَاتِبِينَ (11)"
              "يَعْلَمُونَ مَا تَفْعَلُونَ (12)"
              "إِنَّ الْأَبْرَارَ لَفِي نَعِيمٍ (13)"
              "وَإِنَّ الْفُجَّارَ لَفِي جَحِيمٍ (14)"
              "يَصْلَوْنَهَا يَوْمَ الدِّينِ (15)"
              "وَمَا هُمْ عَنْهَا بِغَائِبِينَ (16)"
              "وَمَا أَدْرَاكَ مَا يَوْمُ الدِّينِ (17)"
              "ثُمَّ مَا أَدْرَاكَ مَا يَوْمُ الدِّينِ (18)"
              "يَوْمَ لَا تَمْلِكُ نَفْسٌ لِّنَفْسٍ شَيْئًا وَالْأَمْرُ يَوْمَئِذٍ لِلَّهِ (19)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "المطففين",
    surahNumber: 83,
    werd: [
      Werd(
        werdFromTo: '1-9',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَيْلٌ لِّلْمُطَفِّفِينَ (1)"
              "الَّذِينَ إِذَا اكْتَالُوا عَلَى النَّاسِ يَسْتَوْفُونَ (2)"
              "وَإِذَا كَالُوهُمْ أَوْ وَزَنُوهُمْ يُخْسِرُونَ (3)"
              "أَلَا يَظُنُّ أُولَٰئِكَ أَنَّهُمْ مَبْعُوثُونَ (4)"
              "لِيَوْمٍ عَظِيمٍ (5)"
              "يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ (6)"
              "كَلَّا إِنَّ كِتَابَ الْفُجَّارِ لَفِي سِجِّينٍ (7)"
              "وَمَا أَدْرَاكَ مَا سِجِّينٌ (8)"
              "كِتَابٌ مَّرْقُومٌ (9)",
        ],
      ),
      Werd(
        werdFromTo: '10-17',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ (10)"
              "الَّذِينَ يُكَذِّبُونَ بِيَوْمِ الدِّينِ (11)"
              "وَمَا يُكَذِّبُ بِهِ إِلَّا كُلُّ مُعْتَدٍ أَثِيمٍ (12)"
              "إِذَا تُتْلَىٰ عَلَيْهِ آيَاتُنَا قَالَ أَسَاطِيرُ الْأَوَّلِينَ (13)"
              "كَلَّا بَلْ رَانَ عَلَىٰ قُلُوبِهِم مَّا كَانُوا يَكْسِبُونَ (14)"
              "كَلَّا إِنَّهُمْ عَن رَّبِّهِمْ يَوْمَئِذٍ لَّمَحْجُوبُونَ (15)"
              "ثُمَّ إِنَّهُمْ لَصَالُو الْجَحِيمِ (16)"
              "ثُمَّ يُقَالُ هَٰذَا الَّذِي كُنتُم بِهِ تُكَذِّبُونَ (17)",
        ],
      ),
      Werd(
        werdFromTo: '18-36',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "كَلَّا إِنَّ كِتَابَ الْأَبْرَارِ لَفِي عِلِّيِّينَ (18)"
              "وَمَا أَدْرَاكَ مَا عِلِّيُّونَ (19)"
              "كِتَابٌ مَّرْقُومٌ (20)"
              "يَشْهَدُهُ الْمُقَرَّبُونَ (21)"
              "إِنَّ الْأَبْرَارَ لَفِي نَعِيمٍ (22)"
              "عَلَى الْأَرَائِكِ يَنظُرُونَ (23)"
              "تَعْرِفُ فِي وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ (24)"
              "يُسْقَوْنَ مِن رَّحِيقٍ مَّخْتُومٍ (25)"
              "خِتَامُهُ مِسْكٌ وَفِي ذَٰلِكَ فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ (26)"
              "وَمِزَاجُهُ مِن تَسْنِيمٍ (27)"
              "عَيْنًا يَشْرَبُ بِهَا الْمُقَرَّبُونَ (28)"
              "إِنَّ الَّذِينَ أَجْرَمُوا كَانُوا مِنَ الَّذِينَ آمَنُوا يَضْحَكُونَ (29)"
              "وَإِذَا مَرُّوا بِهِمْ يَتَغَامَزُونَ (30)"
              "وَإِذَا انقَلَبُوا إِلَىٰ أَهْلِهِمُ انقَلَبُوا فَكِهِينَ (31)"
              "وَإِذَا رَأَوْهُمْ قَالُوا إِنَّ هَٰؤُلَاءِ لَضَالُّونَ (32)"
              "وَمَا أُرْسِلُوا عَلَيْهِمْ حَافِظِينَ (33)"
              "فَالْيَوْمَ الَّذِينَ آمَنُوا مِنَ الْكُفَّارِ يَضْحَكُونَ (34)"
              "عَلَى الْأَرَائِكِ يَنظُرُونَ (35)"
              "هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوا يَفْعَلُونَ (36)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الانشقاق",
    surahNumber: 84,
    werd: [
      Werd(
        werdFromTo: '1-9',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِذَا السَّمَاءُ انشَقَّتْ (1)"
              "وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ (2)"
              "وَإِذَا الْأَرْضُ مُدَّتْ (3)"
              "وَأَلْقَتْ مَا فِيهَا وَتَخَلَّتْ (4)"
              "وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ (5)"
              "يَا أَيُّهَا الْإِنسَانُ إِنَّكَ كَادِحٌ إِلَىٰ رَبِّكَ كَدْحًا فَمُلَاقِيهِ (6)"
              "فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ (7)"
              "فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا (8)"
              "وَيَنقَلِبُ إِلَىٰ أَهْلِهِ مَسْرُورًا (9)",
        ],
      ),
      Werd(
        werdFromTo: '10-21',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَأَمَّا مَنْ أُوتِيَ كِتَابَهُ وَرَاءَ ظَهْرِهِ (10)"
              "فَسَوْفَ يَدْعُو ثُبُورًا (11)"
              "وَيَصْلَىٰ سَعِيرًا (12)"
              "إِنَّهُ كَانَ فِي أَهْلِهِ مَسْرُورًا (13)"
              "إِنَّهُ ظَنَّ أَن لَّن يَحُورَ (14)"
              "بَلَىٰ إِنَّ رَبَّهُ كَانَ بِهِ بَصِيرًا (15)"
              "فَلَا أُقْسِمُ بِالشَّفَقِ (16)"
              "وَاللَّيْلِ وَمَا وَسَقَ (17)"
              "وَالْقَمَرِ إِذَا اتَّسَقَ (18)"
              "لَتَرْكَبُنَّ طَبَقًا عَن طَبَقٍ (19)"
              "فَمَا لَهُمْ لَا يُؤْمِنُونَ (20)"
              "وَإِذَا قُرِئَ عَلَيْهِمُ الْقُرْآنُ لَا يَسْجُدُونَ (21)",
        ],
      ),
      Werd(
        werdFromTo: '22-25',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "بَلِ الَّذِينَ كَفَرُوا يُكَذِّبُونَ (22)"
              "وَاللَّهُ أَعْلَمُ بِمَا يُوعُونَ (23)"
              "فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ (24)"
              "إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ (25)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "البروج",
    surahNumber: 85,
    werd: [
      Werd(
        werdFromTo: '1-9',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَالسَّمَاءِ ذَاتِ الْبُرُوجِ (1)"
              "وَالْيَوْمِ الْمَوْعُودِ (2)"
              "وَشَاهِدٍ وَمَشْهُودٍ (3)"
              "قُتِلَ أَصْحَابُ الْأُخْدُودِ (4)"
              "النَّارِ ذَاتِ الْوَقُودِ (5)"
              "إِذْ هُمْ عَلَيْهَا قُعُودٌ (6)"
              "وَهُمْ عَلَىٰ مَا يَفْعَلُونَ بِالْمُؤْمِنِينَ شُهُودٌ (7)"
              "وَمَا نَقَمُوا مِنْهُمْ إِلَّا أَن يُؤْمِنُوا بِاللَّهِ الْعَزِيزِ الْحَمِيدِ (8)"
              "الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ (9)",
        ],
      ),
      Werd(
        werdFromTo: '10-22',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّ الَّذِينَ فَتَنُوا الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ثُمَّ لَمْ يَتُوبُوا فَلَهُمْ عَذَابُ جَهَنَّمَ وَلَهُمْ عَذَابُ الْحَرِيقِ (10)"
              "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ذَٰلِكَ الْفَوْزُ الْكَبِيرُ (11)"
              "إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ (12)"
              "إِنَّهُ هُوَ يُبْدِئُ وَيُعِيدُ (13)"
              "وَهُوَ الْغَفُورُ الْوَدُودُ (14)"
              "ذُو الْعَرْشِ الْمَجِيدُ (15)"
              "فَعَّالٌ لِّمَا يُرِيدُ (16)"
              "هَلْ أَتَاكَ حَدِيثُ الْجُنُودِ (17)"
              "فِرْعَوْنَ وَثَمُودَ (18)"
              "بَلِ الَّذِينَ كَفَرُوا فِي تَكْذِيبٍ (19)"
              "وَاللَّهُ مِن وَرَائِهِم مُّحِيطٌ (20)"
              "بَلْ هُوَ قُرْآنٌ مَّجِيدٌ (21)"
              "فِي لَوْحٍ مَّحْفُوظٍ (22)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الطارق",
    surahNumber: 86,
    werd: [
      Werd(
        werdFromTo: '1-17',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَالسَّمَاءِ وَالطَّارِقِ (1)"
              "وَمَا أَدْرَاكَ مَا الطَّارِقُ (2)"
              "النَّجْمُ الثَّاقِبُ (3)"
              "إِن كُلُّ نَفْسٍ لَّمَّا عَلَيْهَا حَافِظٌ (4)"
              "فَلْيَنظُرِ الْإِنسَانُ مِمَّ خُلِقَ (5)"
              "خُلِقَ مِن مَّاءٍ دَافِقٍ (6)"
              "يَخْرُجُ مِن بَيْنِ الصُّلْبِ وَالتَّرَائِبِ (7)"
              "إِنَّهُ عَلَىٰ رَجْعِهِ لَقَادِرٌ (8)"
              "يَوْمَ تُبْلَى السَّرَائِرُ (9)"
              "فَمَا لَهُ مِن قُوَّةٍ وَلَا نَاصِرٍ (10)"
              "وَالسَّمَاءِ ذَاتِ الرَّجْعِ (11)"
              "وَالْأَرْضِ ذَاتِ الصَّدْعِ (12)"
              "إِنَّهُ لَقَوْلٌ فَصْلٌ (13)"
              "وَمَا هُوَ بِالْهَزْلِ (14)"
              "إِنَّهُمْ يَكِيدُونَ كَيْدًا (15)"
              "وَأَكِيدُ كَيْدًا (16)"
              "فَمَهِّلِ الْكَافِرِينَ أَمْهِلْهُمْ رُوَيْدًا (17)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الاعلى",
    surahNumber: 87,
    werd: [
      Werd(
        werdFromTo: '1-19',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى (1)"
              "الَّذِي خَلَقَ فَسَوَّىٰ (2)"
              "وَالَّذِي قَدَّرَ فَهَدَىٰ (3)"
              "وَالَّذِي أَخْرَجَ الْمَرْعَىٰ (4)"
              "فَجَعَلَهُ غُثَاءً أَحْوَىٰ (5)"
              "سَنُقْرِئُكَ فَلَا تَنسَىٰ (6)"
              "إِلَّا مَا شَاءَ اللَّهُ إِنَّهُ يَعْلَمُ الْجَهْرَ وَمَا يَخْفَىٰ (7)"
              "وَنُيَسِّرُكَ لِلْيُسْرَىٰ (8)"
              "فَذَكِّرْ إِن نَّفَعَتِ الذِّكْرَىٰ (9)"
              "سَيَذَّكَّرُ مَن يَخْشَىٰ (10)"
              "وَيَتَجَنَّبُهَا الْأَشْقَى (11)"
              "الَّذِي يَصْلَى النَّارَ الْكُبْرَىٰ (12)"
              "ثُمَّ لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ (13)"
              "قَدْ أَفْلَحَ مَن تَزَكَّىٰ (14)"
              "وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّىٰ (15)"
              "بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا (16)"
              "وَالْآخِرَةُ خَيْرٌ وَأَبْقَىٰ (17)"
              "إِنَّ هَٰذَا لَفِي الصُّحُفِ الْأُولَىٰ (18)"
              "صُحُفِ إِبْرَاهِيمَ وَمُوسَىٰ (19)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الغاشية",
    surahNumber: 88,
    werd: [
      Werd(
        werdFromTo: '1-26',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ (1)"
              "وُجُوهٌ يَوْمَئِذٍ خَاشِعَةٌ (2)"
              "عَامِلَةٌ نَّاصِبَةٌ (3)"
              "تَصْلَىٰ نَارًا حَامِيَةً (4)"
              "تُسْقَىٰ مِنْ عَيْنٍ آنِيَةٍ (5)"
              "لَّيْسَ لَهُمْ طَعَامٌ إِلَّا مِن ضَرِيعٍ (6)"
              "لَّا يُسْمِنُ وَلَا يُغْنِي مِن جُوعٍ (7)"
              "وُجُوهٌ يَوْمَئِذٍ نَّاعِمَةٌ (8)"
              "لِّسَعْيِهَا رَاضِيَةٌ (9)"
              "فِي جَنَّةٍ عَالِيَةٍ (10)"
              "لَّا تَسْمَعُ فِيهَا لَاغِيَةً (11)"
              "فِيهَا عَيْنٌ جَارِيَةٌ (12)"
              "فِيهَا سُرُرٌ مَّرْفُوعَةٌ (13)"
              "وَأَكْوَابٌ مَّوْضُوعَةٌ (14)"
              "وَنَمَارِقُ مَصْفُوفَةٌ (15)"
              "وَزَرَابِيُّ مَبْثُوثَةٌ (16)"
              "أَفَلَا يَنظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ (17)"
              "وَإِلَى السَّمَاءِ كَيْفَ رُفِعَتْ (18)"
              "وَإِلَى الْجِبَالِ كَيْفَ نُصِبَتْ (19)"
              "وَإِلَى الْأَرْضِ كَيْفَ سُطِحَتْ (20)"
              "فَذَكِّرْ إِنَّمَا أَنتَ مُذَكِّرٌ (21)"
              "لَّسْتَ عَلَيْهِم بِمُصَيْطِرٍ (22)"
              "إِلَّا مَن تَوَلَّىٰ وَكَفَرَ (23)"
              "فَيُعَذِّبُهُ اللَّهُ الْعَذَابَ الْأَكْبَرَ (24)"
              "إِنَّ إِلَيْنَا إِيَابَهُمْ (25)"
              "ثُمَّ إِنَّ عَلَيْنَا حِسَابَهُمْ (26)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الفجر",
    surahNumber: 89,
    werd: [
      Werd(
        werdFromTo: '1-16',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَالْفَجْرِ (1)"
              "وَلَيَالٍ عَشْرٍ (2)"
              "وَالشَّفْعِ وَالْوَتْرِ (3)"
              "وَاللَّيْلِ إِذَا يَسْرِ (4)"
              "هَلْ فِي ذَٰلِكَ قَسَمٌ لِّذِي حِجْرٍ (5)"
              "أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِعَادٍ (6)"
              "إِرَمَ ذَاتِ الْعِمَادِ (7)"
              "الَّتِي لَمْ يُخْلَقْ مِثْلُهَا فِي الْبِلَادِ (8)"
              "وَثَمُودَ الَّذِينَ جَابُوا الصَّخْرَ بِالْوَادِ (9)"
              "وَفِرْعَوْنَ ذِي الْأَوْتَادِ (10)"
              "الَّذِينَ طَغَوْا فِي الْبِلَادِ (11)"
              "فَأَكْثَرُوا فِيهَا الْفَسَادَ (12)"
              "فَصَبَّ عَلَيْهِمْ رَبُّكَ سَوْطَ عَذَابٍ (13)"
              "إِنَّ رَبَّكَ لَبِالْمِرْصَادِ (14)"
              "فَأَمَّا الْإِنسَانُ إِذَا مَا ابْتَلَاهُ رَبُّهُ فَأَكْرَمَهُ وَنَعَّمَهُ فَيَقُولُ رَبِّي أَكْرَمَنِ (15)"
              "وَأَمَّا إِذَا مَا ابْتَلَاهُ فَقَدَرَ عَلَيْهِ رِزْقَهُ فَيَقُولُ رَبِّي أَهَانَنِ (16)",
        ],
      ),
      Werd(
        werdFromTo: '17-30',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "كَلَّا بَل لَّا تُكْرِمُونَ الْيَتِيمَ (17)"
              "وَلَا تَحَاضُّونَ عَلَىٰ طَعَامِ الْمِسْكِينِ (18)"
              "وَتَأْكُلُونَ التُّرَاثَ أَكْلًا لَّمًّا (19)"
              "وَتُحِبُّونَ الْمَالَ حُبًّا جَمًّا (20)"
              "كَلَّا إِذَا دُكَّتِ الْأَرْضُ دَكًّا دَكًّا (21)"
              "وَجَاءَ رَبُّكَ وَالْمَلَكُ صَفًّا صَفًّا (22)"
              "وَجِيءَ يَوْمَئِذٍ بِجَهَنَّمَ يَوْمَئِذٍ يَتَذَكَّرُ الْإِنسَانُ وَأَنَّىٰ لَهُ الذِّكْرَىٰ (23)"
              "يَقُولُ يَا لَيْتَنِي قَدَّمْتُ لِحَيَاتِي (24)"
              "فَيَوْمَئِذٍ لَّا يُعَذِّبُ عَذَابَهُ أَحَدٌ (25)"
              "وَلَا يُوثِقُ وَثَاقَهُ أَحَدٌ (26)"
              "يَا أَيَّتُهَا النَّفْسُ الْمُطْمَئِنَّةُ (27)"
              "ارْجِعِي إِلَىٰ رَبِّكِ رَاضِيَةً مَّرْضِيَّةً (28)"
              "فَادْخُلِي فِي عِبَادِي (29)"
              "وَادْخُلِي جَنَّتِي (30)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "البلد",
    surahNumber: 90,
    werd: [
      Werd(
        werdFromTo: '1-20',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "لَا أُقْسِمُ بِهَٰذَا الْبَلَدِ (1) وَأَنتَ حِلٌّ بِهَٰذَا الْبَلَدِ (2) وَوَالِدٍ وَمَا وَلَدَ (3) لَقَدْ خَلَقْنَا الْإِنسَانَ فِي كَبَدٍ (4) أَيَحْسَبُ أَن لَّن يَقْدِرَ عَلَيْهِ أَحَدٌ (5) يَقُولُ أَهْلَكْتُ مَالًا لُّبَدًا (6) أَيَحْسَبُ أَن لَّمْ يَرَهُ أَحَدٌ (7) أَلَمْ نَجْعَل لَّهُ عَيْنَيْنِ (8) وَلِسَانًا وَشَفَتَيْنِ (9) وَهَدَيْنَاهُ النَّجْدَيْنِ (10) فَلَا اقْتَحَمَ الْعَقَبَةَ (11) وَمَا أَدْرَاكَ مَا الْعَقَبَةُ (12) فَكُّ رَقَبَةٍ (13) أَوْ إِطْعَامٌ فِي يَوْمٍ ذِي مَسْغَبَةٍ (14) يَتِيمًا ذَا مَقْرَبَةٍ (15) أَوْ مِسْكِينًا ذَا مَتْرَبَةٍ (16) ثُمَّ كَانَ مِنَ الَّذِينَ آمَنُوا وَتَوَاصَوْا بِالصَّبْرِ وَتَوَاصَوْا بِالْمَرْحَمَةِ (17) أُولَٰئِكَ أَصْحَابُ الْمَيْمَنَةِ (18) وَالَّذِينَ كَفَرُوا بِآيَاتِنَا هُمْ أَصْحَابُ الْمَشْأَمَةِ (19) عَلَيْهِمْ نَارٌ مُّؤْصَدَةٌ (20)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الشمس",
    surahNumber: 91,
    werd: [
      Werd(
        werdFromTo: '1-15',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَالشَّمْسِ وَضُحَاهَا (1) وَالْقَمَرِ إِذَا تَلَاهَا (2) وَالنَّهَارِ إِذَا جَلَّاهَا (3) وَاللَّيْلِ إِذَا يَغْشَاهَا (4) وَالسَّمَاءِ وَمَا بَنَاهَا (5) وَالْأَرْضِ وَمَا طَحَاهَا (6) وَنَفْسٍ وَمَا سَوَّاهَا (7) فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا (8) قَدْ أَفْلَحَ مَن زَكَّاهَا (9) وَقَدْ خَابَ مَن دَسَّاهَا (10) كَذَّبَتْ ثَمُودُ بِطَغْوَاهَا (11) إِذِ انبَعَثَ أَشْقَاهَا (12) فَقَالَ لَهُمْ رَسُولُ اللَّهِ نَاقَةَ اللَّهِ وَسُقْيَاهَا (13) فَكَذَّبُوهُ فَعَقَرُوهَا فَدَمْدَمَ عَلَيْهِمْ رَبُّهُم بِذَنبِهِمْ فَسَوَّاهَا (14) وَلَا يَخَافُ عُقْبَاهَا (15)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الليل",
    surahNumber: 92,
    werd: [
      Werd(
        werdFromTo: '1-21',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَاللَّيْلِ إِذَا يَغْشَىٰ (1) وَالنَّهَارِ إِذَا تَجَلَّىٰ (2) وَمَا خَلَقَ الذَّكَرَ وَالْأُنثَىٰ (3) إِنَّ سَعْيَكُمْ لَشَتَّىٰ (4) فَأَمَّا مَن أَعْطَىٰ وَاتَّقَىٰ (5) وَصَدَّقَ بِالْحُسْنَىٰ (6) فَسَنُيَسِّرُهُ لِلْيُسْرَىٰ (7) وَأَمَّا مَن بَخِلَ وَاسْتَغْنَىٰ (8) وَكَذَّبَ بِالْحُسْنَىٰ (9) فَسَنُيَسِّرُهُ لِلْعُسْرَىٰ (10) وَمَا يُغْنِي عَنْهُ مَالُهُ إِذَا تَرَدَّىٰ (11) إِنَّ عَلَيْنَا لَلْهُدَىٰ (12) وَإِنَّ لَنَا لَلْآخِرَةَ وَالْأُولَىٰ (13) فَأَنذَرْتُكُمْ نَارًا تَلَظَّىٰ (14) لَا يَصْلَاهَا إِلَّا الْأَشْقَى (15) الَّذِي كَذَّبَ وَتَوَلَّىٰ (16) وَسَيُجَنَّبُهَا الْأَتْقَى (17) الَّذِي يُؤْتِي مَالَهُ يَتَزَكَّىٰ (18) وَمَا لِأَحَدٍ عِندَهُ مِن نِّعْمَةٍ تُجْزَىٰ (19) إِلَّا ابْتِغَاءَ وَجْهِ رَبِّهِ الْأَعْلَىٰ (20) وَلَسَوْفَ يَرْضَىٰ (21)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الضحى",
    surahNumber: 93,
    werd: [
      Werd(
        werdFromTo: '1-11',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَالضُّحَىٰ (1) وَاللَّيْلِ إِذَا سَجَىٰ (2) مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ (3) وَلَلْآخِرَةُ خَيْرٌ لَّكَ مِنَ الْأُولَىٰ (4) وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ (5) أَلَمْ يَجِدْكَ يَتِيمًا فَآوَىٰ (6) وَوَجَدَكَ ضَالًّا فَهَدَىٰ (7) وَوَجَدَكَ عَائِلًا فَأَغْنَىٰ (8) فَأَمَّا الْيَتِيمَ فَلَا تَقْهَرْ (9) وَأَمَّا السَّائِلَ فَلَا تَنْهَرْ (10) وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ (11)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الشرح",
    surahNumber: 94,
    werd: [
      Werd(
        werdFromTo: '1-18',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ (1) وَوَضَعْنَا عَنكَ وِزْرَكَ (2) الَّذِي أَنقَضَ ظَهْرَكَ (3) وَرَفَعْنَا لَكَ ذِكْرَكَ (4) فَإِنَّ مَعَ الْعُسْرِ يُسْرًا (5) إِنَّ مَعَ الْعُسْرِ يُسْرًا (6) فَإِذَا فَرَغْتَ فَانصَبْ (7) وَإِلَىٰ رَبِّكَ فَارْغَبْ (8)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "التين",
    surahNumber: 95,
    werd: [
      Werd(
        werdFromTo: '1-8',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَالتِّينِ وَالزَّيْتُونِ (1) وَطُورِ سِينِينَ (2) وَهَٰذَا الْبَلَدِ الْأَمِينِ (3) لَقَدْ خَلَقْنَا الْإِنسَانَ فِي أَحْسَنِ تَقْوِيمٍ (4) ثُمَّ رَدَدْنَاهُ أَسْفَلَ سَافِلِينَ (5) إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَلَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ (6) فَمَا يُكَذِّبُكَ بَعْدُ بِالدِّينِ (7) أَلَيْسَ اللَّهُ بِأَحْكَمِ الْحَاكِمِينَ (8)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "العلق",
    surahNumber: 96,
    werd: [
      Werd(
        werdFromTo: '1-19',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ (1) خَلَقَ الْإِنسَانَ مِنْ عَلَقٍ (2) اقْرَأْ وَرَبُّكَ الْأَكْرَمُ (3) الَّذِي عَلَّمَ بِالْقَلَمِ (4) عَلَّمَ الْإِنسَانَ مَا لَمْ يَعْلَمْ (5) كَلَّا إِنَّ الْإِنسَانَ لَيَطْغَىٰ (6) أَن رَّآهُ اسْتَغْنَىٰ (7) إِنَّ إِلَىٰ رَبِّكَ الرُّجْعَىٰ (8) أَرَأَيْتَ الَّذِي يَنْهَىٰ (9) عَبْدًا إِذَا صَلَّىٰ (10) أَرَأَيْتَ إِن كَانَ عَلَى الْهُدَىٰ (11) أَوْ أَمَرَ بِالتَّقْوَىٰ (12) أَرَأَيْتَ إِن كَذَّبَ وَتَوَلَّىٰ (13) أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَىٰ (14) كَلَّا لَئِن لَّمْ يَنتَهِ لَنَسْفَعًا بِالنَّاصِيَةِ (15) نَاصِيَةٍ كَاذِبَةٍ خَاطِئَةٍ (16) فَلْيَدْعُ نَادِيَهُ (17) سَنَدْعُ الزَّبَانِيَةَ (18) كَلَّا لَا تُطِعْهُ وَاسْجُدْ وَاقْتَرِب ۩ (19)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "القدر",
    surahNumber: 97,
    werd: [
      Werd(
        werdFromTo: '1-5',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّا أَنزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ (1) وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ (2) لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرٍ (3) تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِم مِّن كُلِّ أَمْرٍ (4) سَلَامٌ هِيَ حَتَّىٰ مَطْلَعِ الْفَجْرِ (5)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "البينة",
    surahNumber: 98,
    werd: [
      Werd(
        werdFromTo: '1-8',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "لَمْ يَكُنِ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ مُنفَكِّينَ حَتَّىٰ تَأْتِيَهُمُ الْبَيِّنَةُ (1) رَسُولٌ مِّنَ اللَّهِ يَتْلُو صُحُفًا مُّطَهَّرَةً (2) فِيهَا كُتُبٌ قَيِّمَةٌ (3) وَمَا تَفَرَّقَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِن بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَةُ (4) وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ ۚ وَذَٰلِكَ دِينُ الْقَيِّمَةِ (5) إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ فِي نَارِ جَهَنَّمَ خَالِدِينَ فِيهَا ۚ أُولَٰئِكَ هُمْ شَرُّ الْبَرِيَّةِ (6) إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أُولَٰئِكَ هُمْ خَيْرُ الْبَرِيَّةِ (7) جَزَاؤُهُمْ عِندَ رَبِّهِمْ جَنَّاتُ عَدْنٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۖ رَّضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ۚ ذَٰلِكَ لِمَنْ خَشِيَ رَبَّهُ (8)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الزلزلة",
    surahNumber: 99,
    werd: [
      Werd(
        werdFromTo: '1-8',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِذَا زُلْزِلَتِ الْأَرْضُ زِلْزَالَهَا (1) وَأَخْرَجَتِ الْأَرْضُ أَثْقَالَهَا (2) وَقَالَ الْإِنسَانُ مَا لَهَا (3) يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا (4) بِأَنَّ رَبَّكَ أَوْحَىٰ لَهَا (5) يَوْمَئِذٍ يَصْدُرُ النَّاسُ أَشْتَاتًا لِّيُرَوْا أَعْمَالَهُمْ (6) فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ (7) وَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ (8)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "العاديات",
    surahNumber: 100,
    werd: [
      Werd(
        werdFromTo: '1-11',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَالْعَادِيَاتِ ضَبْحًا (1) فَالْمُورِيَاتِ قَدْحًا (2) فَالْمُغِيرَاتِ صُبْحًا (3) فَأَثَرْنَ بِهِ نَقْعًا (4) فَوَسَطْنَ بِهِ جَمْعًا (5) إِنَّ الْإِنسَانَ لِرَبِّهِ لَكَنُودٌ (6) وَإِنَّهُ عَلَىٰ ذَٰلِكَ لَشَهِيدٌ (7) وَإِنَّهُ لِحُبِّ الْخَيْرِ لَشَدِيدٌ (8) أَفَلَا يَعْلَمُ إِذَا بُعْثِرَ مَا فِي الْقُبُورِ (9) وَحُصِّلَ مَا فِي الصُّدُورِ (10) إِنَّ رَبَّهُم بِهِمْ يَوْمَئِذٍ لَّخَبِيرٌ (11)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "القارعة",
    surahNumber: 101,
    werd: [
      Werd(
        werdFromTo: '1-11',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "الْقَارِعَةُ (1) مَا الْقَارِعَةُ (2) وَمَا أَدْرَاكَ مَا الْقَارِعَةُ (3) يَوْمَ يَكُونُ النَّاسُ كَالْفَرَاشِ الْمَبْثُوثِ (4) وَتَكُونُ الْجِبَالُ كَالْعِهْنِ الْمَنفُوشِ (5) فَأَمَّا مَن ثَقُلَتْ مَوَازِينُهُ (6) فَهُوَ فِي عِيشَةٍ رَّاضِيَةٍ (7) وَأَمَّا مَنْ خَفَّتْ مَوَازِينُهُ (8) فَأُمُّهُ هَاوِيَةٌ (9) وَمَا أَدْرَاكَ مَا هِيَهْ (10) نَارٌ حَامِيَةٌ (11)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "التكاثر",
    surahNumber: 102,
    werd: [
      Werd(
        werdFromTo: '1-8',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَلْهَاكُمُ التَّكَاثُرُ (1) حَتَّىٰ زُرْتُمُ الْمَقَابِرَ (2) كَلَّا سَوْفَ تَعْلَمُونَ (3) ثُمَّ كَلَّا سَوْفَ تَعْلَمُونَ (4) كَلَّا لَوْ تَعْلَمُونَ عِلْمَ الْيَقِينِ (5) لَتَرَوُنَّ الْجَحِيمَ (6) ثُمَّ لَتَرَوُنَّهَا عَيْنَ الْيَقِينِ (7) ثُمَّ لَتُسْأَلُنَّ يَوْمَئِذٍ عَنِ النَّعِيمِ (8)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "العصر",
    surahNumber: 103,
    werd: [
      Werd(
        werdFromTo: '1-3',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَالْعَصْرِ (1) إِنَّ الْإِنسَانَ لَفِي خُسْرٍ (2) إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ (3)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الهمزة",
    surahNumber: 104,
    werd: [
      Werd(
        werdFromTo: '1-9',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "وَيْلٌ لِّكُلِّ هُمَزَةٍ لُّمَزَةٍ (1) الَّذِي جَمَعَ مَالًا وَعَدَّدَهُ (2) يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ (3) كَلَّا ۖ لَيُنبَذَنَّ فِي الْحُطَمَةِ (4) وَمَا أَدْرَاكَ مَا الْحُطَمَةُ (5) نَارُ اللَّهِ الْمُوقَدَةُ (6) الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ (7) إِنَّهَا عَلَيْهِم مُّؤْصَدَةٌ (8) فِي عَمَدٍ مُّمَدَّدَةٍ (9)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الفيل",
    surahNumber: 105,
    werd: [
      Werd(
        werdFromTo: '1-5',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ (1) أَلَمْ يَجْعَلْ كَيْدَهُمْ فِي تَضْلِيلٍ (2) وَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ (3) تَرْمِيهِم بِحِجَارَةٍ مِّن سِجِّيلٍ (4) فَجَعَلَهُمْ كَعَصْفٍ مَّأْكُولٍ (5)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "قريش",
    surahNumber: 106,
    werd: [
      Werd(
        werdFromTo: '1-4',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "لِإِيلَافِ قُرَيْشٍ (1) إِيلَافِهِمْ رِحْلَةَ الشِّتَاءِ وَالصَّيْفِ (2) فَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ (3) الَّذِي أَطْعَمَهُم مِّن جُوعٍ وَآمَنَهُم مِّنْ خَوْفٍ (4)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الماعون",
    surahNumber: 107,
    werd: [
      Werd(
        werdFromTo: '1-7',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "أَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ (1) فَذَٰلِكَ الَّذِي يَدُعُّ الْيَتِيمَ (2) وَلَا يَحُضُّ عَلَىٰ طَعَامِ الْمِسْكِينِ (3) فَوَيْلٌ لِّلْمُصَلِّينَ (4) الَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ (5) الَّذِينَ هُمْ يُرَاءُونَ (6) وَيَمْنَعُونَ الْمَاعُونَ (7)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الكوثر",
    surahNumber: 108,
    werd: [
      Werd(
        werdFromTo: '1-3',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ (1) فَصَلِّ لِرَبِّكَ وَانْحَرْ (2) إِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ (3)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الكافرون",
    surahNumber: 109,
    werd: [
      Werd(
        werdFromTo: '1-6',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "قُلْ يَا أَيُّهَا الْكَافِرُونَ (1) لَا أَعْبُدُ مَا تَعْبُدُونَ (2) وَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ (3) وَلَا أَنَا عَابِدٌ مَّا عَبَدتُّمْ (4) وَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ (5) لَكُمْ دِينُكُمْ وَلِيَ دِينِ (6)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "النصر",
    surahNumber: 110,
    werd: [
      Werd(
        werdFromTo: '1-3',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ (1) وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا (2) فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ ۚ إِنَّهُ كَانَ تَوَّابًا (3)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "المسد",
    surahNumber: 111,
    werd: [
      Werd(
        werdFromTo: '1-5',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ (1) مَا أَغْنَىٰ عَنْهُ مَالُهُ وَمَا كَسَبَ (2) سَيَصْلَىٰ نَارًا ذَاتَ لَهَبٍ (3) وَامْرَأَتُهُ حَمَّالَةَ الْحَطَبِ (4) فِي جِيدِهَا حَبْلٌ مِّن مَّسَدٍ (5)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الاخلاص",
    surahNumber: 112,
    werd: [
      Werd(
        werdFromTo: '1-4',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "قُلْ هُوَ اللَّهُ أَحَدٌ (1) اللَّهُ الصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ (4)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الفلق",
    surahNumber: 113,
    werd: [
      Werd(
        werdFromTo: '1-5',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)",
        ],
      ),
    ],
  ),
  Surah(
    surahName: "الناس",
    surahNumber: 114,
    werd: [
      Werd(
        werdFromTo: '1-6',
        ayats: [
          "بسم الله الرحمن الرحيم",
          "قُلْ أَعُوذُ بِرَبِّ النَّاسِ (1) مَلِكِ النَّاسِ (2) إِلَٰهِ النَّاسِ (3) مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ (4) الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (5) مِنَ الْجِنَّةِ وَالنَّاسِ (6)",
        ],
      ),
    ],
  ),
];
